[
  {
    "id": "hackernews_45253458",
    "source": "Hacker News",
    "url": "https://openai.com/index/gpt-5-system-card-addendum-gpt-5-codex/",
    "title": "Addendum to GPT-5 system card: GPT-5-Codex",
    "summary": "OpenAI has issued an addendum to its GPT-5 system card, formally introducing GPT-5-Codex. This development signals the imminent arrival of a specialized variant of the next-generation GPT-5 large language model, specifically engineered for advanced code-related applications. Building on the legacy of previous Codex models, GPT-5-Codex is anticipated to offer significantly enhanced capabilities in areas such as automated code generation, intelligent debugging assistance, and sophisticated code understanding across a wide array of programming languages. The addendum likely details the model's architectural innovations, performance metrics, and the rigorous safety and ethical considerations applied to its development and deployment within software engineering workflows. This strategic release highlights OpenAI's commitment to pushing the boundaries of AI in developer tools, aiming to boost productivity, streamline development cycles, and foster innovation in the tech industry. The system card addendum is crucial for understanding the model's specific functionalities, limitations, and responsible use guidelines.",
    "keywords": [
      "GPT-5",
      "Codex",
      "Code Generation",
      "Large Language Model",
      "AI Development",
      "Programming Tools"
    ],
    "area": [
      "Large Language Model",
      "Generative AI",
      "Artificial Intelligence"
    ],
    "published_time": "2025-09-15 18:45:32",
    "download_time": "2025-09-15 20:08:10",
    "extra_info": "{\"score\": 63, \"by\": \"wertyk\", \"descendants\": 24, \"story_id\": 45253458}"
  },
  {
    "id": "hackernews_45251593",
    "source": "Hacker News",
    "url": "https://www.bleepingcomputer.com/news/microsoft/microsoft-to-force-install-the-microsoft-365-copilot-app-in-october/",
    "title": "Microsoft to force install the Microsoft 365 Copilot app in October",
    "summary": "Microsoft is reportedly planning to implement a mandatory installation of its Microsoft 365 Copilot application for users starting in October. This strategic move signifies a significant push by the tech giant to integrate its AI-powered productivity assistant more deeply into its widely used enterprise suite. The forced installation could have substantial implications for IT administrators, who will need to manage the deployment across their organizations, and for end-users, who will find the AI assistant automatically available within their Microsoft 365 environment. While the initiative aims to accelerate the adoption of AI tools and enhance user productivity by leveraging Copilot's capabilities in document creation, data analysis, and communication, it also raises questions regarding user control over software installations, potential resource allocation on devices, and data privacy considerations. This aggressive deployment strategy underscores Microsoft's commitment to embedding artificial intelligence as a core component of its software ecosystem, potentially reshaping how businesses interact with their productivity applications and accelerating the mainstream adoption of generative AI in the workplace.",
    "keywords": [
      "Microsoft 365",
      "Copilot",
      "AI Assistant",
      "Software Deployment",
      "Enterprise Software",
      "Productivity Tools",
      "Artificial Intelligence"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2025-09-15 16:22:23",
    "download_time": "2025-09-15 20:08:37",
    "extra_info": "{\"score\": 138, \"by\": \"mikece\", \"descendants\": 125, \"story_id\": 45251593}"
  },
  {
    "id": "hackernews_45253996",
    "source": "Hacker News",
    "url": "https://www.axios.com/2025/09/15/ai-stocks-recession",
    "title": "AI hype is masking recession signals in the market",
    "summary": "The article raises a significant concern that the pervasive enthusiasm and investment frenzy surrounding Artificial Intelligence (AI) are currently masking crucial economic signals indicative of a potential recession. Despite the robust performance and investor confidence in AI-related stocks, this intense hype may be causing market participants to overlook broader macroeconomic challenges, including persistent inflation, escalating interest rates, and geopolitical uncertainties. The analysis posits that the market's singular focus on AI's transformative capabilities could be fostering an environment of overvaluation within specific technology sectors, drawing parallels to historical market bubbles. Consequently, investors are advised to adopt a more discerning approach, extending their analysis beyond the immediate allure of AI advancements to thoroughly evaluate underlying economic fundamentals. The piece advocates for a balanced perspective, emphasizing the necessity for market participants to weigh both the promising opportunities presented by AI and the overarching risks threatening the global economy, thereby preventing an unexpected downturn.",
    "keywords": [
      "AI hype",
      "Recession",
      "Market analysis",
      "Economic indicators",
      "Investor sentiment",
      "Tech stocks",
      "Market bubble"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Generative AI"
    ],
    "published_time": "2025-09-15 19:37:02",
    "download_time": "2025-09-15 20:08:50",
    "extra_info": "{\"score\": 9, \"by\": \"toomuchtodo\", \"descendants\": 1, \"story_id\": 45253996}"
  },
  {
    "id": "hackernews_45250720",
    "source": "Hacker News",
    "url": "https://news.ycombinator.com/item?id=45250720",
    "title": "Launch HN: Trigger.dev (YC W23) – Open-source platform to build reliable AI apps",
    "summary": "Trigger.dev, an open-source developer platform under the Apache 2.0 license, has launched to enable the creation and management of reliable AI agents and workflows. Founded in 2023, the platform provides comprehensive tools for building production-grade AI applications directly within a codebase. It supports deployment, execution, monitoring, and debugging of these agents. Developers have the flexibility to utilize Trigger.dev's core primitives or integrate with popular AI development frameworks such as Mastra, LangChain, and Vercel AI SDK. The platform offers both self-hosting options for complete control and a cloud service that handles scaling, ensuring robust performance for asynchronous background jobs and workflows. A demo is available to showcase its capabilities.",
    "keywords": [
      "Open-source",
      "AI agents",
      "Developer platform",
      "Workflows",
      "Apache 2.0",
      "Production-grade",
      "Self-hosting",
      "Cloud scaling"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2025-09-15 15:20:18",
    "download_time": "2025-09-15 20:08:03",
    "extra_info": "{\"score\": 99, \"by\": \"eallam\", \"descendants\": 38, \"story_id\": 45250720}"
  },
  {
    "id": "hackernews_45247890",
    "source": "Hacker News",
    "url": "https://github.com/tekaratzas/RustGPT",
    "title": "RustGPT: A pure-Rust transformer LLM built from scratch",
    "summary": "RustGPT represents a significant development in the field of large language models, offering a pure-Rust transformer LLM meticulously built from scratch. This ambitious project capitalizes on Rust's inherent strengths, including its exceptional performance, guaranteed memory safety, and robust concurrency primitives, to establish a highly efficient and reliable foundation for advanced AI models. Diverging from the prevalent Python-centric ecosystem for LLM development, RustGPT provides a compelling alternative for engineers and researchers who prioritize granular control over system resources, seek enhanced execution speeds, or operate within environments demanding strict safety and security protocols. This initiative underscores a broader trend towards diversifying the technological stack for deep learning infrastructure, challenging the status quo and opening new avenues for innovation. The emergence of RustGPT could accelerate the creation of more secure, performant, and deployable AI solutions, thereby enriching the machine learning landscape and expanding its practical applications.",
    "keywords": [
      "Rust",
      "Transformer Architecture",
      "Large Language Model",
      "Deep Learning",
      "AI Development",
      "Memory Safety",
      "High Performance Computing"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Large Language Model"
    ],
    "published_time": "2025-09-15 09:47:18",
    "download_time": "2025-09-15 20:08:18",
    "extra_info": "{\"score\": 309, \"by\": \"amazonhut\", \"descendants\": 154, \"story_id\": 45247890}"
  },
  {
    "id": "hackernews_45249985",
    "source": "Hacker News",
    "url": "https://tidyfirst.substack.com/p/programming-deflation",
    "title": "Programming Deflation",
    "summary": "The article \"Programming Deflation\" likely explores the concept of a decreasing value or cost associated with programming tasks, primarily driven by rapid advancements in artificial intelligence, automation, and sophisticated development tools. It is expected to discuss how technologies such as large language models (LLMs) and other AI-powered assistants are significantly boosting developer productivity, enabling faster code generation, more efficient debugging, and streamlined maintenance processes. The piece probably analyzes the economic ramifications of these trends, including potential shifts in the job market for software engineers, the commoditization of certain coding skills, and the overall reduction in software development expenditures. Furthermore, it may delve into the evolving role of programmers, emphasizing a greater focus on high-level design, architectural planning, and complex problem-solving, rather than routine coding. This suggests a future where human creativity and strategic thinking become paramount as AI handles more repetitive tasks, ultimately examining the long-term effects on the tech industry and the necessary adaptations for professionals.",
    "keywords": [
      "Programming",
      "Software Development",
      "Artificial Intelligence",
      "Large Language Models",
      "Automation",
      "Developer Productivity",
      "Economic Impact",
      "Future of Work"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Generative AI"
    ],
    "published_time": "2025-09-15 14:11:43",
    "download_time": "2025-09-15 20:08:38",
    "extra_info": "{\"score\": 91, \"by\": \"dvcoolarun\", \"descendants\": 63, \"story_id\": 45249985}"
  },
  {
    "id": "LLMs-from-scratch",
    "source": "GitHub",
    "url": "https://github.com/rasbt/LLMs-from-scratch",
    "title": "Build a Large Language Model (From Scratch)",
    "summary": "This GitHub repository provides the official code for \"Build a Large Language Model (From Scratch),\" a book guiding users through developing, pretraining, and finetuning GPT-like LLMs from the ground up. It offers a step-by-step approach to understanding LLM mechanics by coding them from scratch, mirroring the methods used for large-scale foundational models. The project includes comprehensive code examples for implementing attention mechanisms, building a GPT model, pretraining on unlabeled data, and finetuning for tasks like text classification and instruction following. Utilizing PyTorch, the repository avoids external LLM libraries, making it an excellent educational resource for those seeking deep insights into LLM architecture and training processes. It also supports loading weights from larger pretrained models for finetuning and provides extensive bonus materials covering advanced topics like BPE tokenizers, efficient attention, hyperparameter tuning, and various LLM implementations (Llama, Qwen, Gemma). The code is designed to run on conventional hardware, making LLM development accessible.",
    "keywords": [
      "Large Language Models",
      "GPT",
      "Deep Learning",
      "PyTorch",
      "Pretraining",
      "Finetuning",
      "Natural Language Processing",
      "Attention Mechanisms"
    ],
    "area": [
      "Large Language Model",
      "Deep Learning",
      "Natural Language Processing"
    ],
    "published_time": "2025-09-14T20:46:48Z",
    "download_time": "2024-07-29 12:00:00",
    "extra_info": null
  },
  {
    "id": "markitdown",
    "source": "GitHub",
    "url": "https://github.com/microsoft/markitdown",
    "title": "MarkItDown",
    "summary": "MarkItDown is a lightweight Python utility designed for converting diverse file formats into Markdown, primarily for integration with Large Language Models (LLMs) and text analysis pipelines. It supports a wide array of input types, including PDF, PowerPoint, Word, Excel, images (with OCR), audio (with speech transcription), HTML, various text-based formats, ZIP archives, YouTube URLs, and EPubs. A key focus of MarkItDown is to preserve essential document structure, such as headings, lists, tables, and links, ensuring that the output Markdown is both human-readable and machine-consumable. The tool leverages Markdown's inherent token efficiency and its native understanding by mainstream LLMs, which are often trained on Markdown-formatted text. MarkItDown offers flexible installation with optional dependencies, a command-line interface, a Python API, and Docker support. It also features extensibility through a plugin system and integrates with Azure Document Intelligence for enhanced conversion capabilities, and can use LLMs for image descriptions.",
    "keywords": [
      "Markdown Conversion",
      "LLM Applications",
      "Document Processing",
      "Text Analysis",
      "Python Utility",
      "File Conversion",
      "OCR",
      "Speech Transcription"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2025-08-26T22:30:47Z",
    "download_time": "2024-07-30 07:00:00",
    "extra_info": null
  },
  {
    "id": "ai-hedge-fund",
    "source": "GitHub",
    "url": "https://github.com/virattt/ai-hedge-fund",
    "title": "AI Hedge Fund",
    "summary": "The AI Hedge Fund is a proof-of-concept project exploring the application of artificial intelligence in making trading decisions, primarily for educational and research purposes. It features a sophisticated multi-agent system where various AI agents, inspired by renowned investors like Warren Buffett, Ben Graham, and Michael Burry, collaborate to analyze financial data. Key agents include those focused on disciplined valuation, market sentiment, fundamental analysis, technical indicators, risk management, and portfolio management, which collectively generate trading signals and simulated investment decisions. The system is explicitly not intended for real trading, emphasizing its role as a learning tool. It offers both a command-line interface for granular control and a user-friendly web application, requiring API keys for large language models (like OpenAI) and comprehensive financial datasets. This project provides a robust, agent-based framework for understanding and experimenting with AI's potential in financial markets and advanced investment strategies.",
    "keywords": [
      "AI Hedge Fund",
      "Algorithmic Trading",
      "Multi-Agent System",
      "Financial AI",
      "Investment Strategy",
      "Valuation",
      "Risk Management"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-09-15T19:33:45Z",
    "download_time": "2024-07-30 10:00:00",
    "extra_info": null
  },
  {
    "id": "2509.09677",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2509.09677",
    "title": "回报递减的错觉：衡量大型语言模型中的长周期执行能力",
    "summary": "大型语言模型（LLMs）的持续扩展是否会产生回报递减？现实世界的价值往往源于智能体能够完成的任务长度。本研究首先观察到一个简单但反直觉的事实：单步准确率的边际增益可以复合为模型成功完成任务长度的指数级提升。接着，我们认为LLMs在简单任务变长时出现的失败源于执行错误，而非推理能力的不足。我们提出通过明确提供解决长周期任务所需的知识和计划来隔离执行能力。我们发现，即使小型模型具有100%的单步准确率，大型模型也能正确执行显著更多的轮次。我们观察到，模型的每步准确率会随着步数的增加而下降。这不仅仅是由于长上下文限制——奇怪的是，我们观察到一种自条件效应——当上下文包含模型先前轮次的错误时，模型更容易犯错。自条件效应并不会仅仅通过扩展模型规模而减少。相比之下，最近的思维模型不会出现自条件效应，并且可以在单轮中执行更长的任务。最后，我们对前沿思维模型在单轮中可执行的任务长度进行了基准测试。总的来说，通过关注执行能力，我们希望调和关于LLMs如何解决复杂推理问题却在简单任务变长时失败的争论，并强调扩展模型规模和顺序测试时计算对于长周期任务的巨大益处。",
    "keywords": [
      "大型语言模型",
      "长周期执行",
      "执行能力",
      "自条件效应",
      "思维模型"
    ],
    "area": [
      "大模型",
      "自然语言处理",
      "智能体"
    ],
    "published_time": "2025-09-11T17:59:34.000Z",
    "download_time": "2025-09-15 13:09:14",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2509.09677\", \"arxiv_url\": \"https://arxiv.org/abs/2509.09677\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2509.09677.png\", \"original_title\": \"The Illusion of Diminishing Returns: Measuring Long Horizon Execution in\\n  LLMs\"}"
  },
  {
    "id": "2509.10441",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2509.10441",
    "title": "InfGen：一种面向可扩展图像合成的分辨率无关范式",
    "summary": "任意分辨率的图像生成为跨设备提供了统一的视觉体验，在生产者和消费者中都有广泛的应用。当前的扩散模型计算需求随分辨率呈二次方增长，导致生成4K图像需要超过100秒的延迟。为了解决这个问题，我们探索了基于潜在扩散模型的第二代方法，其中扩散模型生成的固定潜在表示被视为内容表示，我们提出使用一步生成器从紧凑的生成潜在表示中解码任意分辨率的图像。因此，我们提出了InfGen，它用新的生成器取代了VAE解码器，可以在不重新训练扩散模型的情况下，从固定大小的潜在表示生成任意分辨率的图像，这简化了过程，降低了计算复杂度，并且可以应用于使用相同潜在空间的任何模型。实验表明，InfGen能够将许多模型提升到任意高分辨率时代，同时将4K图像生成时间缩短到10秒以内。",
    "keywords": [
      "任意分辨率图像生成",
      "扩散模型",
      "潜在扩散模型",
      "图像合成",
      "分辨率无关"
    ],
    "area": [
      "计算机视觉",
      "深度学习",
      "生成式AI"
    ],
    "published_time": "2025-09-12T17:48:57.000Z",
    "download_time": "2025-09-15 13:09:12",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2509.10441\", \"arxiv_url\": \"https://arxiv.org/abs/2509.10441\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2509.10441.png\", \"original_title\": \"InfGen: A Resolution-Agnostic Paradigm for Scalable Image Synthesis\"}"
  },
  {
    "id": "2509.09713",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2509.09713",
    "title": "HANRAG：用于多跳问答的启发式精确抗噪检索增强生成",
    "summary": "检索增强生成（RAG）方法通过将信息检索（IR）技术与大型语言模型（LLM）相结合，增强了问答系统和对话生成任务。这种从外部知识库检索信息以增强生成模型响应能力的方法已取得一定成功。然而，当前的RAG方法在处理多跳查询时仍面临诸多挑战。例如，一些方法过度依赖迭代检索，在复合查询上浪费了过多的检索步骤。此外，使用原始复杂查询进行检索可能无法捕获与特定子查询相关的内容，导致检索到的内容存在噪声。如果噪声得不到有效管理，可能导致噪声累积问题。为解决这些问题，我们引入了HANRAG，一个新颖的基于启发式框架，旨在高效处理不同复杂程度的问题。在强大的揭示器驱动下，HANRAG路由查询，将其分解为子查询，并从检索到的文档中过滤噪声。这增强了系统的适应性和抗噪能力，使其能够高效处理各种查询。我们将所提出的框架与各种基准上的其他领先行业方法进行了比较。结果表明，我们的框架在单跳和多跳问答任务中均取得了卓越的性能。",
    "keywords": [
      "检索增强生成",
      "多跳问答",
      "大型语言模型",
      "噪声过滤",
      "启发式框架"
    ],
    "area": [
      "自然语言处理",
      "大模型",
      "生成式AI"
    ],
    "published_time": "2025-09-08T06:22:38.000Z",
    "download_time": "2025-09-15 13:09:13",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2509.09713\", \"arxiv_url\": \"https://arxiv.org/abs/2509.09713\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2509.09713.png\", \"original_title\": \"HANRAG: Heuristic Accurate Noise-resistant Retrieval-Augmented\\n  Generation for Multi-hop Question Answering\"}"
  },
  {
    "id": "2509.10396",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2509.10396",
    "title": "扩散大语言模型的修复引导策略优化",
    "summary": "掩码扩散大语言模型（dLLMs）正作为自回归LLMs的有前景替代方案出现，它们在提供有竞争力的性能的同时，支持诸如修复（inpainting）等独特的生成能力。我们探索了修复如何为dLLMs的强化学习算法设计提供信息。将LLMs与强化学习对齐面临一个探索挑战：当模型未能发现正确解决方案时，奖励信号稀疏且样本浪费。尽管这种低效率广泛影响LLMs，但dLLMs提供了一个独特的机会——它们的修复能力可以指导探索。我们引入了IGPO（修复引导策略优化），这是一个强化学习框架，它在在线采样期间策略性地插入部分真实推理轨迹。与提供完整解决方案不同，修复将探索引向有前景的轨迹空间，同时保留了自生成的推理，从而弥合了监督微调和强化学习之间的鸿沟。我们将IGPO应用于基于群组的优化方法，例如GRPO，在这些方法中，探索失败会导致零优势和梯度。IGPO恢复了有意义的梯度，同时提高了样本效率。我们还提出了对合成重写的简洁轨迹进行监督微调，这些轨迹更好地与dLLM的生成模式对齐。结合包括基于熵的过滤在内的额外技术，我们的训练方案在三个数学基准测试（GSM8K、Math500和AMC）上取得了显著提升，为全注意力掩码dLLMs实现了新的最先进结果。",
    "keywords": [
      "扩散大语言模型",
      "修复",
      "强化学习",
      "策略优化",
      "数学基准"
    ],
    "area": [
      "大模型",
      "生成式AI",
      "自然语言处理"
    ],
    "published_time": "2025-09-12T16:44:31.000Z",
    "download_time": "2025-09-15 13:09:15",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2509.10396\", \"arxiv_url\": \"https://arxiv.org/abs/2509.10396\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2509.10396.png\", \"original_title\": \"Inpainting-Guided Policy Optimization for Diffusion Large Language\\n  Models\"}"
  },
  {
    "id": "2509.09734",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2509.09734",
    "title": "MCP-AgentBench：使用MCP介导工具评估真实世界语言智能体性能",
    "summary": "模型上下文协议（MCP）正迅速成为一个关键的开放标准，旨在增强智能体与工具的集成和互操作性，并有望开启一个强大、互联且真正实用的智能体AI新时代。然而，尽管MCP日益普及，现有基准测试往往未能在此新范式下捕捉真实世界的智能体性能，导致对其真实操作价值的认知偏差，并无法可靠地区分其熟练程度。为了弥合这一关键评估差距，我们引入了MCP-AgentBench——一个专门设计用于严格评估语言智能体在MCP介导工具交互中能力的综合基准测试。MCP-AgentBench的核心贡献包括：建立了一个由33个操作服务器和188个不同工具组成的强大MCP测试平台；开发了一个包含600个系统设计查询的基准测试，这些查询分布在6个不同交互复杂度的类别中；以及引入了MCP-Eval，一种新颖的、以结果为导向的评估方法，优先考虑真实世界的任务成功。通过对领先语言智能体进行广泛的实证评估，我们提供了基础性见解。MCP-AgentBench旨在为研究社区提供一个标准化、可靠的框架，以构建、验证和推进能够充分利用MCP变革性优势的智能体，从而加速实现真正有能力和可互操作的AI系统。",
    "keywords": [
      "MCP-AgentBench",
      "语言智能体",
      "基准测试",
      "工具交互",
      "模型上下文协议"
    ],
    "area": [
      "人工智能",
      "智能体",
      "自然语言处理"
    ],
    "published_time": "2025-09-10T14:08:40.000Z",
    "download_time": "2025-09-15 13:09:15",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2509.09734\", \"arxiv_url\": \"https://arxiv.org/abs/2509.09734\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2509.09734.png\", \"original_title\": \"MCP-AgentBench: Evaluating Real-World Language Agent Performance with\\n  MCP-Mediated Tools\"}"
  },
  {
    "id": "2509.09737",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2509.09737",
    "title": "基于概率结构整合的世界建模",
    "summary": "我们提出了概率结构整合（PSI），这是一个旨在从数据中学习高度可控且灵活可提示的世界模型的系统。PSI 包含一个三步循环。第一步是概率预测，涉及构建一个数据的概率图模型Psi，其形式为随机访问自回归序列模型。Psi 支持一套完整的学习条件分布，描述数据中任何变量对其他变量集的依赖关系。第二步是结构提取，我们展示了如何通过对Psi进行因果推断，以零样本方式提取数据中潜在的低维属性，这些属性对应于一系列有意义的“中间结构”。第三步是整合，通过将这些结构转换为新的令牌类型，并将其作为条件信号和预测目标持续混合回训练数据中，从而完成循环。每个这样的循环都增强了Psi的能力，不仅能更好地建模底层数据，还创造了新的控制句柄——类似于大型语言模型（LLM）的通用提示语言。我们使用1.4万亿个互联网视频数据令牌训练了一个Psi实例；我们利用它执行各种有用的视频预测和理解推断；我们提取了最先进的光流、自监督深度和对象分割；并且我们利用这些结构来支持一个完整的预测改进循环。",
    "keywords": [
      "世界建模",
      "概率结构整合",
      "视频理解",
      "自回归模型",
      "结构提取"
    ],
    "area": [
      "机器学习",
      "视频理解",
      "大模型"
    ],
    "published_time": "2025-09-10T18:01:04.000Z",
    "download_time": "2025-09-15 13:09:15",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2509.09737\", \"arxiv_url\": \"https://arxiv.org/abs/2509.09737\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2509.09737.png\", \"original_title\": \"World Modeling with Probabilistic Structure Integration\"}"
  },
  {
    "id": "twitter_sama_1967650108285259822",
    "source": "Twitter",
    "url": "https://x.com/sama/status/1967650108285259822",
    "title": "sama_GPT-5-Codex Launch",
    "summary": "Sam Altman announced the release of GPT-5-Codex, a specialized version of GPT-5 engineered for enhanced agentic coding capabilities. This new iteration boasts significant improvements in speed and intelligence, alongside the introduction of novel functionalities. The team behind its development has been highly productive, making the process engaging to observe. The announcement invites user feedback on the new model, signaling a commitment to iterative improvement and community engagement in the advancement of AI-powered coding tools. This development represents a notable step forward in large language models tailored for software development and automation.",
    "keywords": [
      "GPT-5-Codex",
      "Agentic Coding",
      "AI",
      "LLM",
      "Product Launch"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Product Launch"
    ],
    "published_time": "2025-09-15 18:01:57",
    "download_time": "2025-09-15 19:15:51",
    "extra_info": "{\"username\": \"sama\", \"tweet_id\": \"1967650108285259822\", \"retweet_count\": 222, \"reply_count\": 460, \"like_count\": 3327, \"quote_count\": 66, \"view_count\": 177169, \"is_reply\": false, \"language\": \"en\", \"bookmark_count\": 343}"
  },
  {
    "id": "twitter_polynoamial_1967667644905251156",
    "source": "Twitter",
    "url": "https://x.com/polynoamial/status/1967667644905251156",
    "title": "polynoamial_GPT-5-Codex Performance",
    "summary": "The tweet highlights the performance characteristics of GPT-5-Codex, a new iteration of AI language models. It states that GPT-5-Codex demonstrates a significant speed improvement, being 10 times faster for simpler queries. Conversely, for more complex tasks that benefit from extensive computational resources, the model is designed to allocate twice the processing time. This suggests a sophisticated approach to resource management and query optimization, aiming to balance efficiency for common tasks with enhanced performance for computationally intensive challenges. The accompanying URL likely leads to further details or a demonstration of these capabilities, positioning GPT-5-Codex as a notable advancement in AI model efficiency and power.",
    "keywords": [
      "GPT-5-Codex",
      "AI Performance",
      "Compute",
      "Query Optimization",
      "Language Models"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Tech News"
    ],
    "published_time": "2025-09-15 19:11:38",
    "download_time": "2025-09-15 19:18:41",
    "extra_info": "{\"username\": \"polynoamial\", \"tweet_id\": \"1967667644905251156\", \"retweet_count\": 1, \"reply_count\": 0, \"like_count\": 42, \"quote_count\": 0, \"view_count\": 1075, \"is_reply\": false, \"language\": \"en\", \"bookmark_count\": 4}"
  },
  {
    "id": "twitter_NaveenGRao_1967612077255864505",
    "source": "Twitter",
    "url": "https://x.com/NaveenGRao/status/1967612077255864505",
    "title": "NaveenGRao_Databricks Departure",
    "summary": "Naveen Rao announced his departure from Databricks after approximately 2.5 years, coinciding with the company's valuation surpassing $100 billion, a goal set by co-founder Ali Ghodsi. Rao highlighted his involvement in Databricks' growth, particularly its AI integration, and thanked founders Ali Ghodsi, Matei Zaharia, Patrick Wendell, Arsalan Tavakoli-Shiraji, and Ion Stoica for the journey. He is spinning out a new venture focused on foundational AI and computing challenges, while remaining an advisor to Databricks. Rao also reflected on the five years since initial discussions about efficient neural networks with Jeff Dean, Misha Parikh, and Hanlin Tang, emphasizing AI's potential to impact every human life and Databricks' strong position in enterprise AI adoption.",
    "keywords": [
      "Databricks",
      "AI",
      "Valuation",
      "Foundational AI",
      "Neural Networks",
      "Enterprise AI"
    ],
    "area": [
      "Artificial Intelligence",
      "Industry News",
      "Tech News"
    ],
    "published_time": "2025-09-15 15:30:50",
    "download_time": "2025-09-15 19:19:10",
    "extra_info": "{\"username\": \"NaveenGRao\", \"tweet_id\": \"1967612077255864505\", \"retweet_count\": 4, \"reply_count\": 18, \"like_count\": 270, \"quote_count\": 2, \"view_count\": 27298, \"is_reply\": false, \"language\": \"en\", \"bookmark_count\": 31}"
  },
  {
    "id": "twitter_ylecun_1967399402039066641",
    "source": "Twitter",
    "url": "https://x.com/ylecun/status/1967399402039066641",
    "title": "ylecun_Vision Language Model",
    "summary": "This tweet highlights a significant advancement in AI research by AI at Meta, which has developed a novel vision-language world model. This model possesses the capability to transform video content into textual plans, enabling it to reason and select optimal actions. This breakthrough represents a substantial step forward in multimodal AI, bridging the gap between visual perception and intelligent decision-making. The ability to process video, generate descriptive text plans, and guide action selection has broad implications for various AI applications, including robotics, autonomous systems, and sophisticated content analysis. The development signifies progress in creating AI systems that can understand and interact with the world in a more human-like manner, processing complex visual information and translating it into actionable strategies.",
    "keywords": [
      "Vision Language Model",
      "AI at Meta",
      "Video Understanding",
      "AI Research",
      "Action Selection"
    ],
    "area": [
      "Artificial Intelligence",
      "Video Understanding",
      "Multimodal"
    ],
    "published_time": "2025-09-15 01:25:44",
    "download_time": "2025-09-15 19:15:22",
    "extra_info": "{\"username\": \"ylecun\", \"tweet_id\": \"1967399402039066641\", \"retweet_count\": 78, \"reply_count\": 15, \"like_count\": 436, \"quote_count\": 3, \"view_count\": 64171, \"is_reply\": false, \"language\": \"en\", \"bookmark_count\": 312}"
  },
  {
    "id": "twitter_natolambert_1967415613573452211",
    "source": "Twitter",
    "url": "https://x.com/natolambert/status/1967415613573452211",
    "title": "natolambert_Model Size and Training",
    "summary": "The tweet discusses the relationship between model size and training methodology in AI development. It suggests that smaller models, under 15 billion parameters, are effectively trained using Supervised Fine-Tuning (SFT). Conversely, larger models, exceeding 70 billion parameters, benefit most from Reinforcement Learning (RL). The author notes that the middle ground, in terms of model size, presents challenges. Larger models demonstrate a reduced need for extensive training data (signal) to learn effectively, and pre-trained large base models are already quite capable of following instructions. This implies a scaling law where increased model size correlates with improved learning efficiency and inherent instruction-following abilities, simplifying the training process for very large models.",
    "keywords": [
      "model size",
      "training methodology",
      "Supervised Fine-Tuning",
      "Reinforcement Learning",
      "large models"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Large Language Model"
    ],
    "published_time": "2025-09-15 02:30:09",
    "download_time": "2025-09-15 19:17:57",
    "extra_info": "{\"username\": \"natolambert\", \"tweet_id\": \"1967415613573452211\", \"retweet_count\": 37, \"reply_count\": 17, \"like_count\": 484, \"quote_count\": 4, \"view_count\": 53353, \"is_reply\": false, \"language\": \"en\", \"bookmark_count\": 280}"
  },
  {
    "id": "twitter_GaryMarcus_1967601240717902207",
    "source": "Twitter",
    "url": "https://x.com/GaryMarcus/status/1967601240717902207",
    "title": "GaryMarcus_AI Desperation",
    "summary": "Gary Marcus expresses a sense of desperation regarding the current state of Artificial Intelligence development. He highlights concerns about the lack of genuine understanding and reasoning in current AI models, particularly large language models. Marcus suggests that the field is prioritizing scale and performance metrics over fundamental progress in AI's ability to truly comprehend and interact with the world. He implies that the current trajectory might be leading to a dead end or at least a significant plateau in achieving artificial general intelligence, emphasizing the need for a shift in research focus towards more robust and theoretically grounded approaches to AI.",
    "keywords": [
      "AI",
      "Artificial Intelligence",
      "LLM",
      "Reasoning",
      "Understanding",
      "AGI"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Research Progress"
    ],
    "published_time": "2025-09-15 14:47:46",
    "download_time": "2025-09-15 19:17:01",
    "extra_info": "{\"username\": \"GaryMarcus\", \"tweet_id\": \"1967601240717902207\", \"retweet_count\": 0, \"reply_count\": 4, \"like_count\": 47, \"quote_count\": 0, \"view_count\": 6193, \"is_reply\": false, \"language\": \"es\", \"bookmark_count\": 3}"
  }
]