[
  {
    "id": "hackernews_45890394",
    "source": "Hacker News",
    "url": "https://data-formulator.ai/",
    "title": "Show HN: Data Formulator – interactive AI agents for data analysis (Microsoft)",
    "summary": "Microsoft has unveiled Data Formulator, an innovative platform designed for interactive data analysis powered by AI agents. This new release enables users to explore datasets and generate insightful visualizations through a combination of intuitive user interfaces and natural language communication. Building on a previous version, the development focused on seamlessly blending autonomous agent capabilities with direct user interaction, offering a controlled yet flexible data exploration experience. Data Formulator aims to simplify the process of uncovering insights by allowing users to engage more dynamically with their data while maintaining oversight. This solution represents a forward-thinking approach to data analysis, integrating crucial human intervention and iterative refinement into AI-driven workflows, thereby enhancing the utility and accessibility of artificial intelligence in data science.",
    "keywords": [
      "AI agents",
      "data analysis",
      "data visualization",
      "interactive AI",
      "natural language processing",
      "data exploration",
      "Microsoft"
    ],
    "area": [
      "AI Agent",
      "Natural Language Processing",
      "Artificial Intelligence"
    ],
    "published_time": "2025-11-11 17:44:21",
    "download_time": "2025-11-11 20:01:58",
    "extra_info": "{\"score\": 11, \"by\": \"chenglong-hn\", \"descendants\": 6, \"story_id\": 45890394}"
  },
  {
    "id": "hackernews_45886131",
    "source": "Hacker News",
    "url": "https://www.reuters.com/world/german-court-sides-with-plaintiff-copyright-case-against-openai-2025-11-11/",
    "title": "OpenAI may not use lyrics without license, German court rules",
    "summary": "A German court has delivered a landmark ruling, stipulating that OpenAI is prohibited from using copyrighted song lyrics without securing proper licensing. This judgment emerges from a copyright infringement lawsuit, underscoring the escalating legal complexities confronting artificial intelligence developers regarding intellectual property rights within their extensive training datasets. The decision unequivocally mandates that AI models, particularly large language models (LLMs) which assimilate immense quantities of textual content, must conform to existing copyright legislation. This outcome could profoundly influence the methodology by which AI companies acquire and process data for their advanced systems. Such a legal precedent is poised to reshape future data acquisition strategies and content licensing protocols across the AI industry, especially for generative AI applications designed to produce text, music, or other creative outputs potentially derived from copyrighted source materials. It intensifies the ongoing global discourse on harmonizing rapid AI innovation with the crucial protection of creators' rights, indicating a definitive move towards more stringent copyright enforcement in the era of sophisticated generative AI technologies.",
    "keywords": [
      "AI Copyright",
      "Intellectual Property",
      "Large Language Models",
      "Content Licensing",
      "German Law",
      "Generative AI",
      "Data Governance",
      "Legal Precedent"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-11 11:20:55",
    "download_time": "2025-11-11 20:02:32",
    "extra_info": "{\"score\": 193, \"by\": \"aiz0Houp\", \"descendants\": 203, \"story_id\": 45886131}"
  },
  {
    "id": "hackernews_45890186",
    "source": "Hacker News",
    "url": "https://latenitesoft.com/blog/evaluating-frontier-ai-image-generation-models/",
    "title": "We ran over 600 image generations to compare AI image models",
    "summary": "A recent study by LateniteSoft undertook an extensive evaluation of contemporary AI image generation models, performing over 600 distinct image generations to establish a comprehensive comparative analysis. The initiative aimed to meticulously assess the capabilities, performance metrics, and qualitative outputs of various leading-edge generative AI systems currently available. Researchers systematically generated images across diverse prompts and styles to identify strengths, weaknesses, and unique characteristics inherent to each model. This rigorous methodology sought to provide objective insights into the evolving landscape of AI-driven visual content creation, offering valuable data for developers, artists, and researchers keen on understanding the nuances of current generative AI technology. The findings are expected to delineate which models excel in specific use cases, offering a data-driven perspective on factors such as prompt adherence, image quality, stylistic versatility, and efficiency. Such detailed comparisons are crucial for advancing the field and guiding future development in multimodal AI.",
    "keywords": [
      "AI Image Generation",
      "Generative AI",
      "Image Models",
      "Model Comparison",
      "Computer Vision",
      "Performance Evaluation",
      "Benchmarking"
    ],
    "area": [
      "Artificial Intelligence",
      "Generative AI",
      "Computer Vision"
    ],
    "published_time": "2025-11-11 17:26:54",
    "download_time": "2025-11-11 20:01:58",
    "extra_info": "{\"score\": 41, \"by\": \"kalleboo\", \"descendants\": 21, \"story_id\": 45890186}"
  },
  {
    "id": "hackernews_45888878",
    "source": "Hacker News",
    "url": "https://the-decoder.com/yann-lecun-reportedly-leaving-meta-to-launch-new-ai-startup/",
    "title": "Yann LeCun reportedly leaving Meta to launch new AI startup",
    "summary": "Reports indicate that Yann LeCun, a prominent figure in the field of artificial intelligence and Meta's Chief AI Scientist, is preparing to depart from the technology giant to establish his own AI startup. LeCun, widely recognized as one of the 'Godfathers of AI' for his foundational work in deep learning and convolutional neural networks, has been a driving force behind Meta's AI research initiatives, leading fundamental advancements and shaping the company's long-term vision in the domain. His potential departure marks a significant development within the AI landscape, suggesting a shift in strategic focus for one of the industry's most influential researchers. This move could signal an emerging trend of top-tier AI talent migrating from large corporations to entrepreneurial ventures, seeking to innovate more freely or explore niche areas within the rapidly evolving AI ecosystem. While specific details about the new startup's focus remain undisclosed, LeCun's track record suggests it would likely involve cutting-edge research in machine learning, potentially pushing boundaries in areas such as unsupervised learning, world models, or advanced neural architectures. This development underscores the dynamic nature of AI research and the continuous flow of talent shaping its future direction, with potential implications for both academic and industrial progress in the field.",
    "keywords": [
      "Yann LeCun",
      "Deep Learning",
      "AI Startup",
      "Meta AI",
      "Machine Learning Research",
      "Convolutional Neural Networks",
      "AI Leadership"
    ],
    "area": [
      "Artificial Intelligence",
      "Deep Learning",
      "Machine Learning"
    ],
    "published_time": "2025-11-11 16:03:22",
    "download_time": "2025-11-11 20:02:49",
    "extra_info": "{\"score\": 43, \"by\": \"jrwan\", \"descendants\": 6, \"story_id\": 45888878}"
  },
  {
    "id": "hackernews_45885242",
    "source": "Hacker News",
    "url": "https://markusstrasser.org/creative-work-landscapes.html",
    "title": "Why effort scales superlinearly with the perceived quality of creative work",
    "summary": "The article investigates the intriguing principle that effort scales superlinearly with the perceived quality of creative work, meaning that achieving higher levels of excellence demands exponentially greater investment. It explores the intricate dynamics behind this disproportionate relationship, where initial quality improvements may come relatively easily, but subsequent, more subtle refinements—especially in the final stages—require significantly amplified time, resources, and cognitive effort. This phenomenon has profound implications for understanding productivity models, optimizing resource allocation in creative projects, and managing expectations regarding the pursuit of perfection. The discussion provides valuable insights into the challenges faced by creators, whether human artists or sophisticated generative AI models, as they strive to elevate their outputs from merely good to truly exceptional. Furthermore, it highlights the subjective nature of quality assessment and the critical decisions involved in balancing effort against perceived value, offering guidance for strategic planning in both traditional and AI-driven creative endeavors.",
    "keywords": [
      "Creative work",
      "Effort scaling",
      "Perceived quality",
      "Superlinear growth",
      "Creative process",
      "Productivity",
      "Quality standards",
      "Generative AI"
    ],
    "area": [
      "Generative AI",
      "Artificial Intelligence",
      "Machine Learning"
    ],
    "published_time": "2025-11-11 08:29:23",
    "download_time": "2025-11-11 20:02:22",
    "extra_info": "{\"score\": 113, \"by\": \"eatitraw\", \"descendants\": 93, \"story_id\": 45885242}"
  },
  {
    "id": "hackernews_45883788",
    "source": "Hacker News",
    "url": "https://animationobsessive.substack.com/p/the-toy-story-you-remember",
    "title": "The 'Toy Story' You Remember",
    "summary": "The Hacker News story titled 'The 'Toy Story' You Remember' is anticipated to explore the profound cultural and technological impact of Pixar's groundbreaking film. It will likely delve into how 'Toy Story' revolutionized the animation industry through its pioneering use of computer-generated imagery (CGI), setting new standards for 3D animation and digital storytelling. The article might discuss the technical innovations prevalent during its production, such as early rendering algorithms and character animation workflows, which laid essential groundwork for subsequent advancements in computer graphics. Furthermore, the piece could examine the film's enduring legacy, its nostalgic appeal, and how its creative and technical achievements continue to influence modern visual effects and emerging fields like generative media, shaping contemporary approaches to animated content creation.",
    "keywords": [
      "3D Animation",
      "Computer Graphics",
      "Digital Storytelling",
      "Character Animation",
      "Visual Effects",
      "Rendering Technology",
      "Procedural Animation"
    ],
    "area": [
      "Generative AI",
      "Computer Vision",
      "Video Understanding"
    ],
    "published_time": "2025-11-11 03:17:43",
    "download_time": "2025-11-11 20:02:25",
    "extra_info": "{\"score\": 1052, \"by\": \"ani_obsessive\", \"descendants\": 293, \"story_id\": 45883788}"
  },
  {
    "id": "adk-go",
    "source": "GitHub",
    "url": "https://github.com/google/adk-go",
    "title": "Agent Development Kit (ADK) for Go",
    "summary": "The Agent Development Kit (ADK) for Go is an open-source, code-first toolkit designed for building, evaluating, and deploying sophisticated AI agents with flexibility and control. This modular and model-agnostic framework applies robust software development principles to AI agent creation, simplifying the process of building, deploying, and orchestrating complex agent workflows. While optimized for Gemini, ADK supports various models and deployment environments, making it highly adaptable. The Go version specifically leverages Go's strengths in concurrency and performance, making it ideal for cloud-native agent applications. Key features include an idiomatic Go design, a rich ecosystem for integrating pre-built or custom tools, code-first development for ultimate flexibility and testability, and support for modular multi-agent systems. Agents built with ADK Go can be easily containerized and deployed in environments like Google Cloud Run, empowering developers to create scalable and performant AI-driven solutions.",
    "keywords": [
      "AI Agents",
      "Go Programming",
      "Agent Development Kit",
      "Cloud-Native",
      "Multi-Agent Systems",
      "Software Development",
      "Artificial Intelligence",
      "Tool Ecosystem"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-11T10:31:49Z",
    "download_time": "2024-07-30 12:00:00",
    "extra_info": null
  },
  {
    "id": "strix",
    "source": "GitHub",
    "url": "https://github.com/usestrix/strix",
    "title": "Strix",
    "summary": "Strix presents an innovative open-source solution leveraging autonomous AI agents to secure applications by emulating real hackers. It dynamically executes code, detects vulnerabilities, and validates them through concrete proof-of-concepts, thereby bypassing the typical overhead of manual penetration testing and the high false-positive rates of static analysis tools. Strix offers a robust suite of agentic security tools, including HTTP proxies, browser automation, terminal environments, and Python runtimes for exploit development. Its \"Graph of Agents\" enables distributed, scalable testing with dynamic coordination. The platform is designed for developers and security teams, providing a CLI with actionable reports and capabilities for auto-fix. Key applications include swift detection of critical vulnerabilities, accelerating compliance-driven penetration tests, automating bug bounty research with PoC generation, and integrating seamlessly into CI/CD pipelines to enforce security pre-production. An enterprise cloud-hosted version further extends capabilities with custom fine-tuned models and large-scale scanning.",
    "keywords": [
      "AI agents",
      "Application security",
      "Vulnerability testing",
      "Penetration testing",
      "CI/CD security",
      "Proof-of-concept",
      "Dynamic analysis",
      "Automated security"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-10T10:19:18Z",
    "download_time": "2024-07-30 08:30:00",
    "extra_info": null
  },
  {
    "id": "TrendRadar",
    "source": "GitHub",
    "url": "https://github.com/sansan0/TrendRadar",
    "title": "TrendRadar",
    "summary": "TrendRadar is a lightweight and easily deployable open-source news monitoring assistant designed to help users cut through information overload and focus on relevant news. It aggregates hot topics from over 11 mainstream platforms, including Weibo, Douyin, Zhihu, and Baidu Hot Search, with options for custom platform integration. The project features an intelligent push strategy offering daily summaries, current榜单, and incremental monitoring modes, adaptable to various user needs from corporate managers to investors. Users can precisely filter content using a keyword-based system that supports normal, mandatory, and exclusion terms, grouped for topic-specific tracking. A key innovation is its heat trend analysis, which tracks news evolution, identifies new topics, and provides cross-platform comparisons. Additionally, TrendRadar incorporates an AI-powered analysis system based on the Model Context Protocol (MCP), enabling natural language queries, trend prediction, sentiment analysis, and smart summarization across 13 analytical tools. The system supports multi-channel real-time notifications via platforms like WeChat Work, Feishu, Telegram, and email, alongside web reporting via GitHub Pages and Docker deployment for robust, multi-architecture operation. It empowers users to proactively acquire tailored information, making it ideal for market monitoring, brand reputation tracking, and general news consumption.",
    "keywords": [
      "News Monitoring",
      "Hotspot Aggregation",
      "AI Analysis",
      "Model Context Protocol",
      "Multi-channel Notification",
      "Content Filtering",
      "Docker Deployment",
      "GitHub Actions"
    ],
    "area": [
      "Artificial Intelligence",
      "Natural Language Processing",
      "AI Agent"
    ],
    "published_time": "2025-11-11T01:42:19Z",
    "download_time": "2024-05-18 07:44:20",
    "extra_info": null
  },
  {
    "id": "2511.07409",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.07409",
    "title": "DIMO: Diverse 3D Motion Generation for Arbitrary Objects",
    "summary": "We present DIMO, a generative approach capable of generating diverse 3D motions for arbitrary objects from a single image. The core idea of our work is to leverage the rich priors in well-trained video models to extract the common motion patterns and then embed them into a shared low-dimensional latent space. Specifically, we first generate multiple videos of the same object with diverse motions. We then embed each motion into a latent vector and train a shared motion decoder to learn the distribution of motions represented by a structured and compact motion representation, i.e., neural key point trajectories. The canonical 3D Gaussians are then driven by these key points and fused to model the geometry and appearance. During inference time with learned latent space, we can instantly sample diverse 3D motions in a single-forward pass and support several interesting applications including 3D motion interpolation and language-guided motion generation. Our project page is available at https://linzhanm.github.io/dimo.",
    "keywords": [
      "3D Motion Generation",
      "Generative AI",
      "Object Animation",
      "Latent Space",
      "Video Models"
    ],
    "area": [
      "Generative AI",
      "Video Understanding",
      "Computer Vision"
    ],
    "published_time": "2025-11-10T18:56:49.000Z",
    "download_time": "2025-11-11 12:03:05",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.07409\", \"arxiv_url\": \"https://arxiv.org/abs/2511.07409\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.07409.png\", \"original_title\": \"DIMO: Diverse 3D Motion Generation for Arbitrary Objects\"}"
  },
  {
    "id": "2511.06194",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.06194",
    "title": "NURBGen: High-Fidelity Text-to-CAD Generation through LLM-Driven NURBS Modeling",
    "summary": "Generating editable 3D CAD models from natural language remains challenging, as existing text-to-CAD systems either produce meshes or rely on scarce design-history data. We present NURBGen, the first framework to generate high-fidelity 3D CAD models directly from text using Non-Uniform Rational B-Splines (NURBS). To achieve this, we fine-tune a large language model (LLM) to translate free-form texts into JSON representations containing NURBS surface parameters (i.e, control points, knot vectors, degrees, and rational weights) which can be directly converted into BRep format using Python. We further propose a hybrid representation that combines untrimmed NURBS with analytic primitives to handle trimmed surfaces and degenerate regions more robustly, while reducing token complexity. Additionally, we introduce partABC, a curated subset of the ABC dataset consisting of individual CAD components, annotated with detailed captions using an automated annotation pipeline. NURBGen demonstrates strong performance on diverse prompts, surpassing prior methods in geometric fidelity and dimensional accuracy, as confirmed by expert evaluations. Code and dataset will be released publicly.",
    "keywords": [
      "Text-to-CAD",
      "NURBS Modeling",
      "Large Language Models",
      "3D CAD Generation",
      "Geometric Fidelity"
    ],
    "area": [
      "Generative AI",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-09T02:45:12.000Z",
    "download_time": "2025-11-11 12:03:07",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.06194\", \"arxiv_url\": \"https://arxiv.org/abs/2511.06194\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.06194.png\", \"original_title\": \"NURBGen: High-Fidelity Text-to-CAD Generation through LLM-Driven NURBS\\n  Modeling\"}"
  },
  {
    "id": "2511.07327",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.07327",
    "title": "IterResearch: Rethinking Long-Horizon Agents via Markovian State Reconstruction",
    "summary": "Recent advances in deep-research agents have shown promise for autonomous knowledge construction through dynamic reasoning over external sources. However, existing approaches rely on a mono-contextual paradigm that accumulates all information in a single, expanding context window, leading to context suffocation and noise contamination that limit their effectiveness on long-horizon tasks. We introduce IterResearch, a novel iterative deep-research paradigm that reformulates long-horizon research as a Markov Decision Process with strategic workspace reconstruction. By maintaining an evolving report as memory and periodically synthesizing insights, our approach preserves consistent reasoning capacity across arbitrary exploration depths. We further develop Efficiency-Aware Policy Optimization (EAPO), a reinforcement learning framework that incentivizes efficient exploration through geometric reward discounting and enables stable distributed training via adaptive downsampling. Extensive experiments demonstrate that IterResearch achieves substantial improvements over existing open-source agents with average +14.5pp across six benchmarks and narrows the gap with frontier proprietary systems. Remarkably, our paradigm exhibits unprecedented interaction scaling, extending to 2048 interactions with dramatic performance gains (from 3.5% to 42.5%), and serves as an effective prompting strategy, improving frontier models by up to 19.2pp over ReAct on long-horizon tasks. These findings position IterResearch as a versatile solution for long-horizon reasoning, effective both as a trained agent and as a prompting paradigm for frontier models.",
    "keywords": [
      "Deep-research agents",
      "Long-horizon tasks",
      "Markov Decision Process",
      "Reinforcement learning",
      "Prompting strategy"
    ],
    "area": [
      "AI Agent",
      "Machine Learning",
      "Large Language Model"
    ],
    "published_time": "2025-11-10T17:30:08.000Z",
    "download_time": "2025-11-11 12:03:05",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.07327\", \"arxiv_url\": \"https://arxiv.org/abs/2511.07327\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.07327.png\", \"original_title\": \"IterResearch: Rethinking Long-Horizon Agents via Markovian State\\n  Reconstruction\"}"
  },
  {
    "id": "2511.03506",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.03506",
    "title": "HaluMem: Evaluating Hallucinations in Memory Systems of Agents",
    "summary": "Memory systems are key components that enable AI systems such as LLMs and AI agents to achieve long-term learning and sustained interaction. However, during memory storage and retrieval, these systems frequently exhibit memory hallucinations, including fabrication, errors, conflicts, and omissions. Existing evaluations of memory hallucinations are primarily end-to-end question answering, which makes it difficult to localize the operational stage within the memory system where hallucinations arise. To address this, we introduce the Hallucination in Memory Benchmark (HaluMem), the first operation level hallucination evaluation benchmark tailored to memory systems. HaluMem defines three evaluation tasks (memory extraction, memory updating, and memory question answering) to comprehensively reveal hallucination behaviors across different operational stages of interaction. To support evaluation, we construct user-centric, multi-turn human-AI interaction datasets, HaluMem-Medium and HaluMem-Long. Both include about 15k memory points and 3.5k multi-type questions. The average dialogue length per user reaches 1.5k and 2.6k turns, with context lengths exceeding 1M tokens, enabling evaluation of hallucinations across different context scales and task complexities. Empirical studies based on HaluMem show that existing memory systems tend to generate and accumulate hallucinations during the extraction and updating stages, which subsequently propagate errors to the question answering stage. Future research should focus on developing interpretable and constrained memory operation mechanisms that systematically suppress hallucinations and improve memory reliability.",
    "keywords": [
      "Memory systems",
      "AI agents",
      "Memory hallucinations",
      "HaluMem",
      "Evaluation"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2025-11-05T14:37:34.000Z",
    "download_time": "2025-11-11 12:03:04",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.03506\", \"arxiv_url\": \"https://arxiv.org/abs/2511.03506\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.03506.png\", \"original_title\": \"HaluMem: Evaluating Hallucinations in Memory Systems of Agents\"}"
  },
  {
    "id": "2511.07419",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.07419",
    "title": "Routing Manifold Alignment Improves Generalization of Mixture-of-Experts LLMs",
    "summary": "Sparse Mixture-of-Experts (MoE) have been widely adopted in recent large language models since it can efficiently scale up the model capability without increasing the inference cost. However, evaluations on broad downstream tasks reveal a consistent suboptimality of the routers in existing MoE LLMs, which results in a severe performance gap (e.g., 10-20% in accuracy) to the optimal routing. In this paper, we show that aligning the manifold of routing weights with that of task embedding can effectively reduce the gap and improve MoE LLMs' generalization performance. Our method, \"Routing Manifold Alignment (RoMA)\", introduces an additional manifold regularization term in the post-training objective and only requires lightweight finetuning of routers (with other parameters frozen). Specifically, the regularization encourages the routing weights of each sample to be close to those of its successful neighbors (whose routing weights lead to correct answers) in a task embedding space. Consequently, samples targeting similar tasks will share similar expert choices across layers. Building such bindings between tasks and experts over different samples is essential to achieve better generalization. Moreover, RoMA demonstrates the advantage of unifying the task understanding (by embedding models) with solution generation (by MoE LLMs). In experiments, we finetune routers in OLMoE, DeepSeekMoE, and Qwen3-MoE using RoMA. Evaluations on diverse benchmarks and extensive comparisons with baselines show the substantial improvement brought by RoMA.",
    "keywords": [
      "Mixture-of-Experts",
      "Large Language Models",
      "Router Optimization",
      "Generalization",
      "Manifold Alignment"
    ],
    "area": [
      "Large Language Model",
      "Natural Language Processing",
      "Deep Learning"
    ],
    "published_time": "2025-11-10T18:59:53.000Z",
    "download_time": "2025-11-11 12:03:04",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.07419\", \"arxiv_url\": \"https://arxiv.org/abs/2511.07419\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.07419.png\", \"original_title\": \"Routing Manifold Alignment Improves Generalization of Mixture-of-Experts\\n  LLMs\"}"
  },
  {
    "id": "2511.07317",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.07317",
    "title": "RLVE: Scaling Up Reinforcement Learning for Language Models with Adaptive Verifiable Environments",
    "summary": "We introduce Reinforcement Learning (RL) with Adaptive Verifiable Environments (RLVE), an approach using verifiable environments that procedurally generate problems and provide algorithmically verifiable rewards, to scale up RL for language models (LMs). RLVE enables each verifiable environment to dynamically adapt its problem difficulty distribution to the policy model's capabilities as training progresses. In contrast, static data distributions often lead to vanishing learning signals when problems are either too easy or too hard for the policy. To implement RLVE, we create RLVE-Gym, a large-scale suite of 400 verifiable environments carefully developed through manual environment engineering. Using RLVE-Gym, we show that environment scaling, i.e., expanding the collection of training environments, consistently improves generalizable reasoning capabilities. RLVE with joint training across all 400 environments in RLVE-Gym yields a 3.37% absolute average improvement across six reasoning benchmarks, starting from one of the strongest 1.5B reasoning LMs. By comparison, continuing this LM's original RL training yields only a 0.49% average absolute gain despite using over 3x more compute. We release our code publicly.",
    "keywords": [
      "Reinforcement Learning",
      "Language Models",
      "Adaptive Environments",
      "Verifiable Environments",
      "Generalizable Reasoning"
    ],
    "area": [
      "Natural Language Processing",
      "Large Language Model",
      "Machine Learning"
    ],
    "published_time": "2025-11-10T17:18:35.000Z",
    "download_time": "2025-11-11 12:03:06",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.07317\", \"arxiv_url\": \"https://arxiv.org/abs/2511.07317\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.07317.png\", \"original_title\": \"RLVE: Scaling Up Reinforcement Learning for Language Models with\\n  Adaptive Verifiable Environments\"}"
  }
]