[
  {
    "id": "hackernews_46383552",
    "source": "Hacker News",
    "url": "https://www.bbc.co.uk/news/articles/cdxwllqz1l0o",
    "title": "We invited a man into our home at Christmas and he stayed with us for 45 years",
    "summary": "This Hacker News discussion explores the metaphor of a long-term, unexpectedly persistent technological integration, framed by the narrative \"We invited a man into our home at Christmas and he stayed with us for 45 years.\" It delves into the technical implications of foundational AI systems or software components that, initially deployed as experiments or temporary solutions, evolve into indispensable, deeply integrated parts of an organization's infrastructure. The story highlights critical challenges associated with system longevity, including continuous maintenance, adaptation to evolving technological landscapes, and the often-overlooked accumulation of technical debt over decades. Analysis focuses on the initial architectural decisions that lead to such unexpected permanence, the operational resilience required for systems to function far beyond their anticipated lifespans, and the strategic implications of managing legacy AI. This metaphorical case study prompts reflection on the \"stickiness\" of effective or deeply embedded solutions, emphasizing the long-term impact on digital strategy and resource allocation.",
    "keywords": [
      "AI Longevity",
      "Legacy Systems",
      "System Integration",
      "Software Maintenance",
      "Persistent AI",
      "Operational Resilience"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-12-25 10:35:34",
    "download_time": "2025-12-25 20:00:38",
    "extra_info": "{\"score\": 720, \"by\": \"rajeshrajappan\", \"descendants\": 178, \"story_id\": 46383552}"
  },
  {
    "id": "hackernews_46386009",
    "source": "Hacker News",
    "url": "https://cyata.ai/blog/langgrinch-langchain-core-cve-2025-68664/",
    "title": "All I Want for Xmas Is Your Secrets: LangGrinch Hits LangChain (CVE-2025-68664)",
    "summary": "The article \"All I Want for Xmas Is Your Secrets: LangGrinch Hits LangChain (CVE-2025-68664)\" details a critical security vulnerability discovered within the widely-used LangChain framework, identified as CVE-2025-68664. Dubbed \"LangGrinch,\" this flaw reportedly facilitates unauthorized access to sensitive information or \"secrets\" processed and managed by applications built upon the LangChain ecosystem. Given LangChain's pivotal role in developing advanced large language model (LLM) applications and sophisticated AI agents, the potential for exploitation presents significant risks to data confidentiality, system integrity, and overall user trust. The disclosure emphasizes the urgent need for developers and organizations leveraging LangChain to promptly address the vulnerability. This includes reviewing official security advisories, applying recommended patches, and implementing robust mitigation strategies to protect against potential data breaches or unauthorized operations. The incident highlights the growing importance of embedding comprehensive security measures throughout the development lifecycle of AI-driven systems and frameworks.",
    "keywords": [
      "LangChain",
      "Security Vulnerability",
      "CVE-2025-68664",
      "AI Security",
      "Large Language Models",
      "Framework Security",
      "Data Confidentiality"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2025-12-25 18:06:44",
    "download_time": "2025-12-25 20:00:33",
    "extra_info": "{\"score\": 8, \"by\": \"shahartal\", \"descendants\": 4, \"story_id\": 46386009}"
  },
  {
    "id": "hackernews_46380758",
    "source": "Hacker News",
    "url": "https://www.youtube.com/watch?v=oYU2hAbx_Fc",
    "title": "Who Watches the Waymos? I do [video]",
    "summary": "The Hacker News story, titled 'Who Watches the Waymos? I do [video]', references a video-based observation of Waymo's autonomous vehicle operations. While specific details of the video content are not provided within the initial submission, the title strongly implies a direct, possibly public, monitoring of self-driving cars. This type of content often explores the real-world performance, safety protocols, and general behavior of autonomous vehicles in urban environments. Public observation of autonomous vehicle fleets like Waymo's is crucial for fostering transparency and building trust in self-driving technology. Such videos can highlight both the advancements and potential challenges faced by these systems, offering insights into their interaction with human drivers, pedestrians, and dynamic road conditions. Discussions around these observations frequently touch upon regulatory frameworks, ethical considerations, and the future integration of autonomous transportation into daily life, underscoring the ongoing public interest and scrutiny of this rapidly evolving field.",
    "keywords": [
      "Autonomous Vehicles",
      "Self-driving Technology",
      "Waymo",
      "Robotics",
      "Urban Mobility",
      "Vehicle Monitoring"
    ],
    "area": [
      "Robotics",
      "Artificial Intelligence",
      "Computer Vision"
    ],
    "published_time": "2025-12-25 00:10:12",
    "download_time": "2025-12-25 20:00:31",
    "extra_info": "{\"score\": 244, \"by\": \"notgloating\", \"descendants\": 86, \"story_id\": 46380758}"
  },
  {
    "id": "hackernews_46381835",
    "source": "Hacker News",
    "url": "https://nolongerevil.com/",
    "title": "No Longer Evil – new life for dead/outdated Nest Generation 1 and 2 thermostats",
    "summary": "The \"No Longer Evil\" project offers a significant initiative to combat electronic waste and proprietary obsolescence by providing \"new life\" to dead or outdated Nest Generation 1 and 2 thermostats. This project aims to deliver alternative firmware or software solutions, enabling these early smart home devices to regain functionality and potentially gain new capabilities, effectively extending their operational lifespan. This open-source approach empowers users to maintain control over their hardware, circumventing issues of vendor lock-in and discontinued support that often render smart devices unusable. The effort underscores a growing emphasis on sustainability within the Internet of Things (IoT) ecosystem, promoting the responsible reuse of technology and reducing environmental impact. By revitalizing these intelligent thermostats, the project not only offers practical utility to owners but also sets a precedent for community-driven maintenance and enhancement of legacy smart devices, potentially allowing for renewed \"smart\" integrations or even enhanced AI-driven temperature management beyond original specifications. This initiative is crucial for fostering a more sustainable and user-centric future for connected home technology.",
    "keywords": [
      "Nest Thermostat",
      "Smart Home",
      "IoT",
      "Firmware",
      "Hardware Hacking",
      "Sustainability",
      "Electronic Waste",
      "Open Source"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2025-12-25 03:32:42",
    "download_time": "2025-12-25 20:00:45",
    "extra_info": "{\"score\": 38, \"by\": \"pabs3\", \"descendants\": 3, \"story_id\": 46381835}"
  },
  {
    "id": "hackernews_46385656",
    "source": "Hacker News",
    "url": "https://thenewstack.io/donald-knuths-2025-christmas-lecture-the-knights-tours/",
    "title": "Donald Knuth's 2025 Christmas lecture: the Knight's Tours",
    "summary": "Donald Knuth, the celebrated computer scientist and esteemed author of the multi-volume series \"The Art of Computer Programming,\" is scheduled to present his highly anticipated annual Christmas lecture in 2025, dedicating it to the fascinating and complex mathematical problem known as \"The Knight's Tours.\" This forthcoming lecture is expected to offer an in-depth exploration of the various algorithmic strategies and combinatorial complexities involved in determining a sequence of moves for a knight on a standard chessboard that visits every square precisely once. Knuth's Christmas lectures are a hallmark event, celebrated for their unparalleled ability to illuminate fundamental computational problems by merging rigorous theoretical analysis with elegant practical considerations. The Knight's Tour, a classic challenge deeply rooted in recreational mathematics and graph theory, provides a rich framework for discussing topics such as efficient backtracking algorithms, the existence and construction of Hamiltonian paths, and the comparative analysis of search methodologies. The 2025 event is poised to draw a significant international audience of researchers, students, and computer science enthusiasts, eager to gain insights from one of the discipline's most influential figures and engage with advanced concepts in algorithmic design, discrete mathematics, and computational problem-solving.",
    "keywords": [
      "Donald Knuth",
      "Knight's Tour",
      "Computer Science",
      "Algorithms",
      "Graph Theory",
      "Combinatorial Optimization",
      "Discrete Mathematics",
      "Search Algorithms"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2025-12-25 17:09:09",
    "download_time": "2025-12-25 20:00:47",
    "extra_info": "{\"score\": 15, \"by\": \"MilnerRoute\", \"descendants\": 1, \"story_id\": 46385656}"
  },
  {
    "id": "2512.20856",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.20856",
    "title": "NVIDIA Nemotron 3: Efficient and Open Intelligence",
    "summary": "We introduce the Nemotron 3 family of models - Nano, Super, and Ultra. These models deliver strong agentic, reasoning, and conversational capabilities. The Nemotron 3 family uses a Mixture-of-Experts hybrid Mamba-Transformer architecture to provide best-in-class throughput and context lengths of up to 1M tokens. Super and Ultra models are trained with NVFP4 and incorporate LatentMoE, a novel approach that improves model quality. The two larger models also include MTP layers for faster text generation. All Nemotron 3 models are post-trained using multi-environment reinforcement learning enabling reasoning, multi-step tool use, and support granular reasoning budget control. Nano, the smallest model, outperforms comparable models in accuracy while remaining extremely cost-efficient for inference. Super is optimized for collaborative agents and high-volume workloads such as IT ticket automation. Ultra, the largest model, provides state-of-the-art accuracy and reasoning performance. Nano is released together with its technical report and this white paper, while Super and Ultra will follow in the coming months. We will openly release the model weights, pre- and post-training software, recipes, and all data for which we hold redistribution rights.",
    "keywords": [
      "Nemotron 3",
      "Mixture-of-Experts",
      "Mamba-Transformer",
      "Reinforcement Learning",
      "AI Agent"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Deep Learning"
    ],
    "published_time": "2025-12-24T00:24:05.000Z",
    "download_time": "2025-12-25 12:00:54",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.20856\", \"arxiv_url\": \"https://arxiv.org/abs/2512.20856\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.20856.png\", \"original_title\": \"NVIDIA Nemotron 3: Efficient and Open Intelligence\"}"
  },
  {
    "id": "2512.21334",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.21334",
    "title": "Streaming Video Instruction Tuning",
    "summary": "We present Streamo, a real-time streaming video LLM that serves as a general-purpose interactive assistant. Unlike existing online video models that focus narrowly on question answering or captioning, Streamo performs a broad spectrum of streaming video tasks, including real-time narration, action understanding, event captioning, temporal event grounding, and time-sensitive question answering. To develop such versatility, we construct Streamo-Instruct-465K, a large-scale instruction-following dataset tailored for streaming video understanding. The dataset covers diverse temporal contexts and multi-task supervision, enabling unified training across heterogeneous streaming tasks. After training end-to-end on the instruction-following dataset through a streamlined pipeline, Streamo exhibits strong temporal reasoning, responsive interaction, and broad generalization across a variety of streaming benchmarks. Extensive experiments show that Streamo bridges the gap between offline video perception models and real-time multimodal assistants, making a step toward unified, intelligent video understanding in continuous video streams.",
    "keywords": [
      "Streaming Video",
      "Large Language Model",
      "Instruction Tuning",
      "Real-time AI",
      "Multimodal Assistants"
    ],
    "area": [
      "Large Language Model",
      "Video Understanding",
      "Multimodal"
    ],
    "published_time": "2025-12-24T18:59:36.000Z",
    "download_time": "2025-12-25 12:00:52",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.21334\", \"arxiv_url\": \"https://arxiv.org/abs/2512.21334\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.21334.png\", \"original_title\": \"Streaming Video Instruction Tuning\"}"
  },
  {
    "id": "2512.18470",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.18470",
    "title": "SWE-EVO: Benchmarking Coding Agents in Long-Horizon Software Evolution Scenarios",
    "summary": "Existing benchmarks for AI coding agents focus on isolated, single-issue tasks such as fixing a bug or implementing a small feature. However, real-world software engineering is fundamentally a long-horizon endeavor: developers must interpret high-level requirements, plan coordinated changes across many files, and evolve codebases over multiple iterations while preserving existing functionality. We introduce SWE-EVO, a benchmark that evaluates agents on this long-horizon software evolution challenge. Constructed from release notes and version histories of seven mature open-source Python projects, Tool comprises 48 evolution tasks that require agents to implement multi-step modifications spanning an average of 21 files, validated against comprehensive test suites averaging 874 tests per instance. Experiments with state-of-the-art models reveal a striking capability gap: even GPT-5 with OpenHands achieves only a 21 percent resolution rate on Tool, compared to 65 percent on the single-issue SWE-Bench Verified. This demonstrates that current agents struggle with sustained, multi-file reasoning. We also propose Fix Rate, a fine-grained metric that captures partial progress toward solving these complex, long-horizon tasks.",
    "keywords": [
      "AI Coding Agents",
      "Software Evolution",
      "Benchmarking",
      "Long-Horizon Tasks",
      "Software Engineering"
    ],
    "area": [
      "AI Agent",
      "Artificial Intelligence",
      "Large Language Model"
    ],
    "published_time": "2025-12-20T19:08:15.000Z",
    "download_time": "2025-12-25 12:00:53",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.18470\", \"arxiv_url\": \"https://arxiv.org/abs/2512.18470\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.18470.png\", \"original_title\": \"SWE-EVO: Benchmarking Coding Agents in Long-Horizon Software Evolution Scenarios\"}"
  },
  {
    "id": "2512.21338",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.21338",
    "title": "HiStream: Efficient High-Resolution Video Generation via Redundancy-Eliminated Streaming",
    "summary": "High-resolution video generation, while crucial for digital media and film, is computationally bottlenecked by the quadratic complexity of diffusion models, making practical inference infeasible. To address this, we introduce HiStream, an efficient autoregressive framework that systematically reduces redundancy across three axes: i) Spatial Compression: denoising at low resolution before refining at high resolution with cached features; ii) Temporal Compression: a chunk-by-chunk strategy with a fixed-size anchor cache, ensuring stable inference speed; and iii) Timestep Compression: applying fewer denoising steps to subsequent, cache-conditioned chunks. On 1080p benchmarks, our primary HiStream model (i+ii) achieves state-of-the-art visual quality while demonstrating up to 76.2x faster denoising compared to the Wan2.1 baseline and negligible quality loss. Our faster variant, HiStream+, applies all three optimizations (i+ii+iii), achieving a 107.5x acceleration over the baseline, offering a compelling trade-off between speed and quality, thereby making high-resolution video generation both practical and scalable.",
    "keywords": [
      "High-Resolution Video Generation",
      "Diffusion Models",
      "Redundancy Elimination",
      "Video Streaming",
      "Denoising"
    ],
    "area": [
      "Generative AI",
      "Deep Learning",
      "Computer Vision"
    ],
    "published_time": "2025-12-24T18:59:58.000Z",
    "download_time": "2025-12-25 12:00:54",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.21338\", \"arxiv_url\": \"https://arxiv.org/abs/2512.21338\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.21338.png\", \"original_title\": \"HiStream: Efficient High-Resolution Video Generation via Redundancy-Eliminated Streaming\"}"
  },
  {
    "id": "2512.21094",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.21094",
    "title": "T2AV-Compass: Towards Unified Evaluation for Text-to-Audio-Video Generation",
    "summary": "Text-to-Audio-Video (T2AV) generation aims to synthesize temporally coherent video and semantically synchronized audio from natural language, yet its evaluation remains fragmented, often relying on unimodal metrics or narrowly scoped benchmarks that fail to capture cross-modal alignment, instruction following, and perceptual realism under complex prompts. To address this limitation, we present T2AV-Compass, a unified benchmark for comprehensive evaluation of T2AV systems, consisting of 500 diverse and complex prompts constructed via a taxonomy-driven pipeline to ensure semantic richness and physical plausibility. Besides, T2AV-Compass introduces a dual-level evaluation framework that integrates objective signal-level metrics for video quality, audio quality, and cross-modal alignment with a subjective MLLM-as-a-Judge protocol for instruction following and realism assessment. Extensive evaluation of 11 representative T2AVsystems reveals that even the strongest models fall substantially short of human-level realism and cross-modal consistency, with persistent failures in audio realism, fine-grained synchronization, instruction following, etc. These results indicate significant improvement room for future models and highlight the value of T2AV-Compass as a challenging and diagnostic testbed for advancing text-to-audio-video generation.",
    "keywords": [
      "Text-to-Audio-Video Generation",
      "Unified Evaluation",
      "Benchmark",
      "Multimodal Learning",
      "Cross-modal Alignment"
    ],
    "area": [
      "Multimodal",
      "Generative AI",
      "Large Language Model"
    ],
    "published_time": "2025-12-24T10:30:35.000Z",
    "download_time": "2025-12-25 12:00:55",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.21094\", \"arxiv_url\": \"https://arxiv.org/abs/2512.21094\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.21094.png\", \"original_title\": \"T2AV-Compass: Towards Unified Evaluation for Text-to-Audio-Video Generation\"}"
  },
  {
    "id": "2512.21227",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.21227",
    "title": "PhononBench:A Large-Scale Phonon-Based Benchmark for Dynamical Stability in Crystal Generation",
    "summary": "In this work, we introduce PhononBench, the first large-scale benchmark for dynamical stability in AI-generated crystals. Leveraging the recently developed MatterSim interatomic potential, which achieves DFT-level accuracy in phonon predictions across more than 10,000 materials, PhononBench enables efficient large-scale phonon calculations and dynamical-stability analysis for 108,843 crystal structures generated by six leading crystal generation models. PhononBench reveals a widespread limitation of current generative models in ensuring dynamical stability: the average dynamical-stability rate across all generated structures is only 25.83%, with the top-performing model, MatterGen, reaching just 41.0%. Further case studies show that in property-targeted generation-illustrated here by band-gap conditioning with MatterGen--the dynamical-stability rate remains as low as 23.5% even at the optimal band-gap condition of 0.5 eV. In space-group-controlled generation, higher-symmetry crystals exhibit better stability (e.g., cubic systems achieve rates up to 49.2%), yet the average stability across all controlled generations is still only 34.4%. An important additional outcome of this study is the identification of 28,119 crystal structures that are phonon-stable across the entire Brillouin zone, providing a substantial pool of reliable candidates for future materials exploration. By establishing the first large-scale dynamical-stability benchmark, this work systematically highlights the current limitations of crystal generation models and offers essential evaluation criteria and guidance for their future development toward the design and discovery of physically viable materials. All model-generated crystal structures, phonon calculation results, and the high-throughput evaluation workflows developed in PhononBench will be openly released at https://github.com/xqh19970407/PhononBench",
    "keywords": [
      "PhononBench",
      "Crystal Generation",
      "Dynamical Stability",
      "Generative Models",
      "AI-Generated Materials"
    ],
    "area": [
      "Generative AI",
      "Artificial Intelligence",
      "Machine Learning"
    ],
    "published_time": "2025-12-24T15:07:36.000Z",
    "download_time": "2025-12-25 12:00:54",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.21227\", \"arxiv_url\": \"https://arxiv.org/abs/2512.21227\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.21227.png\", \"original_title\": \"PhononBench:A Large-Scale Phonon-Based Benchmark for Dynamical Stability in Crystal Generation\"}"
  }
]