[
  {
    "id": "hackernews_46081682",
    "source": "Hacker News",
    "url": "https://www.energy.gov/articles/energy-department-launches-genesis-mission-transform-american-science-and-innovation",
    "title": "US Energy Department Launches \"Genesis Mission\" to Transform Science Through AI",
    "summary": "The U.S. Department of Energy (DOE) has officially inaugurated the \"Genesis Mission,\" a pivotal initiative designed to fundamentally transform the landscape of American science and innovation through the strategic application of artificial intelligence (AI). This ambitious program aims to harness the power of advanced AI technologies, including sophisticated machine learning algorithms, deep learning models, and predictive analytics, to accelerate discovery across critical scientific domains. The mission will focus on integrating these AI tools to enhance predictive modeling, optimize experimental design, and facilitate the analysis of vast, complex datasets that are currently challenging to process. Key areas of expected impact include energy systems, materials science, quantum computing, and climate modeling. By fostering a collaborative ecosystem among national labs, academia, and industry, the Genesis Mission seeks to push the boundaries of scientific inquiry, unlock new frontiers in understanding, and establish new paradigms for innovation, ultimately bolstering the nation's scientific competitiveness and addressing grand challenges.",
    "keywords": [
      "Artificial Intelligence",
      "Scientific Research",
      "Energy Department",
      "Innovation",
      "Machine Learning",
      "Data Analytics",
      "National Science Initiatives"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Deep Learning"
    ],
    "published_time": "2025-11-28 19:03:38",
    "download_time": "2025-11-28 20:02:58",
    "extra_info": "{\"score\": 6, \"by\": \"sxp\", \"descendants\": 1, \"story_id\": 46081682}"
  },
  {
    "id": "hackernews_46079567",
    "source": "Hacker News",
    "url": "https://cprimozic.net/notes/posts/generating-3d-meshes-from-text/",
    "title": "Generating 3D Meshes from Text",
    "summary": "The Hacker News story discusses the innovative field of generating 3D meshes directly from text descriptions. This process represents a significant advancement in generative artificial intelligence, bridging the gap between natural language understanding and complex 3D computer graphics. The core idea involves developing sophisticated AI models that can interpret abstract or concrete textual prompts and translate them into detailed, geometrically accurate three-dimensional models. This involves addressing challenges such as semantic ambiguity, ensuring topological correctness, and creating high-fidelity surfaces. Such technology has profound implications across various industries, including game development, architectural visualization, product design, and virtual reality, by dramatically reducing the manual effort and specialized skills traditionally required for 3D asset creation. It opens new avenues for rapid prototyping and democratizing access to 3D content generation, enabling users to create complex scenes and objects with simple text commands.",
    "keywords": [
      "3D Generation",
      "Text-to-3D",
      "Generative AI",
      "Mesh Generation",
      "Deep Learning",
      "Computer Graphics",
      "Natural Language Processing"
    ],
    "area": [
      "Generative AI",
      "Deep Learning",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-28 15:40:49",
    "download_time": "2025-11-28 20:02:33",
    "extra_info": "{\"score\": 24, \"by\": \"todsacerdoti\", \"descendants\": 1, \"story_id\": 46079567}"
  },
  {
    "id": "hackernews_46081704",
    "source": "Hacker News",
    "url": "https://www.anthropic.com/engineering/effective-harnesses-for-long-running-agents",
    "title": "Effective harnesses for long-running agents",
    "summary": "Anthropic explores the crucial topic of 'effective harnesses' for 'long-running agents,' addressing the unique challenges associated with designing and managing AI systems that operate autonomously over extended periods. As AI development progresses beyond episodic tasks to persistent, goal-oriented agents, the need for robust control mechanisms, monitoring tools, and resilient architectures becomes paramount. This discussion likely delves into methodologies for ensuring agent stability, managing state, facilitating continuous adaptation, and maintaining safety alignment throughout prolonged operation. The concept of harnesses encapsulates the frameworks and best practices essential for orchestrating complex agent behaviors, handling failures gracefully, and integrating learning mechanisms. This focus underscores the industry's shift towards developing more reliable and practical AI agents for real-world deployment, emphasizing the infrastructural requirements to support their longevity and effectiveness.",
    "keywords": [
      "AI Agent",
      "Agentic Systems",
      "Agent Orchestration",
      "Agent Management",
      "AI System Design",
      "Long-term AI",
      "Agent Reliability",
      "AI Safety"
    ],
    "area": [
      "AI Agent",
      "Artificial Intelligence",
      "Machine Learning"
    ],
    "published_time": "2025-11-28 19:05:16",
    "download_time": "2025-11-28 20:02:08",
    "extra_info": "{\"score\": 14, \"by\": \"diwank\", \"descendants\": 0, \"story_id\": 46081704}"
  },
  {
    "id": "hackernews_46080364",
    "source": "Hacker News",
    "url": "https://blog.yakkomajuri.com/blog/local-rag",
    "title": "So you wanna build a local RAG?",
    "summary": "This piece introduces the concept of building a local Retrieval Augmented Generation (RAG) system, catering to individuals interested in implementing advanced AI capabilities without relying on cloud-based services. A local RAG setup typically involves self-hosting large language models (LLMs) and vector databases to perform information retrieval and generation tasks on private data. The primary motivations often include enhanced data privacy, reduced operational costs associated with API calls, and greater control over the model's behavior and data indexing. While the exact content of the blog post is concise, the title implies a practical guide or an overview of the necessary components, such as open-source LLMs, local embedding models, and efficient local storage solutions for vectorized data. Successfully implementing a local RAG system requires careful consideration of hardware resources, software configurations, and data management practices to ensure optimal performance and accuracy.",
    "keywords": [
      "Retrieval Augmented Generation",
      "RAG",
      "Local AI",
      "Large Language Model",
      "Vector Database",
      "Information Retrieval",
      "Privacy",
      "Open Source LLM"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-28 16:54:56",
    "download_time": "2025-11-28 20:02:14",
    "extra_info": "{\"score\": 89, \"by\": \"pedriquepacheco\", \"descendants\": 23, \"story_id\": 46080364}"
  },
  {
    "id": "hackernews_46080597",
    "source": "Hacker News",
    "url": "https://instavm.io/blog/llm-anti-patterns",
    "title": "Anti-patterns while working with LLMs",
    "summary": "This article delves into prevalent anti-patterns encountered when developing and deploying Large Language Models (LLMs), offering critical insights for practitioners to navigate common challenges and foster more effective AI implementations. It underscores the necessity of transcending simplistic prompt engineering to embrace a holistic, strategic approach for integrating LLMs into complex systems. Among the identified anti-patterns, a primary concern is the failure to clearly define problem statements and establish measurable objectives, often resulting in inefficient resource allocation and underperforming models. Another significant pitfall is an excessive dependence on \"one-shot\" or naive solutions, neglecting the iterative refinement and comprehensive evaluation essential for robust AI systems. The discussion likely extends to the crucial role of high-quality data preparation, a deep understanding of intrinsic model limitations, and the implementation of rigorous testing and validation frameworks to ensure both reliability and adherence to ethical guidelines. Ultimately, the piece advocates for integrating considerations of scalability, cost-efficiency, and responsible AI practices across the entire LLM development lifecycle, thereby enabling the creation of sustainable and impactful solutions.",
    "keywords": [
      "Large Language Models",
      "Anti-patterns",
      "Prompt Engineering",
      "AI Development",
      "Model Evaluation",
      "Scalability",
      "Data Quality",
      "AI Best Practices"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-28 17:16:52",
    "download_time": "2025-11-28 20:02:26",
    "extra_info": "{\"score\": 28, \"by\": \"mkagenius\", \"descendants\": 9, \"story_id\": 46080597}"
  },
  {
    "id": "hackernews_46081053",
    "source": "Hacker News",
    "url": "https://clickhouse.com/docs/getting-started/example-datasets/hackernews-vector-search-dataset",
    "title": "28M Hacker News comments as vector embedding search dataset",
    "summary": "A substantial new dataset has been released, featuring 28 million Hacker News comments transformed into vector embeddings, specifically designed to serve as a robust resource for vector embedding search applications. This comprehensive collection offers an invaluable tool for researchers, data scientists, and developers aiming to explore, benchmark, and build advanced information retrieval systems. By converting vast amounts of user-generated text into a numerical format, the dataset facilitates sophisticated semantic search capabilities, moving beyond traditional keyword matching to understand the contextual meaning of queries and documents. It provides a real-world, large-scale environment for testing the efficiency, accuracy, and scalability of various vector search algorithms and databases. This resource is particularly relevant for training and validating models in areas such as natural language understanding, content recommendation, and intelligent data exploration, emphasizing the critical role of vector embeddings in next-generation AI and data infrastructure development. Its availability is expected to accelerate innovation in semantic search technologies.",
    "keywords": [
      "Vector Embeddings",
      "Vector Search",
      "Hacker News",
      "Dataset",
      "Information Retrieval",
      "Semantic Search",
      "Data Science",
      "Natural Language Processing"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-28 18:02:04",
    "download_time": "2025-11-28 20:02:13",
    "extra_info": "{\"score\": 140, \"by\": \"walterbell\", \"descendants\": 59, \"story_id\": 46081053}"
  },
  {
    "id": "TrendRadar",
    "source": "GitHub",
    "url": "https://github.com/sansan0/TrendRadar",
    "title": "TrendRadar",
    "summary": "TrendRadar is an efficient open-source project designed to aggregate and deliver hot news topics from over 11 mainstream platforms, including Zhihu, Weibo, and Douyin. It enables users to deploy a personalized news assistant in as fast as 30 seconds, filtering out irrelevant information and focusing only on truly important news. Key features include highly customizable push strategies (daily summaries, current rankings, or incremental updates), precise content filtering using personal keywords with advanced syntax, and real-time trend analysis. The system supports multi-channel notifications to platforms like WeChat Work, Feishu, Telegram, and Email, and offers multi-device adaptation via GitHub Pages and Docker. A significant enhancement in v3.0.0 is the AI intelligent analysis, leveraging the Model Context Protocol (MCP) with 13 analytical tools for natural language querying, topic trend tracking, cross-platform data comparison, and sentiment analysis. This project is ideal for investors, content creators, and corporate PR seeking to gain control over information flow and make informed decisions, reducing reliance on algorithmic recommendations.",
    "keywords": [
      "News Aggregation",
      "AI Analysis",
      "Content Filtering",
      "Real-time Notifications",
      "Trend Monitoring",
      "Docker",
      "Model Context Protocol",
      "GitHub Actions"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-28T01:49:06Z",
    "download_time": "2024-05-16 11:30:00",
    "extra_info": null
  },
  {
    "id": "adk-go",
    "source": "GitHub",
    "url": "https://github.com/google/adk-go",
    "title": "Agent Development Kit (ADK) for Go",
    "summary": "The Agent Development Kit (ADK) for Go is an open-source, code-first toolkit designed to streamline the building, evaluation, and deployment of sophisticated AI agents. Applying robust software development principles, ADK offers a flexible and modular framework for orchestrating agent workflows, from simple tasks to complex multi-agent systems. While optimized for Google Gemini, it maintains model and deployment agnosticism, ensuring compatibility across various AI models and frameworks. This Go-specific version is particularly suited for developers creating cloud-native agent applications, leveraging Go's inherent strengths in concurrency and performance. Key features include an idiomatic Go design, a rich ecosystem for integrating pre-built or custom tools, and strong support for containerization and deployment in cloud environments like Google Cloud Run, empowering developers with ultimate flexibility, testability, and version control over their AI agent logic.",
    "keywords": [
      "AI Agent",
      "Go Programming Language",
      "Agent Development Kit",
      "Cloud-Native",
      "Modular Systems",
      "Tool Ecosystem",
      "Code-First Development",
      "AI Orchestration"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-28T10:43:04Z",
    "download_time": "2024-05-16 11:39:15",
    "extra_info": null
  },
  {
    "id": "2511.21691",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.21691",
    "title": "Canvas-to-Image: Compositional Image Generation with Multimodal Controls",
    "summary": "While modern diffusion models excel at generating high-quality and diverse images, they still struggle with high-fidelity compositional and multimodal control, particularly when users simultaneously specify text prompts, subject references, spatial arrangements, pose constraints, and layout annotations. We introduce Canvas-to-Image, a unified framework that consolidates these heterogeneous controls into a single canvas interface, enabling users to generate images that faithfully reflect their intent. Our key idea is to encode diverse control signals into a single composite canvas image that the model can directly interpret for integrated visual-spatial reasoning. We further curate a suite of multi-task datasets and propose a Multi-Task Canvas Training strategy that optimizes the diffusion model to jointly understand and integrate heterogeneous controls into text-to-image generation within a unified learning paradigm. This joint training enables Canvas-to-Image to reason across multiple control modalities rather than relying on task-specific heuristics, and it generalizes well to multi-control scenarios during inference. Extensive experiments show that Canvas-to-Image significantly outperforms state-of-the-art methods in identity preservation and control adherence across challenging benchmarks, including multi-person composition, pose-controlled composition, layout-constrained generation, and multi-control generation.",
    "keywords": [
      "Compositional Image Generation",
      "Multimodal Controls",
      "Diffusion Models",
      "Text-to-Image Generation",
      "Visual-Spatial Reasoning"
    ],
    "area": [
      "Generative AI",
      "Computer Vision",
      "Deep Learning"
    ],
    "published_time": "2025-11-26T18:59:56.000Z",
    "download_time": "2025-11-28 12:03:08",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.21691\", \"arxiv_url\": \"https://arxiv.org/abs/2511.21691\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.21691.png\", \"original_title\": \"Canvas-to-Image: Compositional Image Generation with Multimodal Controls\"}"
  },
  {
    "id": "2511.21678",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.21678",
    "title": "Agentic Learner with Grow-and-Refine Multimodal Semantic Memory",
    "summary": "MLLMs exhibit strong reasoning on isolated queries, yet they operate de novo -- solving each problem independently and often repeating the same mistakes. Existing memory-augmented agents mainly store past trajectories for reuse. However, trajectory-based memory suffers from brevity bias, gradually losing essential domain knowledge. More critically, even in truly multimodal problem-solving settings, it records only a single-modality trace of past behavior, failing to preserve how visual attention and logical reasoning jointly contributed to the solution. This is fundamentally misaligned with human cognition: semantic memory is both multimodal and integrated, preserving visual and abstract knowledge through coordinated but distinct representational streams. We thus introduce ViLoMem, a dual-stream memory framework that constructs compact, schema-based memory. It separately encodes visual distraction patterns and logical reasoning errors, enabling MLLMs to learn from their successful and failed experiences. Following a grow-and-refine principle, the system incrementally accumulates and updates multimodal semantic knowledge -- preserving stable, generalizable strategies while avoiding catastrophic forgetting. Across six multimodal benchmarks, ViLoMem consistently improves pass@1 accuracy and substantially reduces repeated visual and logical errors. Ablations confirm the necessity of dual-stream memory with explicit distraction--hallucination separation, demonstrating the value of error-aware multimodal memory for lifelong and cross-domain agentic learning. Our project page will be available at https://weihao-bo.github.io/ViLoMeo-page.",
    "keywords": [
      "Multimodal Large Language Models",
      "AI Agent",
      "Multimodal Semantic Memory",
      "Lifelong Learning",
      "Error-Aware Memory"
    ],
    "area": [
      "Multimodal",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2025-11-26T18:55:08.000Z",
    "download_time": "2025-11-28 12:03:09",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.21678\", \"arxiv_url\": \"https://arxiv.org/abs/2511.21678\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.21678.png\", \"original_title\": \"Agentic Learner with Grow-and-Refine Multimodal Semantic Memory\"}"
  },
  {
    "id": "2511.21662",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.21662",
    "title": "Multi-Crit: Benchmarking Multimodal Judges on Pluralistic Criteria-Following",
    "summary": "Large multimodal models (LMMs) are increasingly adopted as judges in multimodal evaluation systems due to their strong instruction following and consistency with human preferences. However, their ability to follow diverse, fine-grained evaluation criteria remains underexplored. We develop Multi-Crit, a benchmark for evaluating multimodal judges on their capacity to follow pluralistic criteria and produce reliable criterion-level judgments. Covering both open-ended generation and verifiable reasoning tasks, Multi-Crit is built through a rigorous data curation pipeline that gathers challenging response pairs with multi-criterion human annotations. It further introduces three novel metrics for systematically assessing pluralistic adherence, criterion-switching flexibility, and the ability to recognize criterion-level preference conflicts. Comprehensive analysis of 25 LMMs reveals that 1) proprietary models still struggle to maintain consistent adherence to pluralistic criteria--especially in open-ended evaluation; 2) open-source models lag further behind in flexibly following diverse criteria; and 3) critic fine-tuning with holistic judgment signals enhances visual grounding but fails to generalize to pluralistic criterion-level judgment. Additional analyses on reasoning fine-tuning, test-time scaling, and boundary consistency between open-source and proprietary models further probe the limits of current multimodal judges. As a pioneering study, Multi-Crit lays the foundation for building reliable and steerable multimodal AI evaluation.",
    "keywords": [
      "Multi-Crit",
      "Multimodal Judges",
      "LMMs",
      "Evaluation Benchmarking",
      "Criteria-Following"
    ],
    "area": [
      "Multimodal",
      "Large Language Model",
      "Artificial Intelligence"
    ],
    "published_time": "2025-11-26T18:35:17.000Z",
    "download_time": "2025-11-28 12:03:09",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.21662\", \"arxiv_url\": \"https://arxiv.org/abs/2511.21662\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.21662.png\", \"original_title\": \"Multi-Crit: Benchmarking Multimodal Judges on Pluralistic Criteria-Following\"}"
  },
  {
    "id": "2511.21541",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.21541",
    "title": "Video Generation Models Are Good Latent Reward Models",
    "summary": "Reward feedback learning (ReFL) has proven effective for aligning image generation with human preferences. However, its extension to video generation faces significant challenges. Existing video reward models rely on vision-language models designed for pixel-space inputs, confining ReFL optimization to near-complete denoising steps after computationally expensive VAE decoding. This pixel-space approach incurs substantial memory overhead and increased training time, and its late-stage optimization lacks early-stage supervision, refining only visual quality rather than fundamental motion dynamics and structural coherence. In this work, we show that pre-trained video generation models are naturally suited for reward modeling in the noisy latent space, as they are explicitly designed to process noisy latent representations at arbitrary timesteps and inherently preserve temporal information through their sequential modeling capabilities. Accordingly, we propose Process Reward Feedback Learning~(PRFL), a framework that conducts preference optimization entirely in latent space, enabling efficient gradient backpropagation throughout the full denoising chain without VAE decoding. Extensive experiments demonstrate that PRFL significantly improves alignment with human preferences, while achieving substantial reductions in memory consumption and training time compared to RGB ReFL.",
    "keywords": [
      "Video Generation",
      "Reward Models",
      "Latent Space",
      "Preference Optimization",
      "Process Reward Feedback Learning"
    ],
    "area": [
      "Generative AI",
      "Deep Learning",
      "Computer Vision"
    ],
    "published_time": "2025-11-26T16:14:18.000Z",
    "download_time": "2025-11-28 12:03:09",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.21541\", \"arxiv_url\": \"https://arxiv.org/abs/2511.21541\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.21541.png\", \"original_title\": \"Video Generation Models Are Good Latent Reward Models\"}"
  },
  {
    "id": "2511.21087",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.21087",
    "title": "MIRA: Multimodal Iterative Reasoning Agent for Image Editing",
    "summary": "Instruction-guided image editing offers an intuitive way for users to edit images with natural language. However, diffusion-based editing models often struggle to accurately interpret complex user instructions, especially those involving compositional relationships, contextual cues, or referring expressions, leading to edits that drift semantically or fail to reflect the intended changes. We tackle this problem by proposing MIRA (Multimodal Iterative Reasoning Agent), a lightweight, plug-and-play multimodal reasoning agent that performs editing through an iterative perception-reasoning-action loop, effectively simulating multi-turn human-model interaction processes. Instead of issuing a single prompt or static plan, MIRA predicts atomic edit instructions step by step, using visual feedback to make its decisions. Our 150K multimodal tool-use dataset, MIRA-Editing, combined with a two-stage SFT + GRPO training pipeline, enables MIRA to perform reasoning and editing over complex editing instructions. When paired with open-source image editing models such as Flux.1-Kontext, Step1X-Edit, and Qwen-Image-Edit, MIRA significantly improves both semantic consistency and perceptual quality, achieving performance comparable to or exceeding proprietary systems such as GPT-Image and Nano-Banana.",
    "keywords": [
      "Image Editing",
      "Multimodal Reasoning",
      "AI Agent",
      "Diffusion Models",
      "Instruction Following"
    ],
    "area": [
      "Multimodal",
      "AI Agent",
      "Computer Vision"
    ],
    "published_time": "2025-11-26T06:13:32.000Z",
    "download_time": "2025-11-28 12:03:10",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.21087\", \"arxiv_url\": \"https://arxiv.org/abs/2511.21087\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.21087.png\", \"original_title\": \"MIRA: Multimodal Iterative Reasoning Agent for Image Editing\"}"
  }
]