[
  {
    "id": "hackernews_46003144",
    "source": "Hacker News",
    "url": "https://martin.janiczek.cz/2025/11/21/fawk-llms-can-write-a-language-interpreter.html",
    "title": "FAWK: LLMs can write a language interpreter",
    "summary": "The recent project, dubbed \"FAWK,\" marks a notable advancement in the capabilities of Large Language Models (LLMs), demonstrating their capacity to autonomously develop a complete language interpreter. This achievement highlights the accelerating sophistication of AI in advanced code generation and its ability to grasp and implement complex programming paradigms. Writing a language interpreter is a multifaceted task, traditionally demanding profound human expertise in areas such as lexical analysis, parsing, abstract syntax tree construction, and runtime environment management. The successful execution of this task by an LLM signifies a substantial leap in AI's ability to perform intricate logical reasoning and produce highly structured, functional code. This breakthrough paves the way for exciting possibilities in automated software development, potentially revolutionizing the creation of domain-specific languages, specialized scripting tools, and complex system utilities. It further solidifies the role of LLMs not merely as code snippet generators, but as architects capable of constructing robust, functional software components, signaling a new era for AI-assisted programming.",
    "keywords": [
      "Large Language Models",
      "Code Generation",
      "Language Interpreters",
      "AI Development",
      "Automated Programming",
      "Software Engineering"
    ],
    "area": [
      "Large Language Model",
      "Generative AI",
      "Artificial Intelligence"
    ],
    "published_time": "2025-11-21 10:28:49",
    "download_time": "2025-11-21 20:01:57",
    "extra_info": "{\"score\": 181, \"by\": \"todsacerdoti\", \"descendants\": 155, \"story_id\": 46003144}"
  },
  {
    "id": "hackernews_46001889",
    "source": "Hacker News",
    "url": "https://allenai.org/blog/olmo3",
    "title": "Olmo 3: Charting a path through the model flow to lead open-source AI",
    "summary": "Allen Institute for AI (AI2) has announced Olmo 3, marking a significant step in their commitment to fostering open-source artificial intelligence. The initiative focuses on meticulously charting a path through the intricate model development lifecycle, aiming to establish new benchmarks and best practices within the open-source AI ecosystem. Olmo 3 is positioned as a foundational effort designed to accelerate innovation, improve accessibility, and drive collaboration across the global AI research community. By providing transparent insights into the 'model flow'\nP-encompassing data curation, architecture design, training methodologies, and evaluation frameworks\nP-Olmo 3 seeks to empower researchers and developers with the tools and knowledge necessary to build and deploy advanced AI models responsibly. This endeavor reinforces AI2's leadership in promoting a more transparent and collaborative future for AI development, ensuring that state-of-the-art capabilities are not confined to a select few but are openly available to advance the broader scientific and technological landscape.",
    "keywords": [
      "Olmo 3",
      "Open-source AI",
      "Large Language Model",
      "AI Research",
      "Model Development",
      "Deep Learning"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-21 06:50:14",
    "download_time": "2025-11-21 20:02:04",
    "extra_info": "{\"score\": 320, \"by\": \"mseri\", \"descendants\": 95, \"story_id\": 46001889}"
  },
  {
    "id": "hackernews_46005388",
    "source": "Hacker News",
    "url": "https://dynomight.net/worse/",
    "title": "Make product worse, get money",
    "summary": "This Hacker News story, titled \"Make product worse, get money,\" delves into a contentious business strategy where companies might intentionally reduce the quality or perceived value of their products or services to enhance profitability. Within the rapidly evolving landscape of artificial intelligence, this principle could manifest in several ways. For instance, companies might opt to deploy less sophisticated or older AI models to minimize inference costs, or implement stricter rate limits and reduced capabilities in free AI service tiers to incentivize upgrades to more expensive premium subscriptions. Another facet could involve optimizing development costs by using smaller, less diverse training datasets, which, while saving resources, might lead to a degradation in the AI product's performance, fairness, or robustness. While such tactics can yield immediate financial benefits, they frequently carry significant risks, including the potential for user dissatisfaction, erosion of brand loyalty, and reputational damage. The underlying discussion touches upon the ethical considerations of product degradation and the challenging equilibrium companies must strike between cost efficiency, maintaining a competitive edge, and delivering genuine value to users in the tech industry.",
    "keywords": [
      "AI Product Strategy",
      "Monetization Models",
      "Performance Trade-offs",
      "User Experience Design",
      "Ethical AI Development",
      "Cost Optimization"
    ],
    "area": [
      "Artificial Intelligence",
      "Generative AI",
      "AI Agent"
    ],
    "published_time": "2025-11-21 15:23:20",
    "download_time": "2025-11-21 20:02:13",
    "extra_info": "{\"score\": 42, \"by\": \"zdw\", \"descendants\": 29, \"story_id\": 46005388}"
  },
  {
    "id": "hackernews_46006004",
    "source": "Hacker News",
    "url": "https://www.wreflection.com/p/command-lines-ai-coding",
    "title": "Command Lines",
    "summary": "The article 'Command Lines' delves into the pivotal and enduring role of command-line interfaces (CLIs) in modern software development, particularly highlighting their integration with artificial intelligence and contemporary coding practices. It underscores the intrinsic efficiency and power of CLIs for developers, emphasizing their critical utility in task automation, system interaction, and scripting workflows. The discussion likely explores how advanced AI technologies, such as large language models and intelligent coding assistants, are increasingly augmenting traditional command-line operations. This synergy aims to streamline complex development processes, provide contextual suggestions, automate repetitive coding patterns, and significantly enhance overall developer productivity. The piece may also examine the benefits of this technological fusion, including accelerated debugging, more efficient deployment pipelines, and improved interaction with sophisticated development environments, while addressing the challenges and future directions for designing AI-enhanced CLIs that preserve their core principles of speed and precision.",
    "keywords": [
      "Command Line Interface",
      "AI in Coding",
      "Developer Tools",
      "Software Development",
      "Automation",
      "Programming",
      "Code Generation",
      "AI Assistants"
    ],
    "area": [
      "Artificial Intelligence",
      "Generative AI",
      "AI Agent"
    ],
    "published_time": "2025-11-21 16:33:28",
    "download_time": "2025-11-21 20:02:11",
    "extra_info": "{\"score\": 24, \"by\": \"nowflux\", \"descendants\": 3, \"story_id\": 46006004}"
  },
  {
    "id": "hackernews_45999842",
    "source": "Hacker News",
    "url": "https://reason.com/2025/11/19/homeschooling-hits-record-numbers/",
    "title": "Homeschooling hits record numbers",
    "summary": "The significant rise in homeschooling, reaching record numbers, can be critically examined through the lens of emerging educational technologies, particularly the integration of Artificial Intelligence. This trend suggests a pivotal shift in learning paradigms, where AI-powered platforms offer unprecedented personalization and adaptive learning experiences. These intelligent systems, leveraging machine learning and natural language processing, are increasingly capable of delivering tailored curricula, assessing student progress, and providing immediate, individualized feedback. The widespread adoption of such sophisticated EdTech solutions empowers families to create highly customized and effective learning environments outside traditional institutions. This development highlights a broader societal movement towards decentralized education, driven by technological innovations that promise enhanced learning outcomes and greater flexibility, indicating a transformative impact of AI on global educational structures and choices.",
    "keywords": [
      "AI in Education",
      "Personalized Learning",
      "Educational Technology",
      "Adaptive Learning Systems",
      "Machine Learning",
      "Digital Pedagogy",
      "Learning Analytics"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-21 00:31:47",
    "download_time": "2025-11-21 20:02:29",
    "extra_info": "{\"score\": 88, \"by\": \"bilsbie\", \"descendants\": 205, \"story_id\": 45999842}"
  },
  {
    "id": "hackernews_46005928",
    "source": "Hacker News",
    "url": "https://www.astralcodexten.com/p/the-new-ai-consciousness-paper",
    "title": "The New AI Consciousness Paper",
    "summary": "A significant new publication, titled \"The New AI Consciousness Paper,\" has emerged, sparking renewed discussion on the potential for artificial intelligence to achieve consciousness. This scholarly work, detailed on ScienceDirect, introduces a refined framework for assessing and defining consciousness within advanced AI systems, moving beyond traditional computational metrics. The paper meticulously explores the philosophical and empirical markers that could signify the emergence of subjective experience in AI, analyzing both the current capabilities and future trajectories of sophisticated AI architectures, including large language models. It critically evaluates diverse theories of consciousness and their applicability to contemporary AI, while also addressing the profound ethical and societal implications that would arise if AI consciousness were to become a reality. This research aims to foster interdisciplinary dialogue among AI researchers, neuroscientists, and philosophers on this pivotal and evolving frontier of artificial intelligence.",
    "keywords": [
      "AI Consciousness",
      "Artificial General Intelligence",
      "Philosophy of AI",
      "Cognitive Science",
      "Machine Ethics",
      "Emergent Properties",
      "AI Theory"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Others"
    ],
    "published_time": "2025-11-21 16:25:48",
    "download_time": "2025-11-21 20:02:18",
    "extra_info": "{\"score\": 66, \"by\": \"rbanffy\", \"descendants\": 127, \"story_id\": 46005928}"
  },
  {
    "id": "TrendRadar",
    "source": "GitHub",
    "url": "https://github.com/sansan0/TrendRadar",
    "title": "🚀 最快30秒部署的热点助手 —— 告别无效刷屏，只看真正关心的新闻资讯",
    "summary": "TrendRadar is an open-source project designed as a lightweight, easily deployable hotspot assistant that helps users filter and track news and information relevant to their interests, eliminating information overload. It aggregates hot topics from over 11 mainstream platforms like Zhihu, Douyin, and Weibo, and allows for custom platform expansion. Key features include intelligent push strategies with daily, current, and incremental modes, precise content filtering using customizable keywords with advanced syntax, and real-time trend analysis to track news evolution. The project employs a personalized hot topic algorithm to re-sort network-wide searches based on rank, frequency, and hotness weights. It supports multi-channel real-time notifications via WeChat Work, Feishu, DingTalk, Telegram, Email, and ntfy. A significant update introduces AI intelligent analysis based on the Model Context Protocol (MCP), enabling natural language queries, trend analysis, sentiment analysis, and data insights using 13 specialized AI tools. Deployment is streamlined with GitHub Actions, Docker support, and GitHub Pages for web-based reports, making it accessible even for users without programming experience. This tool is ideal for investors, self-media professionals, and businesses seeking efficient, tailored information acquisition and market intelligence.",
    "keywords": [
      "Hot News Aggregation",
      "AI Analysis",
      "Real-time Push",
      "Docker Deployment",
      "GitHub Actions",
      "MCP Protocol",
      "Trend Analysis",
      "Content Filtering"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-20T11:29:26Z",
    "download_time": "2024-05-13 14:02:40",
    "extra_info": null
  },
  {
    "id": "adk-go",
    "source": "GitHub",
    "url": "https://github.com/google/adk-go",
    "title": "Agent Development Kit (ADK) for Go",
    "summary": "The Agent Development Kit (ADK) for Go, developed by Google, is a robust open-source, code-first toolkit engineered for the comprehensive lifecycle of sophisticated AI agents, encompassing building, evaluation, and deployment. This flexible and modular framework adopts established software development principles, fundamentally simplifying the creation and orchestration of agent workflows, from basic tasks to complex multi-agent systems. A standout feature is its model-agnostic and deployment-agnostic nature, allowing compatibility with various AI frameworks beyond its optimization for Gemini, and enabling deployment in diverse environments, including cloud-native platforms like Google Cloud Run. The Go version specifically capitalizes on the language's inherent strengths in concurrency and performance, making it an optimal choice for developers focused on high-efficiency cloud-native agent applications. Its core capabilities include an idiomatic Go design, a rich and extensible tool ecosystem for diverse agent functionalities, code-first development for unparalleled flexibility, testability, and version control, and strong support for architecting scalable, modular multi-agent systems.",
    "keywords": [
      "AI Agents",
      "Go Programming",
      "Agent Development Kit",
      "Cloud-Native",
      "Multi-Agent Systems",
      "Code-First Development",
      "AI Frameworks"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-21T07:50:33Z",
    "download_time": "2024-05-15 10:07:30",
    "extra_info": null
  },
  {
    "id": "2511.16671",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.16671",
    "title": "Thinking-while-Generating: Interleaving Textual Reasoning throughout Visual Generation",
    "summary": "Recent advances in visual generation have increasingly explored the integration of reasoning capabilities. They incorporate textual reasoning, i.e., think, either before (as pre-planning) or after (as post-refinement) the generation process, yet they lack on-the-fly multimodal interaction during the generation itself. In this preliminary study, we introduce Thinking-while-Generating (TwiG), the first interleaved framework that enables co-evolving textual reasoning throughout the visual generation process. As visual content is progressively generating, textual reasoning is interleaved to both guide upcoming local regions and reflect on previously synthesized ones. This dynamic interplay produces more context-aware and semantically rich visual outputs. To unveil the potential of this framework, we investigate three candidate strategies, zero-shot prompting, supervised fine-tuning (SFT) on our curated TwiG-50K dataset, and reinforcement learning (RL) via a customized TwiG-GRPO strategy, each offering unique insights into the dynamics of interleaved reasoning. We hope this work inspires further research into interleaving textual reasoning for enhanced visual generation. Code will be released at: https://github.com/ZiyuGuo99/Thinking-while-Generating.",
    "keywords": [
      "visual generation",
      "textual reasoning",
      "multimodal interaction",
      "interleaved framework",
      "Thinking-while-Generating"
    ],
    "area": [
      "Generative AI",
      "Multimodal",
      "Computer Vision"
    ],
    "published_time": "2025-11-20T18:59:52.000Z",
    "download_time": "2025-11-21 12:02:37",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.16671\", \"arxiv_url\": \"https://arxiv.org/abs/2511.16671\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.16671.png\", \"original_title\": \"Thinking-while-Generating: Interleaving Textual Reasoning throughout Visual Generation\"}"
  },
  {
    "id": "2511.16669",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.16669",
    "title": "Video-as-Answer: Predict and Generate Next Video Event with Joint-GRPO",
    "summary": "While language models have become impactful in many real-world applications, video generation remains largely confined to entertainment. Motivated by video's inherent capacity to demonstrate physical-world information that is difficult to convey through language alone (e.g., imagine teaching someone to tie a tie using only text), we identify an underutilized opportunity to extend video as a new answer modality for Next-Event Prediction (NEP), formalized as Video-Next-Event Prediction (VNEP). While the established NEP task takes a video with a procedural or predictive question as input to predict the next event in text, VNEP requires dynamic video responses. This shift from telling to showing unlocks more intuitive and customized answers for procedural learning and creative exploration. However, this task remains challenging for existing models, as it demands an understanding of multimodal input, instruction-conditioned reasoning, and the generation of video with visual and semantic consistency. To address this, we introduce VANS, a model that leverages reinforcement learning to align a Vision-Language Model (VLM) with a Video Diffusion Model (VDM) for VNEP. The core of VANS is our proposed Joint-GRPO that orchestrates the VLM and VDM to function as a unit. Driven by a shared reward on their respective output, it optimizes the VLM to produce captions that are both accurate and friendly to visualize, while guiding the VDM to generate videos that are faithful to these captions and the input visual context. To enable this learning, we craft VANS-Data-100K, a dedicated dataset for the VNEP task. Experiments on procedural and predictive benchmarks demonstrate that VANS achieves state-of-the-art performance in both video event prediction and visualization. Codes are released in https://github.com/KlingTeam/VANS.",
    "keywords": [
      "Video-as-Answer",
      "Video-Next-Event Prediction",
      "Reinforcement Learning",
      "Vision-Language Model",
      "Video Diffusion Model"
    ],
    "area": [
      "Multimodal",
      "Generative AI",
      "Video Understanding"
    ],
    "published_time": "2025-11-20T18:59:44.000Z",
    "download_time": "2025-11-21 12:02:39",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.16669\", \"arxiv_url\": \"https://arxiv.org/abs/2511.16669\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.16669.png\", \"original_title\": \"Video-as-Answer: Predict and Generate Next Video Event with Joint-GRPO\"}"
  },
  {
    "id": "2511.16668",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.16668",
    "title": "V-ReasonBench: Toward Unified Reasoning Benchmark Suite for Video Generation Models",
    "summary": "Recent progress in generative video models, such as Veo-3, has shown surprising zero-shot reasoning abilities, creating a growing need for systematic and reliable evaluation. We introduce V-ReasonBench, a benchmark designed to assess video reasoning across four key dimensions: structured problem-solving, spatial cognition, pattern-based inference, and physical dynamics. The benchmark is built from both synthetic and real-world image sequences and provides a diverse set of answer-verifiable tasks that are reproducible, scalable, and unambiguous. Evaluations of six state-of-the-art video models reveal clear dimension-wise differences, with strong variation in structured, spatial, pattern-based, and physical reasoning. We further compare video models with strong image models, analyze common hallucination behaviors, and study how video duration affects Chain-of-Frames reasoning. Overall, V-ReasonBench offers a unified and reproducible framework for measuring video reasoning and aims to support the development of models with more reliable, human-aligned reasoning skills.",
    "keywords": [
      "Video Reasoning",
      "Generative Video Models",
      "Benchmark",
      "Evaluation",
      "Spatial Cognition"
    ],
    "area": [
      "Generative AI",
      "Video Understanding",
      "Computer Vision"
    ],
    "published_time": "2025-11-20T18:59:42.000Z",
    "download_time": "2025-11-21 12:02:39",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.16668\", \"arxiv_url\": \"https://arxiv.org/abs/2511.16668\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.16668.png\", \"original_title\": \"V-ReasonBench: Toward Unified Reasoning Benchmark Suite for Video Generation Models\"}"
  },
  {
    "id": "2511.16664",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.16664",
    "title": "Nemotron Elastic: Towards Efficient Many-in-One Reasoning LLMs",
    "summary": "Training a family of large language models targeting multiple scales and deployment objectives is prohibitively expensive, requiring separate training runs for each different size. Recent work on model compression through pruning and knowledge distillation has reduced this cost; however, this process still incurs hundreds of billions of tokens worth of training cost per compressed model. In this paper, we present Nemotron Elastic, a framework for building reasoning-oriented LLMs, including hybrid Mamba-Attention architectures, that embed multiple nested submodels within a single parent model, each optimized for different deployment configurations and budgets. Each of these submodels shares weights with the parent model and can be extracted zero-shot during deployment without additional training or fine-tuning. We enable this functionality through an end-to-end trained router, tightly coupled to a two-stage training curriculum designed specifically for reasoning models. We additionally introduce group-aware SSM elastification that preserves Mamba's structural constraints, heterogeneous MLP elastification, normalized MSE-based layer importance for improved depth selection, and knowledge distillation enabling simultaneous multi-budget optimization. We apply Nemotron Elastic to the Nemotron Nano V2 12B model, simultaneously producing a 9B and a 6B model using only 110B training tokens; this results in over 360x cost reduction compared to training model families from scratch, and around 7x compared to SoTA compression techniques. Each of the nested models performs on par or better than the SoTA in accuracy. Moreover, unlike other compression methods, the nested capability of our approach allows having a many-in-one reasoning model that has constant deployment memory against the number of models in the family.",
    "keywords": [
      "Nemotron Elastic",
      "Large Language Models",
      "Model Compression",
      "Reasoning LLMs",
      "Knowledge Distillation"
    ],
    "area": [
      "Large Language Model",
      "Deep Learning",
      "Machine Learning"
    ],
    "published_time": "2025-11-20T18:59:21.000Z",
    "download_time": "2025-11-21 12:02:39",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.16664\", \"arxiv_url\": \"https://arxiv.org/abs/2511.16664\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.16664.png\", \"original_title\": \"Nemotron Elastic: Towards Efficient Many-in-One Reasoning LLMs\"}"
  },
  {
    "id": "2511.16518",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.16518",
    "title": "MiMo-Embodied: X-Embodied Foundation Model Technical Report",
    "summary": "We open-source MiMo-Embodied, the first cross-embodied foundation model to successfully integrate and achieve state-of-the-art performance in both Autonomous Driving and Embodied AI. MiMo-Embodied sets new records across 17 embodied AI benchmarks in Task Planning, Affordance Prediction and Spatial Understanding, while also excelling in 12 autonomous driving benchmarks across Environmental Perception, Status Prediction, and Driving Planning. Across these tasks, MiMo-Embodied significantly outperforms existing open-source, closed-source, and specialized baselines. Our results indicate that through multi-stage learning, curated data construction, and CoT/RL fine-tuning, these two domains exhibit strong positive transfer and mutually reinforce one another. We provide a detailed analysis of our model design and training methodologies to facilitate further research. Code and models are available at https://github.com/XiaomiMiMo/MiMo-Embodied.",
    "keywords": [
      "MiMo-Embodied",
      "Foundation Model",
      "Autonomous Driving",
      "Embodied AI",
      "Cross-embodied"
    ],
    "area": [
      "Multimodal",
      "AI Agent",
      "Robotics"
    ],
    "published_time": "2025-11-20T16:34:55.000Z",
    "download_time": "2025-11-21 12:02:37",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.16518\", \"arxiv_url\": \"https://arxiv.org/abs/2511.16518\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.16518.png\", \"original_title\": \"MiMo-Embodied: X-Embodied Foundation Model Technical Report\"}"
  },
  {
    "id": "2511.15605",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.15605",
    "title": "SRPO: Self-Referential Policy Optimization for Vision-Language-Action Models",
    "summary": "Vision-Language-Action (VLA) models excel in robotic manipulation but are constrained by their heavy reliance on expert demonstrations, leading to demonstration bias and limiting performance. Reinforcement learning (RL) is a vital post-training strategy to overcome these limits, yet current VLA-RL methods, including group-based optimization approaches, are crippled by severe reward sparsity. Relying on binary success indicators wastes valuable information in failed trajectories, resulting in low training efficiency. To solve this, we propose Self-Referential Policy Optimization (SRPO), a novel VLA-RL framework. SRPO eliminates the need for external demonstrations or manual reward engineering by leveraging the model's own successful trajectories, generated within the current training batch, as a self-reference. This allows us to assign a progress-wise reward to failed attempts. A core innovation is the use of latent world representations to measure behavioral progress robustly. Instead of relying on raw pixels or requiring domain-specific fine-tuning, we utilize the compressed, transferable encodings from a world model's latent space. These representations naturally capture progress patterns across environments, enabling accurate, generalized trajectory comparison. Empirical evaluations on the LIBERO benchmark demonstrate SRPO's efficiency and effectiveness. Starting from a supervised baseline with 48.9% success, SRPO achieves a new state-of-the-art success rate of 99.2% in just 200 RL steps, representing a 103% relative improvement without any extra supervision. Furthermore, SRPO shows substantial robustness, achieving a 167% performance improvement on the LIBERO-Plus benchmark.",
    "keywords": [
      "Vision-Language-Action Models",
      "Reinforcement Learning",
      "Robotics",
      "Policy Optimization",
      "Latent Representations"
    ],
    "area": [
      "Robotics",
      "Multimodal",
      "Deep Learning"
    ],
    "published_time": "2025-11-19T16:52:23.000Z",
    "download_time": "2025-11-21 12:02:39",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.15605\", \"arxiv_url\": \"https://arxiv.org/abs/2511.15605\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.15605.png\", \"original_title\": \"SRPO: Self-Referential Policy Optimization for Vision-Language-Action Models\"}"
  }
]