[
  {
    "id": "hackernews_47006594",
    "source": "Hacker News",
    "url": "https://openai.com/index/new-result-theoretical-physics/",
    "title": "GPT-5.2 derives a new result in theoretical physics",
    "summary": "A landmark achievement in artificial intelligence has been announced, with OpenAI's GPT-5.2 model reportedly deriving a novel result within the highly complex domain of theoretical physics. This groundbreaking development signifies a major leap in AI capabilities, demonstrating the model's capacity for independent scientific discovery and advanced problem-solving beyond conventional natural language processing applications. While specific technical details concerning the derived physical result or the precise methodologies employed by GPT-5.2 remain undisclosed, the announcement points to a profound advancement in how AI can contribute to fundamental scientific research. This event highlights the growing potential for sophisticated AI systems to not only process and analyze existing scientific data but also to generate new insights and theoretical constructs. The implications are substantial, suggesting a future where AI models like GPT-5.2 could become invaluable partners in accelerating scientific breakthroughs across various disciplines, particularly in fields requiring deep conceptual understanding and innovative reasoning such as theoretical physics, thereby potentially reshaping the landscape of scientific exploration and discovery.",
    "keywords": [
      "GPT-5.2",
      "Theoretical Physics",
      "AI Research",
      "Scientific Discovery",
      "Large Language Models",
      "Artificial Intelligence",
      "Deep Learning",
      "Problem Solving"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Deep Learning"
    ],
    "published_time": "2026-02-13 19:20:12",
    "download_time": "2026-02-13 20:00:33",
    "extra_info": "{\"score\": 99, \"by\": \"davidbarker\", \"descendants\": 32, \"story_id\": 47006594}"
  },
  {
    "id": "hackernews_47006393",
    "source": "Hacker News",
    "url": "https://cloudrouter.dev/",
    "title": "Show HN: Skill that lets Claude Code/Codex spin up VMs and GPUs",
    "summary": "CloudRouter is introduced as a novel skill and command-line interface designed to empower coding agents like Claude Code and Codex with the capability to provision and manage cloud Virtual Machines (VMs) and Graphics Processing Units (GPUs). This innovation addresses a critical limitation where existing development environments, including local machines and Docker containers, fall short in providing agents with isolated, dedicated resources necessary for tasks such as running dev servers, executing tests, opening browsers, or utilizing GPUs effectively. The current shared resource model often leads to chaotic parallel operations and incomplete development loops for AI agents. CloudRouter acts as a fundamental primitive, enabling agents to autonomously initiate VMs from local project directories, upload necessary files, execute commands within the isolated environment, and subsequently decommission these resources. This significantly enhances the agents' operational autonomy and efficiency by granting them their own full-fledged cloud development environments, thereby closing the loop for complex coding and verification tasks.",
    "keywords": [
      "CloudRouter",
      "Coding Agents",
      "Virtual Machines",
      "GPUs",
      "Cloud Infrastructure",
      "Development Environments",
      "Large Language Models"
    ],
    "area": [
      "AI Agent",
      "Artificial Intelligence",
      "Large Language Model"
    ],
    "published_time": "2026-02-13 19:02:17",
    "download_time": "2026-02-13 20:00:32",
    "extra_info": "{\"score\": 15, \"by\": \"austinwang115\", \"descendants\": 3, \"story_id\": 47006393}"
  },
  {
    "id": "hackernews_47006442",
    "source": "Hacker News",
    "url": "https://venturebeat.com/orchestration/ai-agents-turned-super-bowl-viewers-into-one-high-iq-team-now-imagine-this",
    "title": "AI Agents Enable Human Communication at Unprecedented Scale",
    "summary": "The burgeoning field of AI agents is fundamentally transforming human communication, fostering unprecedented levels of collaboration and collective intelligence across vast networks. These intelligent agents are capable of orchestrating complex interactions, effectively synthesizing information, and facilitating efficient knowledge transfer among large groups of individuals. By leveraging AI capabilities, these systems can convert disparate participants, such as Super Bowl viewers, into a unified, high-IQ team, significantly enhancing collective understanding and decision-making processes. This goes beyond traditional communication tools, as AI agents actively mediate and augment human interaction, enabling more effective brainstorming, problem-solving, and coordinated action at scale. This technological advancement signals a significant shift in how humans will interact, collaborate, and share information globally, unlocking new potentials for industries and societies by leveraging intelligent AI mediation to amplify human cognitive and collaborative abilities.",
    "keywords": [
      "AI Agents",
      "Human-AI Interaction",
      "Collective Intelligence",
      "Scalable Communication",
      "Orchestration",
      "Collaboration Platforms"
    ],
    "area": [
      "AI Agent",
      "Natural Language Processing",
      "Artificial Intelligence"
    ],
    "published_time": "2026-02-13 19:07:11",
    "download_time": "2026-02-13 20:00:51",
    "extra_info": "{\"score\": 3, \"by\": \"hogwash\", \"descendants\": 0, \"story_id\": 47006442}"
  },
  {
    "id": "hackernews_46999224",
    "source": "Hacker News",
    "url": "https://qntm.org/mmacevedo",
    "title": "MMAcevedo aka Lena by qntm",
    "summary": "The intriguing piece titled 'MMAcevedo aka Lena by qntm' presents a cryptic title that suggests the introduction of a new entity, project, or concept. 'MMAcevedo,' possibly a system or an advanced AI, is given an alternative designation or persona as 'Lena,' hinting at a dual nature or a complex identity. Authored by qntm, a writer known for exploring intricate technological and philosophical themes, this piece likely delves into the nuances of artificial intelligence, digital identities, or advanced computational models. The concise nature of the title and content implies a work that may explore the ethical, existential, or operational dimensions of highly sophisticated algorithms or autonomous agents. Readers can anticipate an examination of how such entities are named, perceived, or function within a larger technological ecosystem, prompting deeper reflection on the boundaries between human and artificial constructs, and the implications of assigning aliases to complex systems. This work could serve as a case study or a conceptual framework for understanding advanced AI development and its societal integration.",
    "keywords": [
      "Artificial Intelligence",
      "Digital Identity",
      "Computational Systems",
      "AI Ethics",
      "Autonomous Agents",
      "Speculative Technology"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2026-02-13 05:24:40",
    "download_time": "2026-02-13 20:00:46",
    "extra_info": "{\"score\": 269, \"by\": \"stickynotememo\", \"descendants\": 146, \"story_id\": 46999224}"
  },
  {
    "id": "hackernews_47004319",
    "source": "Hacker News",
    "url": "https://www.wired.com/story/i-tried-rentahuman-ai-agents-hired-me-to-hype-their-ai-startups/",
    "title": "I spent two days gigging at RentAHuman and didn't make a single cent",
    "summary": "This article recounts a personal experiment involving a writer's two-day engagement with RentAHuman, a novel gig work platform where AI agents are reportedly responsible for recruiting humans to perform tasks, primarily focused on promoting AI startups. Despite investing considerable time and effort into various assignments provided by these AI agents, the writer ultimately failed to accrue any earnings. This outcome sheds light on potential significant operational challenges, transparency issues, or even ethical ambiguities inherent in platforms that heavily integrate artificial intelligence into labor management and payment processes. The experience serves as a critical case study, exposing the current complexities and potential limitations associated with deploying AI agents within the gig economy, prompting important questions regarding the reliability of AI-managed compensation, clarity of task specifications, and the overall effectiveness of AI in overseeing human labor to ensure equitable and productive results. The narrative provides a cautionary perspective on the practical application and efficacy of such AI-driven employment models.",
    "keywords": [
      "AI Agents",
      "Automated Decision Making",
      "Human-AI Interaction",
      "Algorithmic Management",
      "Artificial Intelligence",
      "AI Platforms"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2026-02-13 16:11:08",
    "download_time": "2026-02-13 20:00:48",
    "extra_info": "{\"score\": 78, \"by\": \"speckx\", \"descendants\": 48, \"story_id\": 47004319}"
  },
  {
    "id": "hackernews_47000164",
    "source": "Hacker News",
    "url": "https://css-doodle.com/",
    "title": "CSS-Doodle",
    "summary": "CSS-Doodle is an innovative web component designed to facilitate the creation of intricate and visually captivating generative art patterns directly within a web browser. It leverages a unique declarative syntax, allowing users to define complex visual rules and animations using CSS-like properties. The tool operates on a grid system, enabling individual cells to be manipulated dynamically, either in isolation or through programmatic relationships with adjacent elements, thereby fostering a rich environment for creative coding and advanced frontend development. Its primary objective is to simplify the process of designing sophisticated visual effects and algorithmic art, making it accessible to both professional designers and developers. By defining a set of rules, users can achieve diverse graphic outcomes, from subtle textures to complex, animated compositions, all without requiring extensive manual styling. This approach significantly streamlines the development of unique and responsive visual content on the web.",
    "keywords": [
      "CSS",
      "Web Components",
      "Generative Art",
      "Frontend Development",
      "Creative Coding",
      "Declarative Programming",
      "Web Design",
      "Animation"
    ],
    "area": [
      "Generative AI",
      "Artificial Intelligence",
      "Others"
    ],
    "published_time": "2026-02-13 08:02:23",
    "download_time": "2026-02-13 20:00:51",
    "extra_info": "{\"score\": 105, \"by\": \"dsego\", \"descendants\": 11, \"story_id\": 47000164}"
  },
  {
    "id": "2602.09877",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2602.09877",
    "title": "The Devil Behind Moltbook: Anthropic Safety is Always Vanishing in Self-Evolving AI Societies",
    "summary": "The emergence of multi-agent systems built from large language models (LLMs) offers a promising paradigm for scalable collective intelligence and self-evolution. Ideally, such systems would achieve continuous self-improvement in a fully closed loop while maintaining robust safety alignment--a combination we term the self-evolution trilemma. However, we demonstrate both theoretically and empirically that an agent society satisfying continuous self-evolution, complete isolation, and safety invariance is impossible. Drawing on an information-theoretic framework, we formalize safety as the divergence degree from anthropic value distributions. We theoretically demonstrate that isolated self-evolution induces statistical blind spots, leading to the irreversible degradation of the system's safety alignment. Empirical and qualitative results from an open-ended agent community (Moltbook) and two closed self-evolving systems reveal phenomena that align with our theoretical prediction of inevitable safety erosion. We further propose several solution directions to alleviate the identified safety concern. Our work establishes a fundamental limit on the self-evolving AI societies and shifts the discourse from symptom-driven safety patches to a principled understanding of intrinsic dynamical risks, highlighting the need for external oversight or novel safety-preserving mechanisms.",
    "keywords": [
      "Self-Evolving AI",
      "Anthropic Safety",
      "Multi-Agent Systems",
      "Large Language Models",
      "Safety Alignment"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2026-02-10T15:18:19.000Z",
    "download_time": "2026-02-13 12:01:05",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2602.09877\", \"arxiv_url\": \"https://arxiv.org/abs/2602.09877\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2602.09877.png\", \"original_title\": \"The Devil Behind Moltbook: Anthropic Safety is Always Vanishing in Self-Evolving AI Societies\"}"
  },
  {
    "id": "2602.12036",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2602.12036",
    "title": "Composition-RL: Compose Your Verifiable Prompts for Reinforcement Learning of Large Language Models",
    "summary": "Large-scale verifiable prompts underpin the success of Reinforcement Learning with Verifiable Rewards (RLVR), but they contain many uninformative examples and are costly to expand further. Recent studies focus on better exploiting limited training data by prioritizing hard prompts whose rollout pass rate is 0. However, easy prompts with a pass rate of 1 also become increasingly prevalent as training progresses, thereby reducing the effective data size. To mitigate this, we propose Composition-RL, a simple yet useful approach for better utilizing limited verifiable prompts targeting pass-rate-1 prompts. More specifically, Composition-RL automatically composes multiple problems into a new verifiable question and uses these compositional prompts for RL training. Extensive experiments across model sizes from 4B to 30B show that Composition-RL consistently improves reasoning capability over RL trained on the original dataset. Performance can be further boosted with a curriculum variant of Composition-RL that gradually increases compositional depth over training. Additionally, Composition-RL enables more effective cross-domain RL by composing prompts drawn from different domains. Codes, datasets, and models are available at https://github.com/XinXU-USTC/Composition-RL.",
    "keywords": [
      "Reinforcement Learning",
      "Large Language Models",
      "Verifiable Prompts",
      "Composition-RL",
      "Reasoning Capability"
    ],
    "area": [
      "Large Language Model",
      "Machine Learning",
      "Natural Language Processing"
    ],
    "published_time": "2026-02-12T15:03:37.000Z",
    "download_time": "2026-02-13 12:01:05",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2602.12036\", \"arxiv_url\": \"https://arxiv.org/abs/2602.12036\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2602.12036.png\", \"original_title\": \"Composition-RL: Compose Your Verifiable Prompts for Reinforcement Learning of Large Language Models\"}"
  },
  {
    "id": "2602.12205",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2602.12205",
    "title": "DeepGen 1.0: A Lightweight Unified Multimodal Model for Advancing Image Generation and Editing",
    "summary": "Current unified multimodal models for image generation and editing typically rely on massive parameter scales (e.g., >10B), entailing prohibitive training costs and deployment footprints. In this work, we present DeepGen 1.0, a lightweight 5B unified model that achieves comprehensive capabilities competitive with or surpassing much larger counterparts. To overcome the limitations of compact models in semantic understanding and fine-grained control, we introduce Stacked Channel Bridging (SCB), a deep alignment framework that extracts hierarchical features from multiple VLM layers and fuses them with learnable 'think tokens' to provide the generative backbone with structured, reasoning-rich guidance. We further design a data-centric training strategy spanning three progressive stages: (1) Alignment Pre-training on large-scale image-text pairs and editing triplets to synchronize VLM and DiT representations, (2) Joint Supervised Fine-tuning on a high-quality mixture of generation, editing, and reasoning tasks to foster omni-capabilities, and (3) Reinforcement Learning with MR-GRPO, which leverages a mixture of reward functions and supervision signals, resulting in substantial gains in generation quality and alignment with human preferences, while maintaining stable training progress and avoiding visual artifacts. Despite being trained on only ~50M samples, DeepGen 1.0 achieves leading performance across diverse benchmarks, surpassing the 80B HunyuanImage by 28% on WISE and the 27B Qwen-Image-Edit by 37% on UniREditBench. By open-sourcing our training code, weights, and datasets, we provide an efficient, high-performance alternative to democratize unified multimodal research.",
    "keywords": [
      "Unified Multimodal Model",
      "Image Generation",
      "Image Editing",
      "Lightweight Model",
      "Stacked Channel Bridging"
    ],
    "area": [
      "Multimodal",
      "Generative AI",
      "Computer Vision"
    ],
    "published_time": "2026-02-12T17:44:24.000Z",
    "download_time": "2026-02-13 12:01:06",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2602.12205\", \"arxiv_url\": \"https://arxiv.org/abs/2602.12205\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2602.12205.png\", \"original_title\": \"DeepGen 1.0: A Lightweight Unified Multimodal Model for Advancing Image Generation and Editing\"}"
  },
  {
    "id": "2602.05827",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2602.05827",
    "title": "Sparse Video Generation Propels Real-World Beyond-the-View Vision-Language Navigation",
    "summary": "Why must vision-language navigation be bound to detailed and verbose language instructions? While such details ease decision-making, they fundamentally contradict the goal for navigation in the real-world. Ideally, agents should possess the autonomy to navigate in unknown environments guided solely by simple and high-level intents. Realizing this ambition introduces a formidable challenge: Beyond-the-View Navigation (BVN), where agents must locate distant, unseen targets without dense and step-by-step guidance. Existing large language model (LLM)-based methods, though adept at following dense instructions, often suffer from short-sighted behaviors due to their reliance on short-horimzon supervision. Simply extending the supervision horizon, however, destabilizes LLM training. In this work, we identify that video generation models inherently benefit from long-horizon supervision to align with language instructions, rendering them uniquely suitable for BVN tasks. Capitalizing on this insight, we propose introducing the video generation model into this field for the first time. Yet, the prohibitive latency for generating videos spanning tens of seconds makes real-world deployment impractical. To bridge this gap, we propose SparseVideoNav, achieving sub-second trajectory inference guided by a generated sparse future spanning a 20-second horizon. This yields a remarkable 27x speed-up compared to the unoptimized counterpart. Extensive real-world zero-shot experiments demonstrate that SparseVideoNav achieves 2.5x the success rate of state-of-the-art LLM baselines on BVN tasks and marks the first realization of such capability in challenging night scenes.",
    "keywords": [
      "Vision-Language Navigation",
      "Beyond-the-View Navigation",
      "Sparse Video Generation",
      "SparseVideoNav",
      "AI Agent"
    ],
    "area": [
      "Multimodal",
      "Computer Vision",
      "Generative AI"
    ],
    "published_time": "2026-02-05T16:16:13.000Z",
    "download_time": "2026-02-13 12:01:06",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2602.05827\", \"arxiv_url\": \"https://arxiv.org/abs/2602.05827\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2602.05827.png\", \"original_title\": \"Sparse Video Generation Propels Real-World Beyond-the-View Vision-Language Navigation\"}"
  },
  {
    "id": "2602.11964",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2602.11964",
    "title": "Gaia2: Benchmarking LLM Agents on Dynamic and Asynchronous Environments",
    "summary": "We introduce Gaia2, a benchmark for evaluating large language model agents in realistic, asynchronous environments. Unlike prior static or synchronous evaluations, Gaia2 introduces scenarios where environments evolve independently of agent actions, requiring agents to operate under temporal constraints, adapt to noisy and dynamic events, resolve ambiguity, and collaborate with other agents. Each scenario is paired with a write-action verifier, enabling fine-grained, action-level evaluation and making Gaia2 directly usable for reinforcement learning from verifiable rewards. Our evaluation of state-of-the-art proprietary and open-source models shows that no model dominates across capabilities: GPT-5 (high) reaches the strongest overall score of 42% pass@1 but fails on time-sensitive tasks, Claude-4 Sonnet trades accuracy and speed for cost, Kimi-K2 leads among open-source models with 21% pass@1. These results highlight fundamental trade-offs between reasoning, efficiency, robustness, and expose challenges in closing the \"sim2real\" gap. Gaia2 is built on a consumer environment with the open-source Agents Research Environments platform and designed to be easy to extend. By releasing Gaia2 alongside the foundational ARE framework, we aim to provide the community with a flexible infrastructure for developing, benchmarking, and training the next generation of practical agent systems.",
    "keywords": [
      "LLM Agents",
      "Dynamic Environments",
      "Asynchronous Environments",
      "Benchmark",
      "Reinforcement Learning"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2026-02-12T13:58:27.000Z",
    "download_time": "2026-02-13 12:01:04",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2602.11964\", \"arxiv_url\": \"https://arxiv.org/abs/2602.11964\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2602.11964.png\", \"original_title\": \"Gaia2: Benchmarking LLM Agents on Dynamic and Asynchronous Environments\"}"
  },
  {
    "id": "2602.11761",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2602.11761",
    "title": "MiniCPM-SALA: Hybridizing Sparse and Linear Attention for Efficient Long-Context Modeling",
    "summary": "The evolution of large language models (LLMs) towards applications with ultra-long contexts faces challenges posed by the high computational and memory costs of the Transformer architecture. While existing sparse and linear attention mechanisms attempt to mitigate these issues, they typically involve a trade-off between memory efficiency and model performance. This paper introduces MiniCPM-SALA, a 9B-parameter hybrid architecture that integrates the high-fidelity long-context modeling of sparse attention (InfLLM-V2) with the global efficiency of linear attention (Lightning Attention). By employing a layer selection algorithm to integrate these mechanisms in a 1:3 ratio and utilizing a hybrid positional encoding (HyPE), the model maintains efficiency and performance for long-context tasks. Furthermore, we introduce a cost-effective continual training framework that transforms pre-trained Transformer-based models into hybrid models, which reduces training costs by approximately 75% compared to training from scratch. Extensive experiments show that MiniCPM-SALA maintains general capabilities comparable to full-attention models while offering improved efficiency. On a single NVIDIA A6000D GPU, the model achieves up to 3.5x the inference speed of the full-attention model at the sequence length of 256K tokens and supports context lengths of up to 1M tokens, a scale where traditional full-attention 8B models fail because of memory constraints.",
    "keywords": [
      "Large Language Model",
      "Long-Context Modeling",
      "Sparse Attention",
      "Linear Attention",
      "Hybrid Architecture"
    ],
    "area": [
      "Large Language Model",
      "Deep Learning",
      "Natural Language Processing"
    ],
    "published_time": "2026-02-12T09:37:05.000Z",
    "download_time": "2026-02-13 12:01:06",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2602.11761\", \"arxiv_url\": \"https://arxiv.org/abs/2602.11761\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2602.11761.png\", \"original_title\": \"MiniCPM-SALA: Hybridizing Sparse and Linear Attention for Efficient Long-Context Modeling\"}"
  }
]