[
  {
    "id": "hackernews_45812729",
    "source": "Hacker News",
    "url": "https://arxiv.org/abs/2510.03215",
    "title": "Cache-to-Cache: Direct Semantic Communication Between Large Language Models",
    "summary": "A novel approach termed 'Cache-to-Cache' communication is proposed, enabling direct semantic interaction between Large Language Models (LLMs). This method facilitates a more efficient and semantically rich exchange of information by allowing LLMs to directly access and interpret the internal representations (caches) of other models. Unlike traditional token-based communication, which can be verbose and prone to information loss, Cache-to-Cache communication aims to create a more direct and nuanced dialogue channel, potentially improving collaborative reasoning, complex task decomposition, and knowledge transfer across different LLM instances. This paradigm shift could lead to more robust and coherent multi-agent AI systems, mitigating issues associated with sequential processing and externalizing thought processes through natural language. The research explores the architectural modifications and protocol design necessary to achieve this level of internal model communication, highlighting its potential to unlock new capabilities for AI coordination and problem-solving.",
    "keywords": [
      "Large Language Models",
      "Semantic Communication",
      "Inter-Model Communication",
      "AI Systems",
      "Neural Network Caches",
      "Distributed AI",
      "Multi-Agent Systems"
    ],
    "area": [
      "Large Language Model",
      "Artificial Intelligence",
      "Machine Learning"
    ],
    "published_time": "2025-11-04 16:24:03",
    "download_time": "2025-11-04 20:01:57",
    "extra_info": "{\"score\": 4, \"by\": \"jonbaer\", \"descendants\": 0, \"story_id\": 45812729}"
  },
  {
    "id": "hackernews_45814461",
    "source": "Hacker News",
    "url": "https://www.bloomberg.com/news/articles/2025-11-04/amazon-demands-perplexity-stop-ai-agent-from-making-purchases",
    "title": "Amazon Demands Perplexity Stop AI Agent from Making Purchases",
    "summary": "Amazon has reportedly issued a demand to AI company Perplexity, urging it to cease the activity of an AI agent that is capable of making purchases. This development underscores emerging challenges at the intersection of artificial intelligence and e-commerce, as autonomous AI agents begin to interact directly with consumer platforms. The core issue likely revolves around the implications of AI systems independently initiating transactions, potentially raising concerns regarding unauthorized spending, data privacy, and accountability for purchases. This incident highlights the critical need for clear guidelines and ethical frameworks governing the deployment of AI agents in real-world commercial environments. It also signals an increasing focus from major corporations like Amazon on regulating how AI technologies operate within their ecosystems, aiming to prevent potential misuse or disruption to existing business models. The situation prompts a broader discussion on the control mechanisms and oversight necessary for advanced AI applications to ensure safe and responsible integration into daily commerce, as companies navigate the complexities of autonomous agents and their economic impact.",
    "keywords": [
      "AI Agent",
      "Perplexity AI",
      "Amazon",
      "E-commerce AI",
      "Autonomous AI",
      "AI Ethics",
      "Consumer Protection"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Large Language Model"
    ],
    "published_time": "2025-11-04 18:43:11",
    "download_time": "2025-11-04 20:01:56",
    "extra_info": "{\"score\": 18, \"by\": \"monkeydust\", \"descendants\": 5, \"story_id\": 45814461}"
  },
  {
    "id": "hackernews_45813767",
    "source": "Hacker News",
    "url": "https://cognition.ai/blog/codemaps",
    "title": "Codemaps: Understand Code, Before You Vibe It",
    "summary": "Cognition AI has introduced \"Codemaps,\" a novel approach designed to enhance the understanding of complex codebases, particularly for autonomous AI agents like Devin. This initiative emphasizes a structured, analytical methodology for code comprehension, moving beyond intuitive or trial-and-error methods often termed \"vibe-it\" approaches. Codemaps likely involve generating detailed representations or visualizations of code structure, dependencies, and logical flows, providing AI agents with a deeper contextual awareness before they interact with or modify the code. This systematic understanding is crucial for improving the precision and reliability of AI-driven software development tasks, including debugging, feature implementation, and refactoring. By enabling AI agents to grasp the underlying architecture and intent of a codebase more thoroughly, Codemaps aim to significantly reduce errors and increase efficiency in autonomous coding, marking a step forward in robust AI-assisted software engineering. The development highlights the ongoing efforts to equip AI with more sophisticated tools for real-world programming challenges.",
    "keywords": [
      "Code Understanding",
      "AI Agents",
      "Software Development",
      "Program Analysis",
      "Automated Programming",
      "Developer Tools",
      "Cognition AI"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Large Language Model"
    ],
    "published_time": "2025-11-04 17:47:09",
    "download_time": "2025-11-04 20:01:27",
    "extra_info": "{\"score\": 66, \"by\": \"janpio\", \"descendants\": 8, \"story_id\": 45813767}"
  },
  {
    "id": "hackernews_45813310",
    "source": "Hacker News",
    "url": "https://www.plexe.ai/",
    "title": "Launch HN: Plexe (YC X25) – Build production-grade ML models from prompts",
    "summary": "Plexe (YC X25), founded by Vaibhav and Marcello, has introduced a new platform designed to automate the development of production-grade machine learning models directly from natural language prompts. The system enables users to specify an ML problem and provide data, with Plexe then managing the comprehensive ML pipeline, from intricate feature engineering to final model deployment. This innovative approach aims to alleviate the substantial time and resource drain experienced by ML teams on repetitive and often formulaic tasks such as data wrangling and feature engineering, which traditionally consume a significant portion of project timelines. The founders highlight that Plexe's solution offers a more efficient and accurate alternative to simply applying Large Language Models, which they argue can lead to increased computational expenses and diminished performance, thereby streamlining the path to robust ML solutions.",
    "keywords": [
      "Machine Learning",
      "ML Automation",
      "Feature Engineering",
      "Model Deployment",
      "ML Pipeline",
      "Prompt Engineering"
    ],
    "area": [
      "Machine Learning",
      "Artificial Intelligence",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-04 17:07:47",
    "download_time": "2025-11-04 20:01:25",
    "extra_info": "{\"score\": 42, \"by\": \"vaibhavdubey97\", \"descendants\": 12, \"story_id\": 45813310}"
  },
  {
    "id": "hackernews_45806348",
    "source": "Hacker News",
    "url": "https://animationobsessive.substack.com/p/when-stick-figures-fought",
    "title": "When stick figures fought",
    "summary": "This piece, cryptically titled 'When stick figures fought,' appears to delve into the foundational aspects of creating dynamic interactions and sequential movements, potentially through early animation techniques or conceptualizing simple autonomous entities. While directly referencing visual media, its core themes can be extrapolated to the historical development of computational simulations and rudimentary agent-based systems. It likely explores how minimal rules or programming can lead to emergent, complex behaviors, a principle fundamental to contemporary AI research in areas like robotics and generative design. The narrative may touch upon the evolution of automated visual content generation or the challenges of depicting interaction with limited graphical fidelity, offering insights into the genesis of visual AI applications such as video understanding and synthetic media creation. This conceptual exploration highlights the enduring human endeavor to imbue inanimate objects with motion and decision-making, setting a historical precedent for the sophisticated AI agents and generative models we encounter today.",
    "keywords": [
      "Autonomous Agents",
      "Simulation",
      "Generative AI",
      "Behavioral Modeling",
      "Computational Creativity"
    ],
    "area": [
      "AI Agent",
      "Generative AI",
      "Robotics"
    ],
    "published_time": "2025-11-04 00:48:56",
    "download_time": "2025-11-04 20:01:56",
    "extra_info": "{\"score\": 311, \"by\": \"ani_obsessive\", \"descendants\": 114, \"story_id\": 45806348}"
  },
  {
    "id": "hackernews_45806263",
    "source": "Hacker News",
    "url": "https://drobinin.com/posts/you-cant-curl-a-border/",
    "title": "You can't cURL a Border",
    "summary": "The article, 'You can't cURL a Border,' delves into the inherent limitations of purely digital operations and Artificial Intelligence systems when confronted with complex real-world boundaries. It metaphorically uses the `cURL` command to represent the reach of software and algorithms, contrasting it with the immutable nature of physical, geopolitical, and regulatory 'borders.' The piece likely explores the challenges AI faces in scenarios requiring interaction across national sovereignties, data privacy jurisdictions, or physical obstacles. It highlights how despite advanced computational power and global connectivity, AI applications are often constrained by non-digital realities, such as legal frameworks governing data flow, ethical considerations in cross-border deployments, or the practical impossibility of software altering physical geography. This analysis is critical for developers and policymakers navigating the complexities of deploying AI solutions in a globally interconnected yet physically fragmented world, underscoring the necessity for hybrid approaches that blend technological innovation with a deep understanding of real-world governance and physical constraints.",
    "keywords": [
      "AI Limitations",
      "Data Sovereignty",
      "Geopolitical AI",
      "Cross-Border Data",
      "Digital Governance",
      "cURL"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2025-11-04 00:37:14",
    "download_time": "2025-11-04 20:02:03",
    "extra_info": "{\"score\": 410, \"by\": \"valzevul\", \"descendants\": 218, \"story_id\": 45806263}"
  },
  {
    "id": "Weibo_PublicOpinion_AnalysisSystem",
    "source": "GitHub",
    "url": "https://github.com/666ghj/Weibo_PublicOpinion_AnalysisSystem",
    "title": "微舆 - 多智能体舆情分析系统",
    "summary": "The \"Weibo Public Opinion Analysis System\" (微舆, also known as BettaFish) is an innovative multi-agent system designed to analyze public sentiment and trends across various social media platforms. It leverages AI-driven crawling clusters for 24/7 monitoring, covering over 10 domestic and international platforms like Weibo, Xiaohongshu, and Douyin, capturing both trending content and extensive user comments. The system features a sophisticated composite analysis engine that integrates five types of specialized agents with fine-tuned and statistical models, ensuring deep, accurate, and multi-dimensional insights. It boasts powerful multi-modal capabilities, including analysis of short video content and extraction of structured information from search engines. A unique \"Agent Forum\" collaboration mechanism enables agents to debate and refine analyses, fostering collective intelligence. The platform also supports seamless integration of public and private domain data. Built on a lightweight, extensible Python framework, it offers one-click deployment and high customizability, aiming to serve as a versatile data analysis engine beyond public opinion, applicable to various business scenarios.",
    "keywords": [
      "Multi-agent System",
      "Public Opinion Analysis",
      "Social Media Monitoring",
      "AI Crawlers",
      "Multimodal Analysis",
      "Large Language Model",
      "Agent Collaboration",
      "Data Integration"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2025-11-04T16:24:35Z",
    "download_time": "2024-05-15 10:00:00",
    "extra_info": null
  },
  {
    "id": "MaxKB",
    "source": "GitHub",
    "url": "https://github.com/1Panel-dev/MaxKB",
    "title": "Open-source platform for building enterprise-grade agents",
    "summary": "MaxKB (Max Knowledge Brain) is an open-source platform designed for building enterprise-grade AI agents. It integrates robust Retrieval-Augmented Generation (RAG) pipelines, allowing for direct document uploads or automatic crawling of online content, coupled with automatic text splitting and vectorization to minimize large language model hallucinations. The platform features a powerful Agentic Workflow engine, a function library, and MCP tool-use capabilities, enabling the orchestration of complex AI processes for diverse business scenarios. MaxKB supports seamless, zero-coding integration into third-party systems, rapidly equipping existing applications with intelligent Q&A functionalities to enhance user satisfaction. It is model-agnostic, compatible with various private models (DeepSeek, Llama, Qwen) and public models (OpenAI, Claude, Gemini), and offers native multimodal support for text, image, audio, and video input/output. Applications span intelligent customer service, corporate knowledge bases, academic research, and education.",
    "keywords": [
      "AI Agent",
      "RAG Pipeline",
      "Large Language Model",
      "Multimodal AI",
      "Enterprise AI",
      "Vectorization",
      "Workflow Engine",
      "Open-source"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2025-11-04T11:25:56Z",
    "download_time": "2024-07-30 10:00:00",
    "extra_info": null
  },
  {
    "id": "LocalAI",
    "source": "GitHub",
    "url": "https://github.com/mudler/LocalAI",
    "title": "LocalAI",
    "summary": "LocalAI is an open-source, free alternative to OpenAI, providing a REST API compatible with OpenAI specifications for local AI inferencing. It enables users to run Large Language Models (LLMs), generate images, and process audio on consumer-grade hardware, often without requiring a dedicated GPU. The project supports numerous model families and integrates with a \"Local Stack Family\" that includes LocalAGI for agent management and LocalRecall for persistent memory. Key features encompass a backend gallery, P2P inferencing, object detection, reranker API, and a Model Context Protocol for advanced agentic capabilities. It offers extensive hardware acceleration support, including NVIDIA CUDA, AMD ROCm, Intel oneAPI, Apple Metal, and Vulkan, for various AI tasks like text generation, speech processing, and image creation. This makes LocalAI a versatile platform for deploying private, on-premise AI solutions.",
    "keywords": [
      "Local AI",
      "OpenAI API compatible",
      "Large Language Models",
      "Image Generation",
      "Audio Generation",
      "Local Inferencing",
      "GPU Acceleration",
      "AI Agent"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2025-11-04 11:09:28+00:00",
    "download_time": "2024-05-15 12:00:00",
    "extra_info": null
  },
  {
    "id": "nano-vllm",
    "source": "GitHub",
    "url": "https://github.com/GeeeekExplorer/nano-vllm",
    "title": "Nano-vLLM",
    "summary": "Nano-vLLM offers a lightweight yet powerful re-implementation of the vLLM inference engine, meticulously crafted for achieving high-speed offline inference comparable to, or even surpassing, its inspiration. Developed from the ground up with a clean and remarkably concise Python codebase, spanning roughly 1,200 lines, it prioritizes readability without sacrificing performance. A key strength lies in its comprehensive optimization suite, which incorporates crucial techniques such as prefix caching for efficient token reuse, Tensor Parallelism to scale across multiple devices, Torch compilation for accelerated execution, and CUDA graph integration to minimize kernel launch overhead. These optimizations position Nano-vLLM as an excellent choice for developers aiming to deploy large language models with maximum throughput and efficiency, especially in environments where computational resources are a consideration. Furthermore, its transparent design serves as an invaluable resource for researchers and engineers seeking to delve into the core mechanics and advanced optimization strategies behind state-of-the-art LLM inference systems.",
    "keywords": [
      "vLLM",
      "LLM inference",
      "Tensor Parallelism",
      "Prefix Caching",
      "CUDA graph",
      "Deep Learning",
      "Python",
      "Optimization"
    ],
    "area": [
      "Artificial Intelligence",
      "Deep Learning",
      "Large Language Model"
    ],
    "published_time": "2025-11-03 17:44:42+00:00",
    "download_time": "2024-05-15 10:30:00",
    "extra_info": null
  },
  {
    "id": "2510.22115",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2510.22115",
    "title": "Every Activation Boosted: Scaling General Reasoner to 1 Trillion Open Language Foundation",
    "summary": "We introduce Ling 2.0, a series reasoning-oriented language foundation built upon the principle that every activation boosts reasoning capability. Designed to scale from tens of billions to one trillion parameters under a unified Mixture-of-Experts (MoE) paradigm, Ling 2.0 emphasizes high sparsity, cross-scale consistency, and efficiency guided by empirical scaling laws. The series includes three non-thinking (instruct) models - Ling-mini-2.0, Ling-flash-2.0, and Ling-1T - ranging from 16B to 1T total parameters and achieving up to 7-fold active-compute efficiency compared with dense counterparts. Ling 2.0 integrates coordinated innovations across model architecture, pre-training, post-training, and infrastructure: a high-sparsity MoE with MTP for efficient reasoning, reasoning-oriented data and mid-training CoT activation, reinforcement-based fine-tuning (DFT, Evo-CoT), and full-scale FP8 training with fine-grained heterogeneous pipelines. At the trillion scale, Ling-1T establishes a new Pareto frontier of reasoning accuracy versus computational efficiency, demonstrating that sparse activation, when properly aligned with reasoning objectives, enables scalable and efficient intelligence. Collectively, Ling 2.0 provides a coherent, open, and efficient foundation for advancing future reasoning and thinking models, including the Ring series built upon the same base.",
    "keywords": [
      "Ling 2.0",
      "Mixture-of-Experts (MoE)",
      "Reasoning-oriented Language Foundation",
      "Scalable AI",
      "Sparse Activation"
    ],
    "area": [
      "Artificial Intelligence",
      "Deep Learning",
      "Large Language Model"
    ],
    "published_time": "2025-10-25T01:51:37.000Z",
    "download_time": "2025-11-04 12:02:26",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2510.22115\", \"arxiv_url\": \"https://arxiv.org/abs/2510.22115\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2510.22115.png\", \"original_title\": \"Every Activation Boosted: Scaling General Reasoner to 1 Trillion Open\\n  Language Foundation\"}"
  },
  {
    "id": "2511.00279",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.00279",
    "title": "LongCat-Flash-Omni Technical Report",
    "summary": "We introduce LongCat-Flash-Omni, a state-of-the-art open-source omni-modal model with 560 billion parameters, excelling at real-time audio-visual interaction. By adopting a curriculum-inspired progressive training strategy that transitions from simpler to increasingly complex modality sequence modeling tasks, LongCat-Flash-Omni attains comprehensive multimodal capabilities while maintaining strong unimodal capability. Building upon LongCat-Flash, which adopts a high-performance Shortcut-connected Mixture-of-Experts (MoE) architecture with zero-computation experts, LongCat-Flash-Omni integrates efficient multimodal perception and speech reconstruction modules. Despite its immense size of 560B parameters (with 27B activated), LongCat-Flash-Omni achieves low-latency real-time audio-visual interaction. For training infrastructure, we developed a modality-decoupled parallelism scheme specifically designed to manage the data and model heterogeneity inherent in large-scale multimodal training. This innovative approach demonstrates exceptional efficiency by sustaining over 90% of the throughput achieved by text-only training. Extensive evaluations show that LongCat-Flash-Omni achieves state-of-the-art performance on omni-modal benchmarks among open-source models. Furthermore, it delivers highly competitive results across a wide range of modality-specific tasks, including text, image, and video understanding, as well as audio understanding and generation. We provide a comprehensive overview of the model architecture design, training procedures, and data strategies, and open-source the model to foster future research and development in the community.",
    "keywords": [
      "Omni-modal model",
      "Multimodal AI",
      "Mixture-of-Experts",
      "Real-time interaction",
      "Large-scale training"
    ],
    "area": [
      "Multimodal",
      "Deep Learning",
      "Large Language Model"
    ],
    "published_time": "2025-10-31T21:58:15.000Z",
    "download_time": "2025-11-04 12:02:32",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.00279\", \"arxiv_url\": \"https://arxiv.org/abs/2511.00279\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.00279.png\", \"original_title\": \"LongCat-Flash-Omni Technical Report\"}"
  },
  {
    "id": "2511.00062",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.00062",
    "title": "World Simulation with Video Foundation Models for Physical AI",
    "summary": "We introduce [Cosmos-Predict2.5], the latest generation of the Cosmos World Foundation Models for Physical AI. Built on a flow-based architecture, [Cosmos-Predict2.5] unifies Text2World, Image2World, and Video2World generation in a single model and leverages [Cosmos-Reason1], a Physical AI vision-language model, to provide richer text grounding and finer control of world simulation. Trained on 200M curated video clips and refined with reinforcement learning-based post-training, [Cosmos-Predict2.5] achieves substantial improvements over [Cosmos-Predict1] in video quality and instruction alignment, with models released at 2B and 14B scales. These capabilities enable more reliable synthetic data generation, policy evaluation, and closed-loop simulation for robotics and autonomous systems. We further extend the family with [Cosmos-Transfer2.5], a control-net style framework for Sim2Real and Real2Real world translation. Despite being 3.5times smaller than [Cosmos-Transfer1], it delivers higher fidelity and robust long-horizon video generation. Together, these advances establish [Cosmos-Predict2.5] and [Cosmos-Transfer2.5] as versatile tools for scaling embodied intelligence. To accelerate research and deployment in Physical AI, we release source code, pretrained checkpoints, and curated benchmarks under the NVIDIA Open Model License at https://github.com/nvidia-cosmos/cosmos-predict2.5 and https://github.com/nvidia-cosmos/cosmos-transfer2.5. We hope these open resources lower the barrier to adoption and foster innovation in building the next generation of embodied intelligence.",
    "keywords": [
      "Physical AI",
      "World Simulation",
      "Video Foundation Models",
      "Generative AI",
      "Robotics"
    ],
    "area": [
      "Robotics",
      "Generative AI",
      "Multimodal"
    ],
    "published_time": "2025-10-28T22:44:13.000Z",
    "download_time": "2025-11-04 12:02:34",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.00062\", \"arxiv_url\": \"https://arxiv.org/abs/2511.00062\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.00062.png\", \"original_title\": \"World Simulation with Video Foundation Models for Physical AI\"}"
  },
  {
    "id": "2511.01718",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.01718",
    "title": "Unified Diffusion VLA: Vision-Language-Action Model via Joint Discrete Denoising Diffusion Process",
    "summary": "Vision-language-action (VLA) models aim to understand natural language instructions and visual observations and to execute corresponding actions as an embodied agent. Recent work integrates future images into the understanding-acting loop, yielding unified VLAs that jointly understand, generate, and act -- reading text and images and producing future images and actions. However, these models either rely on external experts for modality unification or treat image generation and action prediction as separate processes, limiting the benefits of direct synergy between these tasks. Our core philosophy is to optimize generation and action jointly through a synchronous denoising process, where the iterative refinement enables actions to evolve from initialization, under constant and sufficient visual guidance. We ground this philosophy in our proposed Unified Diffusion VLA and Joint Discrete Denoising Diffusion Process (JD3P), which is a joint diffusion process that integrates multiple modalities into a single denoising trajectory to serve as the key mechanism enabling understanding, generation, and acting to be intrinsically synergistic. Our model and theory are built on a unified tokenized space of all modalities and a hybrid attention mechanism. We further propose a two-stage training pipeline and several inference-time techniques that optimize performance and efficiency. Our approach achieves state-of-the-art performance on benchmarks such as CALVIN, LIBERO, and SimplerEnv with 4times faster inference than autoregressive methods, and we demonstrate its effectiveness through in-depth analysis and real-world evaluations. Our project page is available at https://irpn-eai.github.io/UD-VLA.github.io/.",
    "keywords": [
      "Vision-Language-Action (VLA)",
      "Diffusion Models",
      "Multimodal",
      "Embodied AI",
      "Robotics"
    ],
    "area": [
      "Multimodal",
      "Robotics",
      "Generative AI"
    ],
    "published_time": "2025-11-03T16:26:54.000Z",
    "download_time": "2025-11-04 12:02:28",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.01718\", \"arxiv_url\": \"https://arxiv.org/abs/2511.01718\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.01718.png\", \"original_title\": \"Unified Diffusion VLA: Vision-Language-Action Model via Joint Discrete\\n  Denoising Diffusion Process\"}"
  },
  {
    "id": "2511.01266",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.01266",
    "title": "MotionStream: Real-Time Video Generation with Interactive Motion Controls",
    "summary": "Current motion-conditioned video generation methods suffer from prohibitive latency (minutes per video) and non-causal processing that prevents real-time interaction. We present MotionStream, enabling sub-second latency with up to 29 FPS streaming generation on a single GPU. Our approach begins by augmenting a text-to-video model with motion control, which generates high-quality videos that adhere to the global text prompt and local motion guidance, but does not perform inference on the fly. As such, we distill this bidirectional teacher into a causal student through Self Forcing with Distribution Matching Distillation, enabling real-time streaming inference. Several key challenges arise when generating videos of long, potentially infinite time-horizons: (1) bridging the domain gap from training on finite length and extrapolating to infinite horizons, (2) sustaining high quality by preventing error accumulation, and (3) maintaining fast inference, without incurring growth in computational cost due to increasing context windows. A key to our approach is introducing carefully designed sliding-window causal attention, combined with attention sinks. By incorporating self-rollout with attention sinks and KV cache rolling during training, we properly simulate inference-time extrapolations with a fixed context window, enabling constant-speed generation of arbitrarily long videos. Our models achieve state-of-the-art results in motion following and video quality while being two orders of magnitude faster, uniquely enabling infinite-length streaming. With MotionStream, users can paint trajectories, control cameras, or transfer motion, and see results unfold in real-time, delivering a truly interactive experience.",
    "keywords": [
      "MotionStream",
      "Real-Time Video Generation",
      "Interactive Motion Control",
      "Streaming Inference",
      "Causal Attention"
    ],
    "area": [
      "Deep Learning",
      "Computer Vision",
      "Generative AI"
    ],
    "published_time": "2025-11-03T06:37:53.000Z",
    "download_time": "2025-11-04 12:02:29",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.01266\", \"arxiv_url\": \"https://arxiv.org/abs/2511.01266\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.01266.png\", \"original_title\": \"MotionStream: Real-Time Video Generation with Interactive Motion\\n  Controls\"}"
  },
  {
    "id": "2511.00602",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.00602",
    "title": "OpenSIR: Open-Ended Self-Improving Reasoner",
    "summary": "Recent advances in large language model (LLM) reasoning through reinforcement learning rely on annotated datasets for verifiable rewards, which may limit models' ability to surpass human-level performance. While self-play offers a promising alternative, existing approaches depend on external verifiers or cannot learn open-endedly. We present Open-Ended Self-Improving Reasoner (OpenSIR), a self-play framework where an LLM learns to generate and solve novel problems by alternating teacher and student roles without external supervision. To generate novel problems, OpenSIR optimises for both difficulty and diversity, rewarding problems that challenge appropriately while exploring distinct concepts, enabling open-ended mathematical discovery. Starting from a single trivial seed problem, OpenSIR substantially improves instruction models: Llama-3.2-3B-Instruct advances from 73.9 to 78.3 on GSM8K, and from 28.8 to 34.4 on College Math, while Gemma-2-2B-Instruct rises from 38.5 to 58.7 on GSM8K. Our analyses reveal that OpenSIR achieves open-ended learning through co-evolving teacher-student roles that adaptively calibrate difficulty and drive diverse exploration, progressing autonomously from basic to advanced mathematics.",
    "keywords": [
      "Open-Ended Learning",
      "Self-Improving Reasoner",
      "Large Language Model",
      "Self-Play",
      "Mathematical Reasoning"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-01T16:08:28.000Z",
    "download_time": "2025-11-04 12:02:27",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.00602\", \"arxiv_url\": \"https://arxiv.org/abs/2511.00602\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.00602.png\", \"original_title\": \"OpenSIR: Open-Ended Self-Improving Reasoner\"}"
  }
]