[
  {
    "id": "hackernews_45954640",
    "source": "Hacker News",
    "url": "https://geminiprotocol.net/",
    "title": "Project Gemini",
    "summary": "Project Gemini represents Google's ambitious and sophisticated multimodal artificial intelligence model, developed by Google DeepMind. Engineered from the ground up to be natively multimodal, Gemini demonstrates a profound capability to seamlessly understand, operate on, and combine information across diverse modalities, including text, code, audio, imagery, and video. This strategic design allows Gemini to tackle complex tasks that require integrated reasoning across different data types, setting a new benchmark for AI versatility. The model is offered in various sizes, ranging from Gemini Ultra, tailored for highly complex and demanding applications, to Gemini Nano, optimized for efficient on-device deployment, and Gemini Pro, designed for broad scalability and enterprise use. This comprehensive family of models underscores Google's significant investment in pushing the frontiers of AI research and development, aiming to create more capable, adaptable, and intuitive AI systems that can compete at the highest level within the rapidly evolving landscape of artificial intelligence.",
    "keywords": [
      "Google Gemini",
      "Multimodal AI",
      "Large Language Model",
      "AI Research",
      "Generative AI",
      "AI Capabilities"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Multimodal"
    ],
    "published_time": "2025-11-17 15:50:04",
    "download_time": "2025-11-17 20:02:15",
    "extra_info": "{\"score\": 118, \"by\": \"andsoitis\", \"descendants\": 81, \"story_id\": 45954640}"
  },
  {
    "id": "hackernews_45953702",
    "source": "Hacker News",
    "url": "https://replicate.com/blog/replicate-cloudflare",
    "title": "Replicate is joining Cloudflare",
    "summary": "Replicate, a prominent platform specializing in the deployment and hosting of machine learning models via API, has announced its acquisition by Cloudflare, a leading provider of internet infrastructure, security, and edge computing services. This strategic move is poised to significantly enhance Cloudflare's capabilities in the artificial intelligence domain, particularly concerning AI inference and model serving at the edge. By integrating Replicate's expertise in easily running and scaling open-source machine learning models with Cloudflare's extensive global network and advanced edge computing infrastructure, the combined entity aims to offer developers a more robust, faster, and globally distributed solution for deploying sophisticated AI applications. This acquisition could accelerate the adoption of AI-driven services by providing a seamless experience for developers looking to operationalize their models with improved performance, reduced latency, and enhanced security, leveraging Cloudflare's existing developer ecosystem and serverless offerings. The integration is expected to foster innovation in edge AI and bring advanced machine learning capabilities closer to end-users globally.",
    "keywords": [
      "Machine Learning",
      "AI Deployment",
      "Edge Computing",
      "Cloud Infrastructure",
      "AI Inference"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Generative AI"
    ],
    "published_time": "2025-11-17 14:11:57",
    "download_time": "2025-11-17 20:02:42",
    "extra_info": "{\"score\": 227, \"by\": \"bfirsh\", \"descendants\": 52, \"story_id\": 45953702}"
  },
  {
    "id": "TrendRadar",
    "source": "GitHub",
    "url": "https://github.com/sansan0/TrendRadar",
    "title": "TrendRadar",
    "summary": "TrendRadar is a lightweight and easily deployable hot news assistant designed to aggregate and filter information from multiple online platforms. It aims to eliminate information overload by providing personalized news feeds based on user-defined keywords and intelligent push strategies. Key features include aggregation from 11+ mainstream platforms (e.g., Zhihu, Douyin, Weibo, Baidu), three distinct push modes (daily summary, current ranking, incremental monitoring), and precise content filtering using ordinary, mandatory, and exclusion keywords. The system employs a personalized hotness algorithm that prioritizes high-ranking news, consistent topics, and ranking quality for reordering aggregated content. It supports multi-channel real-time notifications via platforms like WeChat Work, Feishu, DingTalk, Telegram, Email, and ntfy. A significant addition in v3.0.0 is AI intelligent analysis, leveraging the Model Context Protocol (MCP) for natural language querying and deep data insights, including trend tracking, cross-platform data comparison, and smart summarization. The project emphasizes zero-threshold deployment via GitHub Pages and Docker, offering multi-device adaptation and data persistence, catering to investors, self-media professionals, and general users seeking to proactively control their news consumption.",
    "keywords": [
      "Hot News Aggregation",
      "Content Filtering",
      "AI Analysis",
      "Multi-channel Notification",
      "Docker Deployment",
      "Trend Analysis",
      "Keyword Monitoring",
      "Model Context Protocol"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Others"
    ],
    "published_time": "2025-11-16T08:35:44Z",
    "download_time": "2024-05-16 12:00:00",
    "extra_info": null
  },
  {
    "id": "adk-go",
    "source": "GitHub",
    "url": "https://github.com/google/adk-go",
    "title": "Agent Development Kit (ADK) for Go",
    "summary": "The Agent Development Kit (ADK) for Go is an open-source, code-first toolkit designed to streamline the building, evaluation, and deployment of sophisticated AI agents. It applies software development principles to AI agent creation, offering a flexible and modular framework for orchestrating agent workflows from simple tasks to complex systems. While optimized for Gemini, ADK is model and deployment-agnostic, ensuring broad compatibility. This Go-specific version capitalizes on Go's strengths in concurrency and performance, making it ideal for developing cloud-native agent applications. Key features include an idiomatic Go design, a rich ecosystem for integrating diverse tools, and code-first development for enhanced flexibility and testability. It supports the creation of modular multi-agent systems and robust deployment, especially for cloud-native platforms like Google Cloud Run, empowering developers to build scalable and controllable AI solutions.",
    "keywords": [
      "AI Agent",
      "Go Programming",
      "Agent Development Kit",
      "Cloud-Native",
      "Multi-Agent Systems",
      "Code-First Development",
      "Machine Learning Framework"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-14T16:18:14Z",
    "download_time": "2024-05-16 10:00:00",
    "extra_info": null
  },
  {
    "id": "cursor-free-vip",
    "source": "GitHub",
    "url": "https://github.com/yeongpin/cursor-free-vip",
    "title": "\n Cursor Free VIP",
    "summary": "Cursor Free VIP is an open-source tool designed to enhance the functionality and accessibility of the Cursor AI code editor across Windows, macOS, and Linux operating systems. Positioned for educational and research use, it offers features such as resetting Cursor's configuration, multi-language support (English, Simplified Chinese, Traditional Chinese, Vietnamese), and automated installation via shell and PowerShell scripts. The tool provides extensive configuration options, allowing users to customize parameters related to browser paths, captcha handling, storage locations for Cursor's data (like storage.json, state.vscdb, machineId), and various timing settings for operations. It also includes experimental support for temporary email services for verification purposes, though explicitly states it does not generate fake email accounts or OAuth access. Emphasizing optimal performance when run with administrative privileges, Cursor Free VIP aims to provide 'VIP' features to users while encouraging support for the original Cursor project.",
    "keywords": [
      "Cursor AI",
      "Code Editor",
      "Automation Script",
      "System Utility",
      "Multi-platform Support",
      "Configuration Management",
      "Productivity Tool"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2025-09-16T03:47:39Z",
    "download_time": "2024-05-18 10:19:00",
    "extra_info": null
  },
  {
    "id": "2511.11519",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.11519",
    "title": "Experience-Guided Adaptation of Inference-Time Reasoning Strategies",
    "summary": "Enabling agentic AI systems to adapt their problem-solving approaches based on post-training interactions remains a fundamental challenge. While systems that update and maintain a memory at inference time have been proposed, existing designs only steer the system by modifying textual input to a language model or agent, which means that they cannot change sampling parameters, remove tools, modify system prompts, or switch between agentic and workflow paradigms. On the other hand, systems that adapt more flexibly require offline optimization and remain static once deployed. We present Experience-Guided Reasoner (EGuR), which generates tailored strategies -- complete computational procedures involving LLM calls, tools, sampling parameters, and control logic -- dynamically at inference time based on accumulated experience. We achieve this using an LLM-based meta-strategy -- a strategy that outputs strategies -- enabling adaptation of all strategy components (prompts, sampling parameters, tool configurations, and control logic). EGuR operates through two components: a Guide generates multiple candidate strategies conditioned on the current problem and structured memory of past experiences, while a Consolidator integrates execution feedback to improve future strategy generation. This produces complete, ready-to-run strategies optimized for each problem, which can be cached, retrieved, and executed as needed without wasting resources. Across five challenging benchmarks (AIME 2025, 3-SAT, and three Big Bench Extra Hard tasks), EGuR achieves up to 14% accuracy improvements over the strongest baselines while reducing computational costs by up to 111x, with both metrics improving as the system gains experience.",
    "keywords": [
      "Inference-Time Reasoning",
      "Agentic AI Systems",
      "LLM-based Meta-Strategy",
      "Adaptive Problem Solving",
      "Experience-Guided Learning"
    ],
    "area": [
      "AI Agent",
      "Large Language Model",
      "Artificial Intelligence"
    ],
    "published_time": "2025-11-14T17:45:28.000Z",
    "download_time": "2025-11-17 12:03:12",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.11519\", \"arxiv_url\": \"https://arxiv.org/abs/2511.11519\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.11519.png\", \"original_title\": \"Experience-Guided Adaptation of Inference-Time Reasoning Strategies\"}"
  },
  {
    "id": "2511.11373",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.11373",
    "title": "MarsRL: Advancing Multi-Agent Reasoning System via Reinforcement Learning with Agentic Pipeline Parallelism",
    "summary": "Recent progress in large language models (LLMs) has been propelled by reinforcement learning with verifiable rewards (RLVR) and test-time scaling. However, the limited output length of LLMs constrains the depth of reasoning attainable in a single inference process. Multi-agent reasoning systems offer a promising alternative by employing multiple agents including Solver, Verifier, and Corrector, to iteratively refine solutions. While effective in closed-source models like Gemini 2.5 Pro, they struggle to generalize to open-source models due to insufficient critic and correction capabilities. To address this, we propose MarsRL, a novel reinforcement learning framework with agentic pipeline parallelism, designed to jointly optimize all agents in the system. MarsRL introduces agent-specific reward mechanisms to mitigate reward noise and employs pipeline-inspired training to enhance efficiency in handling long trajectories. Applied to Qwen3-30B-A3B-Thinking-2507, MarsRL improves AIME2025 accuracy from 86.5% to 93.3% and BeyondAIME from 64.9% to 73.8%, even surpassing Qwen3-235B-A22B-Thinking-2507. These findings highlight the potential of MarsRL to advance multi-agent reasoning systems and broaden their applicability across diverse reasoning tasks.",
    "keywords": [
      "Reinforcement Learning",
      "Multi-Agent Reasoning Systems",
      "Large Language Models",
      "Agentic Pipeline Parallelism",
      "Reasoning Tasks"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-14T14:52:34.000Z",
    "download_time": "2025-11-17 12:03:14",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.11373\", \"arxiv_url\": \"https://arxiv.org/abs/2511.11373\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.11373.png\", \"original_title\": \"MarsRL: Advancing Multi-Agent Reasoning System via Reinforcement Learning with Agentic Pipeline Parallelism\"}"
  },
  {
    "id": "2511.11287",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.11287",
    "title": "Building the Web for Agents: A Declarative Framework for Agent-Web Interaction",
    "summary": "The increasing deployment of autonomous AI agents on the web is hampered by a fundamental misalignment: agents must infer affordances from human-oriented user interfaces, leading to brittle, inefficient, and insecure interactions. To address this, we introduce VOIX, a web-native framework that enables websites to expose reliable, auditable, and privacy-preserving capabilities for AI agents through simple, declarative HTML elements. VOIX introduces <tool> and <context> tags, allowing developers to explicitly define available actions and relevant state, thereby creating a clear, machine-readable contract for agent behavior. This approach shifts control to the website developer while preserving user privacy by disconnecting the conversational interactions from the website. We evaluated the framework's practicality, learnability, and expressiveness in a three-day hackathon study with 16 developers. The results demonstrate that participants, regardless of prior experience, were able to rapidly build diverse and functional agent-enabled web applications. Ultimately, this work provides a foundational mechanism for realizing the Agentic Web, enabling a future of seamless and secure human-AI collaboration on the web.",
    "keywords": [
      "AI Agents",
      "Web Interaction",
      "Declarative Framework",
      "Agentic Web",
      "Human-AI Collaboration"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Large Language Model"
    ],
    "published_time": "2025-11-14T13:23:34.000Z",
    "download_time": "2025-11-17 12:03:27",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.11287\", \"arxiv_url\": \"https://arxiv.org/abs/2511.11287\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.11287.png\", \"original_title\": \"Building the Web for Agents: A Declarative Framework for Agent-Web Interaction\"}"
  },
  {
    "id": "2511.08195",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.08195",
    "title": "UI2Code^N: A Visual Language Model for Test-Time Scalable Interactive UI-to-Code Generation",
    "summary": "User interface (UI) programming is a core yet highly complex part of modern software development. Recent advances in visual language models (VLMs) highlight the potential of automatic UI coding, but current approaches face two key limitations: multimodal coding capabilities remain underdeveloped, and single-turn paradigms make little use of iterative visual feedback. We address these challenges with an interactive UI-to-code paradigm that better reflects real-world workflows and raises the upper bound of achievable performance. Under this paradigm, we present UI2Code^N, a visual language model trained through staged pretraining, fine-tuning, and reinforcement learning to achieve foundational improvements in multimodal coding. The model unifies three key capabilities: UI-to-code generation, UI editing, and UI polishing. We further explore test-time scaling for interactive generation, enabling systematic use of multi-turn feedback. Experiments on UI-to-code and UI polishing benchmarks show that UI2Code^N establishes a new state of the art among open-source models and achieves performance comparable to leading closed-source models such as Claude-4-Sonnet and GPT-5. Our code and models are available at https://github.com/zai-org/UI2Code_N.",
    "keywords": [
      "UI-to-Code Generation",
      "Visual Language Models",
      "Multimodal Coding",
      "Interactive UI",
      "Reinforcement Learning"
    ],
    "area": [
      "Multimodal",
      "Generative AI",
      "Large Language Model"
    ],
    "published_time": "2025-11-11T13:00:09.000Z",
    "download_time": "2025-11-17 12:03:12",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.08195\", \"arxiv_url\": \"https://arxiv.org/abs/2511.08195\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.08195.png\", \"original_title\": \"UI2Code^N: A Visual Language Model for Test-Time Scalable Interactive UI-to-Code Generation\"}"
  },
  {
    "id": "2511.11062",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.11062",
    "title": "LiteAttention: A Temporal Sparse Attention for Diffusion Transformers",
    "summary": "Diffusion Transformers, particularly for video generation, achieve remarkable quality but suffer from quadratic attention complexity, leading to prohibitive latency. Existing acceleration methods face a fundamental trade-off: dynamically estimating sparse attention patterns at each denoising step incurs high computational overhead and estimation errors, while static sparsity patterns remain fixed and often suboptimal throughout denoising. We identify a key structural property of diffusion attention, namely, its sparsity patterns exhibit strong temporal coherence across denoising steps. Tiles deemed non-essential at step t typically remain so at step t+δ. Leveraging this observation, we introduce LiteAttention, a method that exploits temporal coherence to enable evolutionary computation skips across the denoising sequence. By marking non-essential tiles early and propagating skip decisions forward, LiteAttention eliminates redundant attention computations without repeated profiling overheads, combining the adaptivity of dynamic methods with the efficiency of static ones. We implement a highly optimized LiteAttention kernel on top of FlashAttention and demonstrate substantial speedups on production video diffusion models, with no degradation in quality. The code and implementation details will be publicly released.",
    "keywords": [
      "Diffusion Transformers",
      "Temporal Sparse Attention",
      "Video Generation",
      "Attention Complexity",
      "Sparsity Patterns"
    ],
    "area": [
      "Deep Learning",
      "Generative AI",
      "Computer Vision"
    ],
    "published_time": "2025-11-14T08:26:55.000Z",
    "download_time": "2025-11-17 12:03:11",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.11062\", \"arxiv_url\": \"https://arxiv.org/abs/2511.11062\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.11062.png\", \"original_title\": \"LiteAttention: A Temporal Sparse Attention for Diffusion Transformers\"}"
  },
  {
    "id": "2511.09146",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.09146",
    "title": "DoPE: Denoising Rotary Position Embedding",
    "summary": "Rotary Position Embedding (RoPE) in Transformer models has inherent limits that weaken length extrapolation. We reinterpret the attention map with positional encoding as a noisy feature map, and propose Denoising Positional Encoding (DoPE), a training-free method based on truncated matrix entropy to detect outlier frequency bands in the feature map. Leveraging the noise characteristics of the feature map, we further reparameterize it with a parameter-free Gaussian distribution to achieve robust extrapolation. Our method theoretically reveals the underlying cause of the attention sink phenomenon and its connection to truncated matrix entropy. Experiments on needle-in-a-haystack and many-shot in-context learning tasks demonstrate that DoPE significantly improves retrieval accuracy and reasoning stability across extended contexts (up to 64K tokens). The results show that the denoising strategy for positional embeddings effectively mitigates attention sinks and restores balanced attention patterns, providing a simple yet powerful solution for improving length generalization. Our project page is Project: https://The-physical-picture-of-LLMs.github.io",
    "keywords": [
      "Denoising Positional Encoding",
      "Rotary Position Embedding",
      "Transformer Models",
      "Length Generalization",
      "Attention Sink Phenomenon"
    ],
    "area": [
      "Large Language Model",
      "Natural Language Processing",
      "Deep Learning"
    ],
    "published_time": "2025-11-12T09:32:35.000Z",
    "download_time": "2025-11-17 12:03:12",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.09146\", \"arxiv_url\": \"https://arxiv.org/abs/2511.09146\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.09146.png\", \"original_title\": \"DoPE: Denoising Rotary Position Embedding\"}"
  }
]