[
  {
    "id": "hackernews_45238055",
    "source": "Hacker News",
    "url": "http://stations.albertguillaumes.cat/",
    "title": "Models of European Metro Stations",
    "summary": "The Hacker News story, titled \"Models of European Metro Stations,\" highlights an online project accessible via stations.albertguillaumes.cat, which curates a visual collection of metro station designs from across Europe. While the immediate presentation is an archive of architectural models or photographs, this initiative presents considerable opportunities for exploration within the realm of artificial intelligence. Such a comprehensive and geographically diverse visual dataset could prove invaluable for training sophisticated computer vision models, enabling automated tasks such as architectural style classification, precise infrastructure component recognition, and the identification of design patterns or anomalies within urban transportation networks. Moreover, the rich variety of designs could serve as a foundational resource for generative AI research, facilitating the development of innovative urban planning concepts, predictive models for public transportation infrastructure, or even virtual environment simulations. This project offers a unique visual repository that, when integrated with advanced machine learning methodologies, could significantly contribute to smart city initiatives, optimize urban design processes, and yield novel insights into the evolution and future optimization of European public transit systems.",
    "keywords": [
      "Computer Vision",
      "Urban Planning",
      "Architectural Design",
      "Generative AI",
      "Image Recognition",
      "Smart Cities",
      "Infrastructure Analysis",
      "Machine Learning Applications"
    ],
    "area": [
      "Computer Vision",
      "Generative AI",
      "Others"
    ],
    "published_time": "2025-09-14 07:00:44",
    "download_time": "2025-09-14 09:04:06",
    "extra_info": "{\"score\": 123, \"by\": \"tcumulus\", \"descendants\": 14, \"story_id\": 45238055}"
  },
  {
    "id": "hackernews_45237754",
    "source": "Hacker News",
    "url": "https://github.com/BICLab/SpikingBrain-7B",
    "title": "SpikingBrain 7B – More efficient than classic LLMs",
    "summary": "A novel AI model, SpikingBrain 7B, has been unveiled, asserting significantly higher efficiency compared to conventional Large Language Models (LLMs). This innovation represents a notable stride in artificial intelligence, specifically targeting the optimization of computational and energy resources crucial for advanced language processing. The project, accessible via GitHub, highlights an approach centered on Spiking Neural Networks (SNNs). SNNs are biologically inspired neural networks that process information through discrete temporal events, or 'spikes,' rather than continuous activations. This paradigm shift often translates into reduced power consumption and accelerated inference, making them particularly attractive for resource-constrained environments. The emergence of SpikingBrain 7B could catalyze the development of more sustainable and widely deployable AI applications, offering a potential solution to the escalating energy footprint associated with increasingly complex AI models. Its architecture suggests a promising direction for future efficient AI research and deployment.",
    "keywords": [
      "Spiking Neural Networks",
      "Large Language Models",
      "AI Efficiency",
      "Neural Networks",
      "Computational Resources",
      "AI Models"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Large Language Model"
    ],
    "published_time": "2025-09-14 05:49:42",
    "download_time": "2025-09-14 09:03:56",
    "extra_info": "{\"score\": 5, \"by\": \"somethingsome\", \"descendants\": 1, \"story_id\": 45237754}"
  },
  {
    "id": "hackernews_45236890",
    "source": "Hacker News",
    "url": "https://caseyhandmer.wordpress.com/2025/09/13/how-to-get-samples-back-from-mars/",
    "title": "How to get samples back from Mars",
    "summary": "The prospect of returning Martian samples to Earth represents a monumental undertaking in space exploration, promising unprecedented scientific insights into the Red Planet's geological history, potential for past or present life, and planetary evolution. This complex endeavor, often envisioned as a multi-stage mission, involves critical phases such as precise sample collection by advanced robotic rovers like Perseverance, followed by the transfer of these precious materials to a Mars Ascent Vehicle (MAV). The MAV would then launch the samples into Mars orbit, where an Earth Return Orbiter (ERO) would rendezvous and capture the sample container. The final leg involves the ERO transporting the samples back to Earth, culminating in a controlled re-entry and landing of a Sample Return Capsule (SRC). Significant challenges include developing robust autonomous systems for extreme environments, ensuring planetary protection to prevent contamination of Earth by Martian materials and vice-versa, and managing the intricate logistics of interplanetary travel and orbital maneuvers. Success in this mission would revolutionize astrobiology and planetary science, providing direct evidence crucial for understanding the origins of life and informing future human missions to Mars.",
    "keywords": [
      "Mars Sample Return",
      "Space Exploration",
      "Planetary Science",
      "Astrobiology",
      "Mars Ascent Vehicle (MAV)",
      "Earth Return Orbiter (ERO)",
      "Planetary Protection",
      "Robotic Spacecraft"
    ],
    "area": [
      "Robotics",
      "AI Agent",
      "Artificial Intelligence"
    ],
    "published_time": "2025-09-14 02:17:17",
    "download_time": "2025-09-14 09:04:04",
    "extra_info": "{\"score\": 12, \"by\": \"surprisetalk\", \"descendants\": 4, \"story_id\": 45236890}"
  },
  {
    "id": "hackernews_45236858",
    "source": "Hacker News",
    "url": "https://dickenscode.org/",
    "title": "Can you help us crack the Dickens Code?",
    "summary": "The 'Dickens Code' project is an open call for assistance in deciphering a complex historical puzzle, specifically related to the writings of Charles Dickens. This initiative likely involves analyzing obscure or encrypted texts, such as Dickens's personal shorthand, to uncover previously unknown information or insights into his life and work. The challenge requires sophisticated pattern recognition and linguistic analysis, making it a compelling problem for computational approaches. While rooted in historical research, the task of 'cracking the code' could benefit significantly from modern analytical tools. Researchers might explore methodologies from natural language processing to identify recurring patterns, machine learning algorithms for character recognition in historical scripts, or even advanced cryptographic techniques adapted for linguistic puzzles. The project aims to leverage collective intelligence and potentially cutting-edge computational methods to solve a long-standing literary mystery, offering a unique intersection of humanities and data science.",
    "keywords": [
      "Natural Language Processing",
      "Machine Learning",
      "Pattern Recognition",
      "Computational Linguistics",
      "Historical Text Analysis",
      "Code Breaking",
      "Data Analysis"
    ],
    "area": [
      "Natural Language Processing",
      "Machine Learning",
      "Artificial Intelligence"
    ],
    "published_time": "2025-09-14 02:11:16",
    "download_time": "2025-09-14 09:04:13",
    "extra_info": "{\"score\": 6, \"by\": \"surprisetalk\", \"descendants\": 0, \"story_id\": 45236858}"
  },
  {
    "id": "github_deepseek-ai_DeepSeek-V3",
    "source": "GitHub",
    "url": "https://github.com/deepseek-ai/DeepSeek-V3",
    "title": "DeepSeek-V3",
    "summary": "DeepSeek-V3 is a state-of-the-art large language model developed by DeepSeek AI, representing a significant leap in artificial intelligence capabilities. Positioned for broad accessibility, as evidenced by its presence on Hugging Face and a dedicated chat platform, the model is designed to empower both academic research and practical industrial applications. DeepSeek-V3 is engineered with advanced architectural innovations and trained on extensive, diverse datasets, enabling it to excel in a wide spectrum of natural language processing tasks. Its core functionalities encompass sophisticated text generation, nuanced comprehension, efficient summarization, and highly engaging conversational abilities. These features make it an invaluable tool for developing intelligent agents, enhancing human-computer interaction, automating complex content creation workflows, and facilitating data analysis. DeepSeek-V3's introduction underscores DeepSeek AI's commitment to delivering powerful, accessible AI technologies, driving innovation and expanding the frontiers of what is possible with large language models across various domains.",
    "keywords": [
      "Large Language Model",
      "Deep Learning",
      "Natural Language Processing",
      "Generative AI",
      "Artificial Intelligence",
      "AI Model"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Deep Learning"
    ],
    "published_time": "2025-08-28T03:24:26Z",
    "download_time": "2025-09-14 09:03:21",
    "extra_info": "{\"stars\": 99244, \"forks\": 16194, \"language\": \"Python\", \"description\": null, \"topics\": []}"
  },
  {
    "id": "github_modelcontextprotocol_servers",
    "source": "GitHub",
    "url": "https://github.com/modelcontextprotocol/servers",
    "title": "Model Context Protocol servers",
    "summary": "This GitHub repository provides a comprehensive collection of reference implementations for the Model Context Protocol (MCP), an innovative open standard. MCP is specifically designed to empower Large Language Models (LLMs) by granting them secure, controlled, and structured access to a wide array of external tools and data sources. The project effectively demonstrates the protocol's inherent versatility and extensibility through diverse server implementations, each typically built using a dedicated MCP Software Development Kit (SDK). The repository highlights SDKs available for popular programming languages such as C#, Go, Java, Kotlin, PHP, Python, Ruby, and Rust. These implementations are crucial for showcasing how developers can seamlessly integrate LLMs with real-world systems, enabling models to perform complex tasks, interact with external services, and retrieve pertinent information in a secure and governed environment. This initiative aims to cultivate a robust ecosystem of MCP-compatible servers, significantly enhancing the practical capabilities and application scope of LLMs by bridging the critical gap between AI models and external operational environments.",
    "keywords": [
      "Model Context Protocol",
      "Large Language Models",
      "LLM",
      "SDK",
      "Reference Implementation",
      "Protocol Servers",
      "Tool Access",
      "Data Access"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Artificial Intelligence"
    ],
    "published_time": "2025-09-14T03:50:46Z",
    "download_time": "2025-09-14 09:03:18",
    "extra_info": "{\"stars\": 67688, \"forks\": 7944, \"language\": \"TypeScript\", \"description\": \"Model Context Protocol Servers\", \"topics\": []}"
  },
  {
    "id": "github_RVC-Boss_GPT-SoVITS",
    "source": "GitHub",
    "url": "https://github.com/RVC-Boss/GPT-SoVITS",
    "title": "GPT-SoVITS-WebUI",
    "summary": "GPT-SoVITS-WebUI presents a robust, web-based solution for few-shot voice conversion and text-to-speech (TTS) synthesis. This project empowers users to generate high-quality speech from text or transform existing voices with remarkable efficiency, requiring only a small amount of input data. Built with Python, supporting versions 3.10 to 3.12, it ensures compatibility and performance. A key feature is its integration with Google Colab for training, significantly lowering the barrier to entry for developing custom voice models. The intuitive WebUI abstracts the underlying deep learning complexities, making advanced voice AI accessible to a wider audience. This tool is ideal for applications in content creation, personalized digital assistants, and accessibility technologies, offering a streamlined workflow for rapid prototyping and deployment of sophisticated voice AI capabilities. Its focus on few-shot learning positions it as a cutting-edge solution in the evolving landscape of generative audio.",
    "keywords": [
      "Voice Conversion",
      "Text-to-Speech",
      "Few-shot Learning",
      "WebUI",
      "Speech Synthesis",
      "Deep Learning",
      "Generative AI",
      "Python"
    ],
    "area": [
      "Artificial Intelligence",
      "Deep Learning",
      "Natural Language Processing"
    ],
    "published_time": "2025-09-10T07:01:04Z",
    "download_time": "2025-09-14 09:03:20",
    "extra_info": "{\"stars\": 50857, \"forks\": 5576, \"language\": \"Python\", \"description\": \"1 min voice data can also be used to train a good TTS model! (few shot voice cloning)\", \"topics\": [\"text-to-speech\", \"tts\", \"vits\", \"voice-clone\", \"voice-cloneai\", \"voice-cloning\"]}"
  },
  {
    "id": "github_xai-org_grok-1",
    "source": "GitHub",
    "url": "https://github.com/xai-org/grok-1",
    "title": "Grok-1",
    "summary": "This repository offers JAX example code designed for loading and executing the Grok-1 open-weights model, a formidable large language model boasting 314 billion parameters. It outlines the necessary steps for users to download the model checkpoint (`ckpt-0`) and run a Python script to perform inference on a test input. Key technical specifications of Grok-1 are detailed, including its Mixture of 8 Experts (MoE) architecture, which employs 2 experts per token, distributed across 64 layers with 48 attention heads. The documentation emphasizes the significant GPU memory required to run such a large model. While the current MoE layer implementation prioritizes correctness validation over efficiency, avoiding custom kernels, this project serves as a crucial resource for developers and researchers aiming to explore and deploy state-of-the-art, large-scale MoE language models within the JAX ecosystem.",
    "keywords": [
      "Grok-1",
      "JAX",
      "Large Language Model",
      "Mixture of Experts",
      "MoE",
      "Deep Learning",
      "Model Inference",
      "Open-weights model"
    ],
    "area": [
      "Large Language Model",
      "Deep Learning",
      "Machine Learning"
    ],
    "published_time": "2024-03-19T15:48:22Z",
    "download_time": "2025-09-14 09:03:26",
    "extra_info": "{\"stars\": 50500, \"forks\": 8365, \"language\": \"Python\", \"description\": \"Grok open release\", \"topics\": []}"
  },
  {
    "id": "github_anthropics_claude-code",
    "source": "GitHub",
    "url": "https://github.com/anthropics/claude-code",
    "title": "Claude Code",
    "summary": "Claude Code is an innovative agentic coding tool developed by Anthropic, engineered to significantly enhance developer productivity and streamline software development workflows. This advanced utility operates seamlessly within the terminal, integrated development environments (IDEs), or directly on GitHub, leveraging sophisticated natural language processing capabilities to deeply understand a project's codebase. It empowers developers to execute a wide array of routine coding tasks, obtain clear and concise explanations for complex code segments, and efficiently manage intricate Git operations—all through intuitive natural language commands. By functioning as an intelligent, context-aware assistant, Claude Code aims to dramatically accelerate development cycles, improve overall code comprehension, and automate repetitive programming efforts, thereby freeing developers to concentrate on more complex problem-solving and creative aspects of software engineering. Its agentic design positions it as a powerful and indispensable asset for modern, efficient coding environments.",
    "keywords": [
      "Agentic Coding Tool",
      "Natural Language Processing",
      "Code Generation",
      "Code Explanation",
      "Git Workflow Automation",
      "Developer Productivity",
      "Terminal Tool",
      "IDE Integration"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Natural Language Processing"
    ],
    "published_time": "2025-09-13T02:26:57Z",
    "download_time": "2025-09-14 09:03:37",
    "extra_info": "{\"stars\": 33334, \"forks\": 2044, \"language\": \"TypeScript\", \"description\": \"Claude Code is an agentic coding tool that lives in your terminal, understands your codebase, and helps you code faster by executing routine tasks, explaining complex code, and handling git workflows - all through natural language commands.\", \"topics\": []}"
  },
  {
    "id": "github_github_github-mcp-server",
    "source": "GitHub",
    "url": "https://github.com/github/github-mcp-server",
    "title": "GitHub MCP Server",
    "summary": "The GitHub MCP Server is an innovative platform designed to bridge AI tools directly with GitHub's ecosystem, empowering AI agents, assistants, and chatbots to interact seamlessly with repositories. It facilitates a wide range of operations through natural language, including reading code, managing issues and pull requests, analyzing codebases, and automating development workflows. Key use cases span comprehensive repository management, allowing AI to browse code, search files, and understand project structures. It also streamlines issue and PR automation, enabling AI to triage bugs, review changes, and maintain project boards. Furthermore, the server offers CI/CD and workflow intelligence by monitoring GitHub Actions, analyzing build failures, and managing releases. Advanced code analysis features include examining security findings and Dependabot alerts, providing deep insights into code patterns. This integration significantly enhances team collaboration by enabling AI-driven access to discussions and notification management, ultimately boosting developer productivity and project efficiency.",
    "keywords": [
      "GitHub",
      "AI Agents",
      "Repository Management",
      "Code Analysis",
      "Workflow Automation",
      "Natural Language Processing",
      "CI/CD",
      "Issue Management"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Natural Language Processing"
    ],
    "published_time": "2025-09-12T14:11:15Z",
    "download_time": "2025-09-14 09:03:46",
    "extra_info": "{\"stars\": 22553, \"forks\": 2511, \"language\": \"Go\", \"description\": \"GitHub's official MCP Server\", \"topics\": [\"github\", \"mcp\", \"mcp-server\"]}"
  },
  {
    "id": "twitter_fchollet_1967022520902840817",
    "source": "Twitter",
    "url": "https://x.com/fchollet/status/1967022520902840817",
    "title": "fchollet_Gemini Overtakes ChatGPT",
    "summary": "A recent retweet highlights a significant development in the AI chatbot landscape, with Google's Gemini reportedly surpassing OpenAI's ChatGPT in terms of top downloads on iOS in the United States. This observation, shared by user RihardJarc and retweeted by fchollet, suggests a potential shift in user preference or market penetration for AI-powered conversational agents. The rapid growth and adoption rates of these advanced AI models are critical indicators of their impact and future trajectory. As Gemini gains traction, it presents a notable challenge to ChatGPT's established position, signaling an increasingly competitive environment within the generative AI sector. This trend warrants close monitoring as it could influence future product development and market strategies for major tech players.",
    "keywords": [
      "Gemini",
      "ChatGPT",
      "iOS Downloads",
      "AI Chatbots",
      "Generative AI"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Tech News"
    ],
    "published_time": "2025-09-14 00:28:09",
    "download_time": "2025-09-14 05:06:53",
    "extra_info": "{\"username\": \"fchollet\", \"tweet_id\": \"1967022520902840817\", \"retweet_count\": 130, \"reply_count\": 86, \"like_count\": 1608, \"quote_count\": 69, \"view_count\": 495741, \"is_reply\": false, \"language\": \"en\", \"bookmark_count\": 163}"
  },
  {
    "id": "twitter_ch402_1967045780797354020",
    "source": "Twitter",
    "url": "https://x.com/ch402/status/1967045780797354020",
    "title": "ch402_Token Recomputation Discussion",
    "summary": "The tweet discusses the mechanistic understanding of how tokens are processed, specifically addressing the concept of tokens not directly originating from previous ones due to recomputation. The author suggests that as long as there is agreement on the underlying mechanisms, the precise origin of individual tokens is less critical. This perspective highlights a focus on the functional and computational aspects of language models, emphasizing shared understanding of their internal processes over strict sequential attribution. The conversation appears to be technical, likely within the domain of natural language processing or artificial intelligence research, where the internal workings of models are a subject of ongoing study and debate.",
    "keywords": [
      "tokens",
      "recomputation",
      "mechanisms",
      "language models",
      "natural language processing"
    ],
    "area": [
      "Artificial Intelligence",
      "Natural Language Processing",
      "Large Language Model"
    ],
    "published_time": "2025-09-14 02:00:34",
    "download_time": "2025-09-14 05:08:37",
    "extra_info": "{\"username\": \"ch402\", \"tweet_id\": \"1967045780797354020\", \"retweet_count\": 0, \"reply_count\": 1, \"like_count\": 1, \"quote_count\": 0, \"view_count\": 29, \"is_reply\": true, \"language\": \"en\", \"bookmark_count\": 0}"
  },
  {
    "id": "twitter_ch402_1967045554724368651",
    "source": "Twitter",
    "url": "https://x.com/ch402/status/1967045554724368651",
    "title": "ch402_Tweet Title",
    "summary": "The tweet discusses the ability to modify activations and consequently change the next line of output, implying a direct relationship between internal model states and generated content. This suggests a level of interpretability or control over AI model behavior, where adjustments to specific parameters or activations can predictably alter the model's subsequent responses. The mention of 'BowsersaurusRex' and 'peterwildeford' indicates a conversation or reference to specific individuals within a technical or research context. The provided URL likely leads to further details or a demonstration of this concept, possibly related to neural network architecture or AI model manipulation.",
    "keywords": [
      "activations",
      "model behavior",
      "AI",
      "neural networks",
      "interpretability"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Research Progress"
    ],
    "published_time": "2025-09-14 01:59:40",
    "download_time": "2025-09-14 05:08:38",
    "extra_info": "{\"username\": \"ch402\", \"tweet_id\": \"1967045554724368651\", \"retweet_count\": 0, \"reply_count\": 1, \"like_count\": 2, \"quote_count\": 0, \"view_count\": 27, \"is_reply\": true, \"language\": \"en\", \"bookmark_count\": 0}"
  },
  {
    "id": "twitter_ch402_1967045380429983876",
    "source": "Twitter",
    "url": "https://x.com/ch402/status/1967045380429983876",
    "title": "ch402_Model Poem Generation",
    "summary": "The user, ch402, is engaging in a discussion with @BowsersaurusRex and @peterwildeford, suggesting a potential misunderstanding in their conversation. To clarify, ch402 proposes a specific mechanistic claim regarding how language models generate poetry. The core of this claim is that during the poem-writing process, the model exhibits activations on tokens located at the end of a line. These activations are posited to represent potential targets or candidates for the completion of the subsequent line, indicating a predictive mechanism at play in the generation of poetic structure and flow. The tweet includes links, likely to further resources or examples supporting this hypothesis.",
    "keywords": [
      "language models",
      "poetry generation",
      "activations",
      "tokens",
      "line completion",
      "mechanistic claim"
    ],
    "area": [
      "Artificial Intelligence",
      "Natural Language Processing",
      "Research Progress"
    ],
    "published_time": "2025-09-14 01:58:59",
    "download_time": "2025-09-14 05:08:39",
    "extra_info": "{\"username\": \"ch402\", \"tweet_id\": \"1967045380429983876\", \"retweet_count\": 0, \"reply_count\": 1, \"like_count\": 1, \"quote_count\": 0, \"view_count\": 29, \"is_reply\": true, \"language\": \"en\", \"bookmark_count\": 0}"
  },
  {
    "id": "twitter_ch402_1967042756418912370",
    "source": "Twitter",
    "url": "https://x.com/ch402/status/1967042756418912370",
    "title": "ch402_Activations Influence",
    "summary": "The tweet discusses the influence of activations on earlier tokens and how this impact propagates to later tokens through Key-Value (KV) pairs. This concept is fundamental in understanding the internal workings of transformer-based models, particularly in the context of Natural Language Processing (NLP) and Large Language Models (LLMs). The interaction between token activations and the KV cache is crucial for maintaining context and generating coherent sequences. Analyzing these dynamics helps in debugging, optimizing model performance, and developing more efficient AI architectures. The question posed suggests a deeper dive into the causal relationships within the model's processing pipeline, highlighting the importance of understanding these mechanisms for advancing AI research and development.",
    "keywords": [
      "Activations",
      "Tokens",
      "Key-Value Cache",
      "Transformer Models",
      "NLP"
    ],
    "area": [
      "Natural Language Processing",
      "Large Language Model",
      "Research Progress"
    ],
    "published_time": "2025-09-14 01:48:33",
    "download_time": "2025-09-14 05:08:40",
    "extra_info": "{\"username\": \"ch402\", \"tweet_id\": \"1967042756418912370\", \"retweet_count\": 0, \"reply_count\": 1, \"like_count\": 1, \"quote_count\": 0, \"view_count\": 22, \"is_reply\": true, \"language\": \"en\", \"bookmark_count\": 0}"
  },
  {
    "id": "twitter_ch402_1967042216477814986",
    "source": "Twitter",
    "url": "https://x.com/ch402/status/1967042216477814986",
    "title": "ch402_Transformer Intro Video",
    "summary": "The tweet recommends a video series as an accessible introduction to understanding transformers, particularly for those curious about the technology. The content suggests that these videos, including follow-ups, offer a clear and easy-to-grasp explanation of transformer models. This is valuable for individuals seeking to learn about the underlying architecture of many modern AI systems, such as those used in natural language processing and other advanced AI applications. The shared link provides direct access to this educational resource, making it convenient for interested users to begin their learning journey into this significant area of artificial intelligence.",
    "keywords": [
      "Transformers",
      "AI",
      "Machine Learning",
      "Deep Learning",
      "NLP"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Natural Language Processing"
    ],
    "published_time": "2025-09-14 01:46:24",
    "download_time": "2025-09-14 05:08:43",
    "extra_info": "{\"username\": \"ch402\", \"tweet_id\": \"1967042216477814986\", \"retweet_count\": 0, \"reply_count\": 1, \"like_count\": 0, \"quote_count\": 0, \"view_count\": 223, \"is_reply\": true, \"language\": \"en\", \"bookmark_count\": 0}"
  }
]