[
  {
    "id": "hackernews_45991738",
    "source": "Hacker News",
    "url": "https://arxiv.org/abs/2511.15304",
    "title": "Adversarial Poetry as a Universal Single-Turn Jailbreak Mechanism in LLMs",
    "summary": "Researchers have introduced a novel method for bypassing the safety mechanisms of Large Language Models (LLMs) through what they term \"adversarial poetry.\" This technique leverages the inherent linguistic flexibility and contextual nuances of poetic structures to create single-turn jailbreak prompts, effectively tricking LLMs into generating responses that would otherwise be blocked due to safety guidelines. Unlike multi-turn attacks or more complex adversarial examples, this approach demonstrates a high degree of universality, working across various LLM architectures and for diverse malicious tasks. The study highlights a critical vulnerability in current LLM alignment and safety training, suggesting that the intricate interplay of language and context in creative forms like poetry can be exploited to circumvent protective filters. This research underscores the ongoing challenge of ensuring robust AI safety and necessitates further investigation into more sophisticated defense mechanisms against such sophisticated linguistic attacks.",
    "keywords": [
      "Adversarial Attacks",
      "Jailbreak",
      "Large Language Models",
      "AI Safety",
      "Natural Language Processing",
      "Vulnerability",
      "Security"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-20 12:01:26",
    "download_time": "2025-11-20 20:02:32",
    "extra_info": "{\"score\": 187, \"by\": \"capgre\", \"descendants\": 109, \"story_id\": 45991738}"
  },
  {
    "id": "hackernews_45993296",
    "source": "Hacker News",
    "url": "https://blog.google/technology/ai/nano-banana-pro/",
    "title": "Nano Banana Pro",
    "summary": "Google has recently indicated a new development with the title 'Nano Banana Pro', appearing on its official technology blog within the artificial intelligence section. While detailed specifications, core functionalities, and intended applications are not yet disclosed in the very brief initial announcement, the project's name provides some intriguing clues. The term 'Nano' typically signifies a focus on compact, highly efficient AI models or hardware designs, suggesting an emphasis on performance optimization for environments with limited computational resources, such as edge devices or mobile platforms. The 'Pro' designation further implies a professional-grade offering, potentially indicating advanced capabilities, enhanced reliability, or suitability for demanding enterprise and developer applications. This move by Google could represent a strategic effort to push the boundaries of on-device AI, foster greater energy efficiency in AI deployments, or enable broader accessibility of sophisticated AI technologies across diverse hardware ecosystems. The AI community awaits further official details to fully understand the scope and implications of 'Nano Banana Pro' in advancing practical AI applications.",
    "keywords": [
      "Edge AI",
      "On-device AI",
      "Efficient AI",
      "Machine Learning",
      "Google AI",
      "Compact AI Models"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Deep Learning"
    ],
    "published_time": "2025-11-20 15:04:23",
    "download_time": "2025-11-20 20:02:30",
    "extra_info": "{\"score\": 561, \"by\": \"meetpateltech\", \"descendants\": 380, \"story_id\": 45993296}"
  },
  {
    "id": "hackernews_45995394",
    "source": "Hacker News",
    "url": "https://news.ycombinator.com/item?id=45995394",
    "title": "Launch HN: Poly (YC S22) – Cursor for Files",
    "summary": "Poly (YC S22) introduces an innovative application designed to revolutionize file management, serving as an intelligent replacement for traditional Finder/File Explorer tools. Positioned as a blend of Dropbox, NotebookLM, and Perplexity, Poly offers advanced natural language search capabilities, allowing users to find content across diverse file types down to specific details like pages, paragraphs, or pixels. A core feature is its integrated AI agent, which can perform a wide array of actions on files, including creation, editing, summarization, research, renaming, moving, tagging, annotating, and organization. This agent extends its intelligence beyond local files, capable of processing information from URLs, YouTube links, and even conducting web searches, enabling comprehensive file and knowledge management automation. Poly aims to provide a more intuitive and powerful way to interact with and manage vast amounts of digital information.",
    "keywords": [
      "File Management",
      "AI Agent",
      "Natural Language Processing",
      "Intelligent Search",
      "Document Management",
      "Workflow Automation"
    ],
    "area": [
      "Artificial Intelligence",
      "Natural Language Processing",
      "AI Agent"
    ],
    "published_time": "2025-11-20 17:47:06",
    "download_time": "2025-11-20 20:02:24",
    "extra_info": "{\"score\": 24, \"by\": \"aabhay\", \"descendants\": 21, \"story_id\": 45995394}"
  },
  {
    "id": "hackernews_45994592",
    "source": "Hacker News",
    "url": "https://github.com/telophasehq/tangent",
    "title": "Show HN: Tangent – Security log pipeline powered by WASM",
    "summary": "Tangent, a Rust-based security log pipeline developed by Ethan and Danny, addresses critical issues within the OCSF community concerning security log management. Traditional methods struggle with frequently evolving schemas, the absence of shared mapping libraries leading to duplicated effort, the laborious task of creating mappers, and the limitations of proprietary Domain-Specific Languages (DSLs) that impede collaboration and AI/LLM integration. Tangent offers a novel solution by discarding DSLs; instead, it compiles all normalization, enrichment, and detection logic into WebAssembly (WASM) plugins. This architecture fosters a robust ecosystem of shareable plugins, drastically simplifying the development, deployment, and maintenance of complex log processing rules. By standardizing logic as WASM code, Tangent enhances flexibility, adaptability to schema changes, and paves the way for improved automation and integration with modern analytical tools, including Large Language Models, for more efficient security operations.",
    "keywords": [
      "Security Log Pipeline",
      "WASM",
      "Rust",
      "OCSF",
      "Log Processing",
      "Data Enrichment",
      "Plugins",
      "Security Operations"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Others"
    ],
    "published_time": "2025-11-20 16:41:31",
    "download_time": "2025-11-20 20:02:53",
    "extra_info": "{\"score\": 11, \"by\": \"ethanblackburn\", \"descendants\": 0, \"story_id\": 45994592}"
  },
  {
    "id": "hackernews_45994537",
    "source": "Hacker News",
    "url": "https://www.centauri-dreams.org/2025/11/20/the-firefly-and-the-pulsar/",
    "title": "The Firefly and the Pulsar",
    "summary": "The article 'The Firefly and the Pulsar' from Centauri Dreams likely delves into a conceptual framework for future interstellar exploration, positing the design and operational challenges of an autonomous, AI-powered probe, metaphorically named 'Firefly.' This probe would be engineered to navigate and gather data in the extreme environments surrounding pulsars – rapidly rotating neutron stars known for their intense gravitational and electromagnetic fields. The narrative would explore the critical role of advanced artificial intelligence in enabling such a mission, from autonomous course correction and hazard avoidance to sophisticated data analysis capabilities onboard. It would discuss how a 'Firefly' probe could unlock new understandings of pulsar physics, stellar evolution, and the fundamental forces of the universe, overcoming the vast distances and harsh conditions of deep space through cutting-edge robotic and AI technologies. Such a mission represents a significant leap in astrobiology and astrophysics, pushing the boundaries of what autonomous systems can achieve in cosmic discovery.",
    "keywords": [
      "Interstellar probes",
      "Pulsar physics",
      "Autonomous systems",
      "AI in space",
      "Deep space exploration",
      "Neutron stars",
      "Robotics",
      "Astrophysics"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Robotics"
    ],
    "published_time": "2025-11-20 16:37:42",
    "download_time": "2025-11-20 20:02:47",
    "extra_info": "{\"score\": 8, \"by\": \"JPLeRouzic\", \"descendants\": 1, \"story_id\": 45994537}"
  },
  {
    "id": "hackernews_45991787",
    "source": "Hacker News",
    "url": "https://www.npr.org/2025/11/18/nx-s1-5564064/calvin-and-hobbes-bill-watterson-40-years-comic-strip-lee-salem",
    "title": "'Calvin and Hobbes' at 40",
    "summary": "The 40th anniversary of 'Calvin and Hobbes' presents an intriguing case study for long-term content engagement and cultural impact within the rapidly evolving digital landscape. While traditionally viewed through a lens of artistic and narrative analysis, the enduring popularity and influence of such media can be critically examined using modern data science techniques. Research leveraging natural language processing and sentiment analysis could explore the evolution of public perception and thematic resonance over four decades. Furthermore, the longevity of intellectual property like 'Calvin and Hobbes' highlights crucial challenges and opportunities in digital content archival, copyright management, and the potential use of generative AI to analyze artistic styles or create derivative works. This sustained relevance offers valuable insights into audience retention strategies and the potential for AI-driven platforms to recommend or curate legacy content, thereby extending its reach and contemporary relevance. The anniversary prompts contemplation on how future iterations of cultural commentary and media consumption might be shaped by advancements in AI-powered media creation and distribution, making it an indirect but valuable reference point for discussions on media technology convergence.",
    "keywords": [
      "Content Longevity",
      "Cultural Impact Analysis",
      "Digital Archiving",
      "Media Technology",
      "AI-driven Content Curation",
      "Intellectual Property Management"
    ],
    "area": [
      "Artificial Intelligence",
      "Natural Language Processing",
      "Generative AI"
    ],
    "published_time": "2025-11-20 12:08:56",
    "download_time": "2025-11-20 20:02:50",
    "extra_info": "{\"score\": 310, \"by\": \"mooreds\", \"descendants\": 113, \"story_id\": 45991787}"
  },
  {
    "id": "adk-go",
    "source": "GitHub",
    "url": "https://github.com/google/adk-go",
    "title": "Agent Development Kit (ADK) for Go",
    "summary": "The Agent Development Kit (ADK) for Go is an open-source, code-first toolkit designed to streamline the building, evaluation, and deployment of sophisticated AI agents. It applies robust software development principles to agent creation, offering a flexible and modular framework for orchestrating workflows from simple tasks to complex multi-agent systems. While optimized for Google's Gemini, ADK maintains model and deployment agnosticism, ensuring compatibility across various environments and frameworks. Leveraging Go's strengths in concurrency and performance, this version is particularly suited for developers creating cloud-native agent applications. Key features include an idiomatic Go design, a rich tool ecosystem for diverse agent capabilities, and direct Go-based definition of agent logic for ultimate flexibility, testability, and version control. Agents built with ADK Go can be easily containerized and deployed in cloud-native environments like Google Cloud Run.",
    "keywords": [
      "AI Agent",
      "Go Programming Language",
      "Agent Development Kit",
      "Cloud-Native",
      "Modular Systems",
      "Tool Ecosystem",
      "Code-First Development",
      "Gemini"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-20T17:00:31Z",
    "download_time": "2024-07-30 10:00:00",
    "extra_info": null
  },
  {
    "id": "TrendRadar",
    "source": "GitHub",
    "url": "https://github.com/sansan0/TrendRadar",
    "title": "TrendRadar",
    "summary": "TrendRadar is an efficient and lightweight hot topic aggregation and intelligent notification assistant designed to help users quickly access relevant news without information overload. It supports rapid deployment (as fast as 30 seconds via GitHub Fork) and offers multi-platform content aggregation from 11+ mainstream sources like Zhihu, Douyin, and Weibo. Key features include three smart push modes (daily summary, current list, incremental monitoring), precise content filtering using customizable keywords, real-time hot spot trend analysis, and a personalized algorithm that prioritizes high-ranking and persistent topics. It provides multi-channel real-time notifications (WeChat Work, Feishu, DingTalk, Telegram, Email, ntfy) and multi-terminal adaptation, including GitHub Pages for web reports and Docker for containerized deployment. A significant update introduces AI intelligent analysis based on the MCP protocol, enabling natural language querying and deep data insights with 13 analytical tools, covering trend tracking, cross-platform comparison, and sentiment analysis. This project is ideal for investors, content creators, and businesses seeking to monitor market trends, public opinion, or industry news with minimal technical overhead.",
    "keywords": [
      "Hotspot Monitoring",
      "AI Analysis",
      "Multi-channel Notification",
      "Data Aggregation",
      "Trend Analysis",
      "Content Filtering",
      "Docker Deployment",
      "GitHub Actions"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2025-11-20T11:29:26Z",
    "download_time": "2024-06-25 15:07:00",
    "extra_info": null
  },
  {
    "id": "2511.14993",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.14993",
    "title": "Kandinsky 5.0: A Family of Foundation Models for Image and Video Generation",
    "summary": "This report introduces Kandinsky 5.0, a family of state-of-the-art foundation models for high-resolution image and 10-second video synthesis. The framework comprises three core line-up of models: Kandinsky 5.0 Image Lite - a line-up of 6B parameter image generation models, Kandinsky 5.0 Video Lite - a fast and lightweight 2B parameter text-to-video and image-to-video models, and Kandinsky 5.0 Video Pro - 19B parameter models that achieves superior video generation quality. We provide a comprehensive review of the data curation lifecycle - including collection, processing, filtering and clustering - for the multi-stage training pipeline that involves extensive pre-training and incorporates quality-enhancement techniques such as self-supervised fine-tuning (SFT) and reinforcement learning (RL)-based post-training. We also present novel architectural, training, and inference optimizations that enable Kandinsky 5.0 to achieve high generation speeds and state-of-the-art performance across various tasks, as demonstrated by human evaluation. As a large-scale, publicly available generative framework, Kandinsky 5.0 leverages the full potential of its pre-training and subsequent stages to be adapted for a wide range of generative applications. We hope that this report, together with the release of our open-source code and training checkpoints, will substantially advance the development and accessibility of high-quality generative models for the research community.",
    "keywords": [
      "Foundation Models",
      "Image Generation",
      "Video Generation",
      "Self-supervised Fine-tuning",
      "Reinforcement Learning"
    ],
    "area": [
      "Generative AI",
      "Deep Learning",
      "Computer Vision"
    ],
    "published_time": "2025-11-19T00:23:22.000Z",
    "download_time": "2025-11-20 12:03:02",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.14993\", \"arxiv_url\": \"https://arxiv.org/abs/2511.14993\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.14993.png\", \"original_title\": \"Kandinsky 5.0: A Family of Foundation Models for Image and Video Generation\"}"
  },
  {
    "id": "2511.15065",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.15065",
    "title": "Reasoning via Video: The First Evaluation of Video Models' Reasoning Abilities through Maze-Solving Tasks",
    "summary": "Video Models have achieved remarkable success in high-fidelity video generation with coherent motion dynamics. Analogous to the development from text generation to text-based reasoning in language modeling, the development of video models motivates us to ask: Can video models reason via video generation? Compared with the discrete text corpus, video grounds reasoning in explicit spatial layouts and temporal continuity, which serves as an ideal substrate for spatial reasoning. In this work, we explore the reasoning via video paradigm and introduce VR-Bench -- a comprehensive benchmark designed to systematically evaluate video models' reasoning capabilities. Grounded in maze-solving tasks that inherently require spatial planning and multi-step reasoning, VR-Bench contains 7,920 procedurally generated videos across five maze types and diverse visual styles. Our empirical analysis demonstrates that SFT can efficiently elicit the reasoning ability of video model. Video models exhibit stronger spatial perception during reasoning, outperforming leading VLMs and generalizing well across diverse scenarios, tasks, and levels of complexity. We further discover a test-time scaling effect, where diverse sampling during inference improves reasoning reliability by 10--20%. These findings highlight the unique potential and scalability of reasoning via video for spatial reasoning tasks.",
    "keywords": [
      "Video Models",
      "Reasoning",
      "Video Generation",
      "Spatial Reasoning",
      "Maze-Solving Tasks"
    ],
    "area": [
      "Generative AI",
      "Video Understanding",
      "Computer Vision"
    ],
    "published_time": "2025-11-19T03:18:29.000Z",
    "download_time": "2025-11-20 12:03:02",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.15065\", \"arxiv_url\": \"https://arxiv.org/abs/2511.15065\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.15065.png\", \"original_title\": \"Reasoning via Video: The First Evaluation of Video Models' Reasoning Abilities through Maze-Solving Tasks\"}"
  },
  {
    "id": "2511.15661",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.15661",
    "title": "VisPlay: Self-Evolving Vision-Language Models from Images",
    "summary": "Reinforcement learning (RL) provides a principled framework for improving Vision-Language Models (VLMs) on complex reasoning tasks. However, existing RL approaches often rely on human-annotated labels or task-specific heuristics to define verifiable rewards, both of which are costly and difficult to scale. We introduce VisPlay, a self-evolving RL framework that enables VLMs to autonomously improve their reasoning abilities using large amounts of unlabeled image data. Starting from a single base VLM, VisPlay assigns the model into two interacting roles: an Image-Conditioned Questioner that formulates challenging yet answerable visual questions, and a Multimodal Reasoner that generates silver responses. These roles are jointly trained with Group Relative Policy Optimization (GRPO), which incorporates diversity and difficulty rewards to balance the complexity of generated questions with the quality of the silver answers. VisPlay scales efficiently across two model families. When trained on Qwen2.5-VL and MiMo-VL, VisPlay achieves consistent improvements in visual reasoning, compositional generalization, and hallucination reduction across eight benchmarks, including MM-Vet and MMMU, demonstrating a scalable path toward self-evolving multimodal intelligence. The project page is available at https://bruno686.github.io/VisPlay/",
    "keywords": [
      "Vision-Language Models",
      "Reinforcement Learning",
      "Self-evolving",
      "Multimodal AI",
      "Visual Reasoning"
    ],
    "area": [
      "Multimodal",
      "Machine Learning",
      "Computer Vision"
    ],
    "published_time": "2025-11-19T17:55:15.000Z",
    "download_time": "2025-11-20 12:03:01",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.15661\", \"arxiv_url\": \"https://arxiv.org/abs/2511.15661\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.15661.png\", \"original_title\": \"VisPlay: Self-Evolving Vision-Language Models from Images\"}"
  },
  {
    "id": "2511.13524",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.13524",
    "title": "FreeAskWorld: An Interactive and Closed-Loop Simulator for Human-Centric Embodied AI",
    "summary": "As embodied intelligence emerges as a core frontier in artificial intelligence research, simulation platforms must evolve beyond low-level physical interactions to capture complex, human-centered social behaviors. We introduce FreeAskWorld, an interactive simulation framework that integrates large language models (LLMs) for high-level behavior planning and semantically grounded interaction, informed by theories of intention and social cognition. Our framework supports scalable, realistic human-agent simulations and includes a modular data generation pipeline tailored for diverse embodied tasks.To validate the framework, we extend the classic Vision-and-Language Navigation (VLN) task into a interaction enriched Direction Inquiry setting, wherein agents can actively seek and interpret navigational guidance. We present and publicly release FreeAskWorld, a large-scale benchmark dataset comprising reconstructed environments, six diverse task types, 16 core object categories, 63,429 annotated sample frames, and more than 17 hours of interaction data to support training and evaluation of embodied AI systems. We benchmark VLN models, and human participants under both open-loop and closed-loop settings. Experimental results demonstrate that models fine-tuned on FreeAskWorld outperform their original counterparts, achieving enhanced semantic understanding and interaction competency. These findings underscore the efficacy of socially grounded simulation frameworks in advancing embodied AI systems toward sophisticated high-level planning and more naturalistic human-agent interaction. Importantly, our work underscores that interaction itself serves as an additional information modality.",
    "keywords": [
      "Embodied AI",
      "Simulation Framework",
      "Large Language Models",
      "Human-Agent Interaction",
      "Vision-and-Language Navigation"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Large Language Model"
    ],
    "published_time": "2025-11-17T15:58:46.000Z",
    "download_time": "2025-11-20 12:03:02",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.13524\", \"arxiv_url\": \"https://arxiv.org/abs/2511.13524\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.13524.png\", \"original_title\": \"FreeAskWorld: An Interactive and Closed-Loop Simulator for Human-Centric Embodied AI\"}"
  },
  {
    "id": "2511.15038",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.15038",
    "title": "Aligning Generative Music AI with Human Preferences: Methods and Challenges",
    "summary": "Recent advances in generative AI for music have achieved remarkable fidelity and stylistic diversity, yet these systems often fail to align with nuanced human preferences due to the specific loss functions they use. This paper advocates for the systematic application of preference alignment techniques to music generation, addressing the fundamental gap between computational optimization and human musical appreciation. Drawing on recent breakthroughs including MusicRL's large-scale preference learning, multi-preference alignment frameworks like diffusion-based preference optimization in DiffRhythm+, and inference-time optimization techniques like Text2midi-InferAlign, we discuss how these techniques can address music's unique challenges: temporal coherence, harmonic consistency, and subjective quality assessment. We identify key research challenges including scalability to long-form compositions, reliability amongst others in preference modelling. Looking forward, we envision preference-aligned music generation enabling transformative applications in interactive composition tools and personalized music services. This work calls for sustained interdisciplinary research combining advances in machine learning, music-theory to create music AI systems that truly serve human creative and experiential needs.",
    "keywords": [
      "Generative Music AI",
      "Human Preferences",
      "Preference Alignment",
      "Music Generation",
      "Machine Learning"
    ],
    "area": [
      "Generative AI",
      "Machine Learning",
      "Artificial Intelligence"
    ],
    "published_time": "2025-11-19T02:12:27.000Z",
    "download_time": "2025-11-20 12:03:01",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.15038\", \"arxiv_url\": \"https://arxiv.org/abs/2511.15038\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.15038.png\", \"original_title\": \"Aligning Generative Music AI with Human Preferences: Methods and Challenges\"}"
  },
  {
    "id": "2511.12207",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.12207",
    "title": "Mixture of States: Routing Token-Level Dynamics for Multimodal Generation",
    "summary": "We introduce MoS (Mixture of States), a novel fusion paradigm for multimodal diffusion models that merges modalities using flexible, state-based interactions. The core of MoS is a learnable, token-wise router that creates denoising timestep- and input-dependent interactions between modalities' hidden states, precisely aligning token-level features with the diffusion trajectory. This router sparsely selects the top-k hidden states and is trained with an \\b\\b-greedy strategy, efficiently selecting contextual features with minimal learnable parameters and negligible computational overhead. We validate our design with text-to-image generation (MoS-Image) and editing (MoS-Editing), which achieve state-of-the-art results. With only 3B to 5B parameters, our models match or surpass counterparts up to 4times larger. These findings establish MoS as a flexible and compute-efficient paradigm for scaling multimodal diffusion models.",
    "keywords": [
      "Multimodal Generation",
      "Diffusion Models",
      "Token-Level Dynamics",
      "Mixture of States",
      "Text-to-Image Generation"
    ],
    "area": [
      "Multimodal",
      "Generative AI",
      "Deep Learning"
    ],
    "published_time": "2025-11-15T13:24:57.000Z",
    "download_time": "2025-11-20 12:03:02",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.12207\", \"arxiv_url\": \"https://arxiv.org/abs/2511.12207\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.12207.png\", \"original_title\": \"Mixture of States: Routing Token-Level Dynamics for Multimodal Generation\"}"
  }
]