[
  {
    "id": "hackernews_45904551",
    "source": "Hacker News",
    "url": "https://openai.com/index/gpt-5-1/",
    "title": "GPT-5.1: A smarter, more conversational ChatGPT",
    "summary": "OpenAI has reportedly introduced GPT-5.1, an incremental yet significant upgrade to its foundational large language model, promising a more intelligent and naturally conversational experience for users. This latest iteration is engineered to exhibit enhanced reasoning capabilities, allowing it to process complex queries with greater accuracy and generate more nuanced responses across a wide array of topics. Furthermore, GPT-5.1 focuses on refining the user interaction by improving its ability to maintain coherent dialogue, understand subtle contextual cues, and deliver more fluid and human-like conversations. This advancement is expected to further empower applications relying on sophisticated natural language understanding and generation, making AI interactions more intuitive and effective for various use cases, from customer service to creative writing. The update aims to push the boundaries of current conversational AI technology, offering a robust platform for developers and a more engaging tool for end-users, solidifying ChatGPT's position as a leading AI assistant. The focus on intelligence and conversational flow suggests improvements in areas like contextual awareness, emotional intelligence simulation, and overall utility in interactive scenarios.",
    "keywords": [
      "GPT-5.1",
      "ChatGPT",
      "Large Language Model",
      "Conversational AI",
      "Natural Language Processing",
      "AI Development",
      "OpenAI"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-12 19:05:41",
    "download_time": "2025-11-12 20:02:23",
    "extra_info": "{\"score\": 113, \"by\": \"tedsanders\", \"descendants\": 128, \"story_id\": 45904551}"
  },
  {
    "id": "hackernews_45897271",
    "source": "Hacker News",
    "url": "https://www.nasdaq.com/articles/metas-chief-ai-scientist-yann-lecun-depart-and-launch-ai-start-focused-world-models",
    "title": "Yann LeCun to depart Meta and launch AI startup focused on 'world models'",
    "summary": "Yann LeCun, a highly influential figure in the field of deep learning and currently Meta's Chief AI Scientist, is reportedly preparing to depart the tech conglomerate to found his own artificial intelligence startup. The new company is expected to center its research and development efforts on 'world models,' a cutting-edge area in AI that seeks to equip machines with an intrinsic understanding of environmental dynamics, predictive capabilities for future occurrences, and advanced reasoning faculties. This strategic move by one of AI's leading minds represents a notable shift in the industry, potentially redirecting research priorities and talent flows. LeCun's foundational work, particularly his contributions to convolutional neural networks, has been instrumental in the progression of modern AI. His independent venture is poised to push the boundaries of AI systems, fostering advancements in autonomous learning and sophisticated decision-making mechanisms that transcend current supervised learning methodologies. This transition from a major corporate research lab to an independent entrepreneurial pursuit underscores the vigorous innovation and quest for next-generation AI paradigms, including a path towards artificial general intelligence, within the global AI community.",
    "keywords": [
      "Yann LeCun",
      "AI Startup",
      "World Models",
      "Deep Learning",
      "Artificial Intelligence",
      "Meta AI"
    ],
    "area": [
      "Artificial Intelligence",
      "Deep Learning",
      "Machine Learning"
    ],
    "published_time": "2025-11-12 07:25:30",
    "download_time": "2025-11-12 20:02:29",
    "extra_info": "{\"score\": 746, \"by\": \"MindBreaker2605\", \"descendants\": 558, \"story_id\": 45897271}"
  },
  {
    "id": "hackernews_45902732",
    "source": "Hacker News",
    "url": "http://marble.worldlabs.ai/",
    "title": "Marble by World Labs: Multimodal world model to create and edit 3D worlds",
    "summary": "World Labs has unveiled Marble, a groundbreaking multimodal world model engineered to facilitate the creation and editing of intricate 3D environments. This sophisticated AI system is designed to interpret diverse data inputs, enabling it to construct and manipulate virtual three-dimensional spaces with unprecedented flexibility. Marble's core innovation lies in its capacity to process various modalities\b4such as text, images, and potentially other forms of media\b4to build coherent and interactive digital worlds. The initiative aims to democratize 3D content generation, streamlining workflows for professionals in fields like gaming, architectural visualization, and simulation development. This advancement represents a significant step forward in generative AI, promising to accelerate the production of immersive virtual experiences and foster new possibilities for digital design and interaction within complex virtual realities.",
    "keywords": [
      "Multimodal AI",
      "World Model",
      "3D Modeling",
      "Generative AI",
      "Virtual Worlds",
      "AI for Design",
      "Content Creation"
    ],
    "area": [
      "Artificial Intelligence",
      "Multimodal",
      "Generative AI"
    ],
    "published_time": "2025-11-12 17:13:30",
    "download_time": "2025-11-12 20:02:37",
    "extra_info": "{\"score\": 11, \"by\": \"dmarcos\", \"descendants\": 2, \"story_id\": 45902732}"
  },
  {
    "id": "hackernews_45902590",
    "source": "Hacker News",
    "url": "https://news.ycombinator.com/item?id=45902590",
    "title": "Show HN: Cancer diagnosis makes for an interesting RL environment for LLMs",
    "summary": "David from Aluna (YC S24) has unveiled an innovative reinforcement learning (RL) environment tailored for frontier Large Language Models (LLMs) to undertake cancer diagnosis tasks. This system equips LLMs with specialized tools that enable them to navigate digitized pathology slides, performing actions like zooming and panning to pinpoint regions crucial for accurate diagnosis. Aluna, which collaborates with diagnostic labs on oncology datasets and evaluations, developed this environment to push the boundaries of AI in medical diagnostics. The announcement is accompanied by video demonstrations illustrating LLMs effectively interacting with the slides to make diagnoses, specifically highlighting cases of small-cell carcinoma of the lung and benign fibroadenoma. This work represents a significant stride in developing sophisticated AI agents capable of interpreting complex medical imagery, offering a promising avenue for augmenting diagnostic workflows and addressing critical challenges in oncology with advanced machine learning techniques.",
    "keywords": [
      "Cancer diagnosis",
      "Reinforcement Learning",
      "Large Language Models",
      "Pathology slides",
      "Digital pathology",
      "Oncology",
      "AI in medicine",
      "Medical imaging"
    ],
    "area": [
      "Large Language Model",
      "Machine Learning",
      "AI Agent"
    ],
    "published_time": "2025-11-12 17:01:42",
    "download_time": "2025-11-12 20:02:36",
    "extra_info": "{\"score\": 18, \"by\": \"dchu17\", \"descendants\": 3, \"story_id\": 45902590}"
  },
  {
    "id": "hackernews_45901855",
    "source": "Hacker News",
    "url": "https://techcrunch.com/2025/11/12/waymo-robotaxis-are-now-giving-rides-on-freeways-in-these-3-cities/",
    "title": "Waymo robotaxis are now giving rides on freeways in LA, SF and Phoenix",
    "summary": "Waymo, a leader in autonomous vehicle technology, has announced a significant expansion of its robotaxi services, now offering rides on freeways in key metropolitan areas including Los Angeles, San Francisco, and Phoenix. This strategic move represents a crucial advancement in the deployment of fully autonomous ride-hailing, transitioning from urban streets to more complex freeway environments. Operating on freeways introduces new challenges for self-driving systems, demanding enhanced capabilities in high-speed navigation, lane keeping, merge maneuvers, and sophisticated perception systems to handle diverse traffic scenarios. The expansion into these major cities underscores Waymo's progress in developing robust AI and sensor technology capable of safely operating at higher speeds and within more dynamic traffic flows. This development is expected to accelerate the broader adoption and commercialization of robotaxi services, pushing the boundaries of autonomous mobility and setting new benchmarks for the industry in urban and inter-city transportation.",
    "keywords": [
      "Robotaxis",
      "Autonomous Vehicles",
      "Self-driving Technology",
      "Waymo",
      "AI in Transportation",
      "Freeway Driving",
      "Automotive Robotics",
      "Urban Mobility"
    ],
    "area": [
      "Artificial Intelligence",
      "Robotics",
      "Computer Vision"
    ],
    "published_time": "2025-11-12 16:06:29",
    "download_time": "2025-11-12 20:02:22",
    "extra_info": "{\"score\": 218, \"by\": \"nharada\", \"descendants\": 247, \"story_id\": 45901855}"
  },
  {
    "id": "hackernews_45898789",
    "source": "Hacker News",
    "url": "https://twitter.com/omar_quraishi/status/1988518627859951986",
    "title": "Pakistani newspaper mistakenly prints AI prompt with the article",
    "summary": "A Pakistani newspaper, The News International, recently garnered significant attention for inadvertently publishing an artificial intelligence prompt alongside a news article. The incident, quickly identified and disseminated across social media platforms, exposed the exact instructions provided to an artificial intelligence model tasked with generating the article's content. This oversight points to potential gaps in the editorial review pipeline or an excessive dependency on automated content generation without sufficient human vetting. It vividly illustrates the accelerating integration of AI into news production and highlights the paramount importance of stringent verification protocols to prevent the public display of internal AI prompts or unprocessed machine outputs. Such an occurrence acts as a significant reminder for media organizations worldwide, reinforcing the indispensable role of human editorial discernment, even when leveraging sophisticated AI tools for enhanced productivity. This error has ignited a broader conversation regarding quality assurance and the evolving landscape of journalism in an era increasingly influenced by artificial intelligence.",
    "keywords": [
      "AI in journalism",
      "Content automation",
      "Editorial oversight",
      "Prompt engineering",
      "Generative AI",
      "AI error",
      "Media ethics",
      "Quality control"
    ],
    "area": [
      "Artificial Intelligence",
      "Generative AI",
      "Natural Language Processing"
    ],
    "published_time": "2025-11-12 11:17:06",
    "download_time": "2025-11-12 20:02:37",
    "extra_info": "{\"score\": 438, \"by\": \"wg0\", \"descendants\": 154, \"story_id\": 45898789}"
  },
  {
    "id": "TrendRadar",
    "source": "GitHub",
    "url": "https://github.com/sansan0/TrendRadar",
    "title": "TrendRadar",
    "summary": "TrendRadar is a light-weight, easy-to-deploy hot news aggregation and intelligent push assistant, designed to filter out irrelevant information and deliver truly important news. It supports real-time monitoring of over 11 mainstream platforms, including popular Chinese social media and financial news sources. Key features include highly customizable content filtering using keywords with various syntax (e.g., must-include, exclude), smart push strategies (daily summary, current list, incremental updates), and an innovative hotness algorithm that re-ranks news based on platform ranking, frequency, and overall hotness. The project offers multi-channel notification via WeChat Work, Feishu, DingTalk, Telegram, Email, and ntfy, along with multi-device web reports. A significant addition is its AI smart analysis capability, powered by the Model Context Protocol (MCP), enabling natural language queries and deep data insights across 13 analysis tools, providing topic trend tracking, cross-platform data comparison, and intelligent summaries. It boasts zero-technical-threshold deployment with Docker and GitHub Pages.",
    "keywords": [
      "Hot News Aggregation",
      "Real-time Notifications",
      "AI Data Analysis",
      "Model Context Protocol (MCP)",
      "Content Filtering",
      "Docker Deployment",
      "GitHub Actions",
      "Web Scraping"
    ],
    "area": [
      "Artificial Intelligence",
      "Natural Language Processing",
      "Others"
    ],
    "published_time": "2025-11-12T12:49:07Z",
    "download_time": "2024-05-27 06:15:00",
    "extra_info": null
  },
  {
    "id": "adk-go",
    "source": "GitHub",
    "url": "https://github.com/google/adk-go",
    "title": "Agent Development Kit (ADK) for Go",
    "summary": "The Agent Development Kit (ADK) for Go is an open-source, code-first toolkit designed to streamline the building, evaluation, and deployment of sophisticated AI agents. Embodying robust software development principles, ADK offers a flexible and modular framework for orchestrating agent workflows, scaling from simple tasks to intricate multi-agent systems. While specifically optimized for Google's Gemini models, its design ensures model-agnosticism and deployment-agnosticism, providing broad compatibility across various AI models and cloud environments. This Go iteration of ADK capitalizes on the language's inherent strengths in concurrency and performance, making it an ideal choice for developers focused on creating cloud-native agent applications, especially within platforms like Google Cloud Run. Its core features include an idiomatic Go design, a rich ecosystem for integrating pre-built or custom tools to enhance agent capabilities, and a code-first development approach for maximum flexibility, testability, and version control. Furthermore, ADK facilitates the design of modular, scalable multi-agent architectures, empowering developers to construct complex AI solutions with greater control and efficiency.",
    "keywords": [
      "AI Agent Development",
      "Go Programming",
      "Multi-Agent Systems",
      "Cloud-Native Applications",
      "Modular Framework",
      "Code-First AI",
      "Agent Orchestration"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-11-12T12:18:43Z",
    "download_time": "2024-05-15 10:45:00",
    "extra_info": null
  },
  {
    "id": "2511.07332",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.07332",
    "title": "Grounding Computer Use Agents on Human Demonstrations",
    "summary": "Building reliable computer-use agents requires grounding: accurately connecting natural language instructions to the correct on-screen elements. While large datasets exist for web and mobile interactions, high-quality resources for desktop environments are limited. To address this gap, we introduce GroundCUA, a large-scale desktop grounding dataset built from expert human demonstrations. It covers 87 applications across 12 categories and includes 56K screenshots, with every on-screen element carefully annotated for a total of over 3.56M human-verified annotations. From these demonstrations, we generate diverse instructions that capture a wide range of real-world tasks, providing high-quality data for model training. Using GroundCUA, we develop the GroundNext family of models that map instructions to their target UI elements. At both 3B and 7B scales, GroundNext achieves state-of-the-art results across five benchmarks using supervised fine-tuning, while requiring less than one-tenth the training data of prior work. Reinforcement learning post-training further improves performance, and when evaluated in an agentic setting on the OSWorld benchmark using o3 as planner, GroundNext attains comparable or superior results to models trained with substantially more data. These results demonstrate the critical role of high-quality, expert-driven datasets in advancing general-purpose computer-use agents.",
    "keywords": [
      "Computer-use agents",
      "Grounding",
      "Human demonstrations",
      "Desktop UI",
      "Datasets"
    ],
    "area": [
      "AI Agent",
      "Machine Learning",
      "Deep Learning"
    ],
    "published_time": "2025-11-10T17:35:21.000Z",
    "download_time": "2025-11-12 12:03:02",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.07332\", \"arxiv_url\": \"https://arxiv.org/abs/2511.07332\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.07332.png\", \"original_title\": \"Grounding Computer Use Agents on Human Demonstrations\"}"
  },
  {
    "id": "2511.06221",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.06221",
    "title": "Tiny Model, Big Logic: Diversity-Driven Optimization Elicits Large-Model Reasoning Ability in VibeThinker-1.5B",
    "summary": "Challenging the prevailing consensus that small models inherently lack robust reasoning, this report introduces VibeThinker-1.5B, a 1.5B-parameter dense model developed via our Spectrum-to-Signal Principle (SSP). This challenges the prevailing approach of scaling model parameters to enhance capabilities, as seen in models like DeepSeek R1 (671B) and Kimi k2 (>1T). The SSP framework first employs a Two-Stage Diversity-Exploring Distillation (SFT) to generate a broad spectrum of solutions, followed by MaxEnt-Guided Policy Optimization (RL) to amplify the correct signal. With a total training cost of only $7,800, VibeThinker-1.5B demonstrates superior reasoning capabilities compared to closed-source models like Magistral Medium and Claude Opus 4, and performs on par with open-source models like GPT OSS-20B Medium. Remarkably, it surpasses the 400x larger DeepSeek R1 on three math benchmarks: AIME24 (80.3 vs. 79.8), AIME25 (74.4 vs. 70.0), and HMMT25 (50.4 vs. 41.7). This is a substantial improvement over its base model (6.7, 4.3, and 0.6, respectively). On LiveCodeBench V6, it scores 51.1, outperforming Magistral Medium's 50.3 and its base model's 0.0. These findings demonstrate that small models can achieve reasoning capabilities comparable to large models, drastically reducing training and inference costs and thereby democratizing advanced AI research.",
    "keywords": [
      "VibeThinker-1.5B",
      "Reasoning Ability",
      "Small Models",
      "Diversity-Driven Optimization",
      "Model Distillation"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Large Language Model"
    ],
    "published_time": "2025-11-09T04:37:36.000Z",
    "download_time": "2025-11-12 12:03:04",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.06221\", \"arxiv_url\": \"https://arxiv.org/abs/2511.06221\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.06221.png\", \"original_title\": \"Tiny Model, Big Logic: Diversity-Driven Optimization Elicits Large-Model\\n  Reasoning Ability in VibeThinker-1.5B\"}"
  },
  {
    "id": "2511.08319",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.08319",
    "title": "Adaptive Multi-Agent Response Refinement in Conversational Systems",
    "summary": "Large Language Models (LLMs) have demonstrated remarkable success in conversational systems by generating human-like responses. However, they can fall short, especially when required to account for personalization or specific knowledge. In real-life settings, it is impractical to rely on users to detect these errors and request a new response. One way to address this problem is to refine the response before returning it to the user. While existing approaches focus on refining responses within a single LLM, this method struggles to consider diverse aspects needed for effective conversations. In this work, we propose refining responses through a multi-agent framework, where each agent is assigned a specific role for each aspect. We focus on three key aspects crucial to conversational quality: factuality, personalization, and coherence. Each agent is responsible for reviewing and refining one of these aspects, and their feedback is then merged to improve the overall response. To enhance collaboration among them, we introduce a dynamic communication strategy. Instead of following a fixed sequence of agents, our approach adaptively selects and coordinates the most relevant agents based on the specific requirements of each query. We validate our framework on challenging conversational datasets, demonstrating that ours significantly outperforms relevant baselines, particularly in tasks involving knowledge or user's persona, or both.",
    "keywords": [
      "Multi-Agent Systems",
      "Conversational Systems",
      "Large Language Models",
      "Response Refinement",
      "Dynamic Communication"
    ],
    "area": [
      "Natural Language Processing",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2025-11-11T14:48:34.000Z",
    "download_time": "2025-11-12 12:03:01",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.08319\", \"arxiv_url\": \"https://arxiv.org/abs/2511.08319\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.08319.png\", \"original_title\": \"Adaptive Multi-Agent Response Refinement in Conversational Systems\"}"
  },
  {
    "id": "2511.06281",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.06281",
    "title": "VideoSSR: Video Self-Supervised Reinforcement Learning",
    "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) has substantially advanced the video understanding capabilities of Multimodal Large Language Models (MLLMs). However, the rapid progress of MLLMs is outpacing the complexity of existing video datasets, while the manual annotation of new, high-quality data remains prohibitively expensive. This work investigates a pivotal question: Can the rich, intrinsic information within videos be harnessed to self-generate high-quality, verifiable training data? To investigate this, we introduce three self-supervised pretext tasks: Anomaly Grounding, Object Counting, and Temporal Jigsaw. We construct the Video Intrinsic Understanding Benchmark (VIUBench) to validate their difficulty, revealing that current state-of-the-art MLLMs struggle significantly on these tasks. Building upon these pretext tasks, we develop the VideoSSR-30K dataset and propose VideoSSR, a novel video self-supervised reinforcement learning framework for RLVR. Extensive experiments across 17 benchmarks, spanning four major video domains (General Video QA, Long Video QA, Temporal Grounding, and Complex Reasoning), demonstrate that VideoSSR consistently enhances model performance, yielding an average improvement of over 5%. These results establish VideoSSR as a potent foundational framework for developing more advanced video understanding in MLLMs. The code is available at https://github.com/lcqysl/VideoSSR.",
    "keywords": [
      "Video Understanding",
      "Self-Supervised Learning",
      "Reinforcement Learning",
      "Multimodal Large Language Models",
      "Verifiable Rewards"
    ],
    "area": [
      "Video Understanding",
      "Multimodal",
      "Large Language Model"
    ],
    "published_time": "2025-11-09T08:36:40.000Z",
    "download_time": "2025-11-12 12:03:01",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.06281\", \"arxiv_url\": \"https://arxiv.org/abs/2511.06281\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.06281.png\", \"original_title\": \"VideoSSR: Video Self-Supervised Reinforcement Learning\"}"
  },
  {
    "id": "2511.08567",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.08567",
    "title": "The Path Not Taken: RLVR Provably Learns Off the Principals",
    "summary": "Reinforcement Learning with Verifiable Rewards (RLVR) reliably improves the reasoning performance of large language models, yet it appears to modify only a small fraction of parameters. We revisit this paradox and show that sparsity is a surface artifact of a model-conditioned optimization bias: for a fixed pretrained model, updates consistently localize to preferred parameter regions, highly consistent across runs and largely invariant to datasets and RL recipes. We mechanistically explain these dynamics with a Three-Gate Theory: Gate I (KL Anchor) imposes a KL-constrained update; Gate II (Model Geometry) steers the step off principal directions into low-curvature, spectrum-preserving subspaces; and Gate III (Precision) hides micro-updates in non-preferred regions, making the off-principal bias appear as sparsity. We then validate this theory and, for the first time, provide a parameter-level characterization of RLVR's learning dynamics: RLVR learns off principal directions in weight space, achieving gains via minimal spectral drift, reduced principal-subspace rotation, and off-principal update alignment. In contrast, SFT targets principal weights, distorts the spectrum, and even lags RLVR. Together, these results provide the first parameter-space account of RLVR's training dynamics, revealing clear regularities in how parameters evolve. Crucially, we show that RL operates in a distinct optimization regime from SFT, so directly adapting SFT-era parameter-efficient fine-tuning (PEFT) methods can be flawed, as evidenced by our case studies on advanced sparse fine-tuning and LoRA variants. We hope this work charts a path toward a white-box understanding of RLVR and the design of geometry-aware, RLVR-native learning algorithms, rather than repurposed SFT-era heuristics.",
    "keywords": [
      "RLVR",
      "Large Language Models",
      "Learning Dynamics",
      "Optimization Bias",
      "Sparsity"
    ],
    "area": [
      "Machine Learning",
      "Deep Learning",
      "Large Language Model"
    ],
    "published_time": "2025-11-11T18:49:45.000Z",
    "download_time": "2025-11-12 12:03:02",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.08567\", \"arxiv_url\": \"https://arxiv.org/abs/2511.08567\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.08567.png\", \"original_title\": \"The Path Not Taken: RLVR Provably Learns Off the Principals\"}"
  },
  {
    "id": "2511.08043",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2511.08043",
    "title": "DynaAct: Large Language Model Reasoning with Dynamic Action Spaces",
    "summary": "In modern sequential decision-making systems, the construction of an optimal candidate action space is critical to efficient inference. However, existing approaches either rely on manually defined action spaces that lack scalability or utilize unstructured spaces that render exhaustive search computationally prohibitive. In this paper, we propose a novel framework named DynaAct for automatically constructing a compact action space to enhance sequential reasoning in complex problem-solving scenarios. Our method first estimates a proxy for the complete action space by extracting general sketches observed in a corpus covering diverse complex reasoning problems using large language models. We then formulate a submodular function that jointly evaluates candidate actions based on their utility to the current state and their diversity, and employ a greedy algorithm to select an optimal candidate set. Extensive experiments on six diverse standard benchmarks demonstrate that our approach significantly improves overall performance, while maintaining efficient inference without introducing substantial latency. The implementation is available at https://github.com/zhaoxlpku/DynaAct.",
    "keywords": [
      "Large Language Models",
      "Dynamic Action Spaces",
      "Sequential Decision-Making",
      "Action Space Optimization",
      "Efficient Inference"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Artificial Intelligence"
    ],
    "published_time": "2025-11-11T09:47:13.000Z",
    "download_time": "2025-11-12 12:03:01",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2511.08043\", \"arxiv_url\": \"https://arxiv.org/abs/2511.08043\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2511.08043.png\", \"original_title\": \"DynaAct: Large Language Model Reasoning with Dynamic Action Spaces\"}"
  }
]