[
  {
    "id": "hackernews_46360856",
    "source": "Hacker News",
    "url": "https://spectrum.ieee.org/ai-models-locally",
    "title": "Local AI is driving the biggest change in laptops in decades",
    "summary": "The integration of local AI capabilities directly into laptops is heralded as the most significant transformation in personal computing hardware in decades. This paradigm shift enables artificial intelligence tasks to be processed on-device rather than relying solely on cloud infrastructure, offering substantial benefits in terms of data privacy, reduced latency, and enhanced offline functionality. The move toward local AI necessitates the development of specialized hardware, such as Neural Processing Units (NPUs), which are becoming standard components in new laptop architectures to efficiently handle complex AI workloads. This evolution is not merely an incremental upgrade but a foundational change, promising to unlock new levels of performance and user experience across various applications, from creative content generation and advanced productivity tools to more sophisticated personal assistants. As manufacturers embed more powerful AI engines directly into their devices, laptops are set to become intelligent and self-sufficient platforms, redefining the scope and potential of mobile computing.",
    "keywords": [
      "Local AI",
      "On-device AI",
      "AI hardware",
      "Neural Processing Unit",
      "Personal computing",
      "Edge AI",
      "AI acceleration"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Generative AI"
    ],
    "published_time": "2025-12-23 00:12:16",
    "download_time": "2025-12-23 20:03:03",
    "extra_info": "{\"score\": 114, \"by\": \"barqawiz\", \"descendants\": 88, \"story_id\": 46360856}"
  },
  {
    "id": "hackernews_46364973",
    "source": "Hacker News",
    "url": "https://alperenkeles.com/posts/test-dont-verify/",
    "title": "Test, don't (just) verify",
    "summary": "The adage 'Test, don't (just) verify' advocates for a proactive and comprehensive approach to software quality assurance, moving beyond mere confirmation of expected outcomes to actively discovering unforeseen defects and vulnerabilities. This philosophy underscores the importance of exploratory testing and continuous integration, where the goal is to break the system under various conditions rather than simply confirming its adherence to specifications. In modern software development, this principle is increasingly intertwined with advancements in Artificial Intelligence and Machine Learning. AI-powered testing agents can intelligently explore software functionalities, identify edge cases, and even predict potential failure points with greater efficiency and depth than traditional methods. Machine learning algorithms can analyze vast datasets of code and user interactions to optimize test suites, prioritize critical test cases, and dynamically adapt testing strategies. This paradigm shift emphasizes building robust, resilient systems by leveraging intelligent automation to ensure quality, pushing the boundaries from passive verification to dynamic, intelligent assurance across the development lifecycle.",
    "keywords": [
      "Software Testing",
      "Quality Assurance",
      "AI in Testing",
      "Test Automation",
      "Exploratory Testing",
      "Intelligent Systems",
      "Software Development Life Cycle"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2025-12-23 12:56:50",
    "download_time": "2025-12-23 20:03:01",
    "extra_info": "{\"score\": 154, \"by\": \"alpaylan\", \"descendants\": 102, \"story_id\": 46364973}"
  },
  {
    "id": "hackernews_46368372",
    "source": "Hacker News",
    "url": "https://www.technologyreview.com/2025/12/23/1130393/how-social-media-encourages-the-worst-of-ai-boosterism/",
    "title": "Social media encourages the worst of AI boosterism",
    "summary": "The article critically examines the detrimental role of social media platforms in fostering an overly optimistic and often unrealistic perception of Artificial Intelligence. It argues that the inherent mechanisms of social media, such as algorithmic amplification, character limits, and the pursuit of viral content, inadvertently promote exaggerated claims and speculative narratives about AI's capabilities. This environment encourages 'AI boosterism,' where nuanced discussions about technological limitations, ethical concerns, and potential societal risks are frequently overshadowed by sensational headlines and simplified, often misleading, portrayals of advancements. Such pervasive hype can lead to a distorted public understanding of AI, influencing investment trends, policy decisions, and the allocation of research resources towards potentially unsustainable or unproven directions. The piece suggests that the rapid dissemination of unverified information and the echo chamber effect on social media hinder critical evaluation, contributing to a cycle of unrealistic expectations and eventual disillusionment regarding the true progress and impact of AI technologies. This phenomenon underscores the need for greater media literacy and critical engagement with AI-related content shared across digital platforms.",
    "keywords": [
      "AI Hype",
      "Social Media Influence",
      "Misinformation",
      "Public Perception",
      "Ethical AI",
      "Technological Boosterism",
      "AI Criticism"
    ],
    "area": [
      "Artificial Intelligence",
      "Generative AI",
      "Others"
    ],
    "published_time": "2025-12-23 19:16:43",
    "download_time": "2025-12-23 20:03:24",
    "extra_info": "{\"score\": 7, \"by\": \"jethronethro\", \"descendants\": 0, \"story_id\": 46368372}"
  },
  {
    "id": "hackernews_46368263",
    "source": "Hacker News",
    "url": "https://markmaunder.com/2025/nature-is-laughing-at-the-ai-build-out/",
    "title": "Nature Is Laughing at the AI Build Out",
    "summary": "The article, titled 'Nature Is Laughing at the AI Build Out,' critiques the accelerating expansion of artificial intelligence infrastructure and its environmental implications. It suggests that the current pace and scale of AI development are unsustainable, highlighting significant concerns regarding resource consumption, energy demands, and carbon footprint. The piece likely delves into the massive computational power required for training large AI models, the significant water usage for cooling data centers, and the raw materials needed for hardware production. It challenges the industry to consider the ecological costs associated with its rapid growth, advocating for more sustainable practices and a greater awareness of AI's broader environmental impact. The author implicitly argues that while technological progress is celebrated, the natural world's capacity to absorb these demands is being severely tested, prompting a reevaluation of AI's long-term sustainability.",
    "keywords": [
      "AI Sustainability",
      "Environmental Impact",
      "Resource Consumption",
      "Data Centers",
      "Energy Efficiency",
      "AI Ethics",
      "Climate Change AI"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Others"
    ],
    "published_time": "2025-12-23 19:07:01",
    "download_time": "2025-12-23 20:03:26",
    "extra_info": "{\"score\": 6, \"by\": \"mmaunder\", \"descendants\": 0, \"story_id\": 46368263}"
  },
  {
    "id": "hackernews_46366998",
    "source": "Hacker News",
    "url": "https://www.phoronix.com/news/Meta-SCX-LAVD-Steam-Deck-Server",
    "title": "Meta is using the Linux scheduler designed for Valve's Steam Deck on its servers",
    "summary": "Meta Platforms is reportedly integrating the SCX (Scheduler Core X) Linux scheduler, initially developed for Valve's Steam Deck, into its vast server infrastructure. This adoption signifies a strategic move to leverage a scheduler optimized for interactive, low-latency applications within a large-scale data center environment, moving beyond its initial gaming-centric purpose. The SCX scheduler's design principles, focused on efficient resource utilization, fairness, and responsiveness, are now being applied to Meta's diverse workloads, which likely include demanding AI/ML computations and media processing. This cross-domain deployment highlights an interesting development in operating system kernel optimization, suggesting potential benefits in areas such as improved overall system performance, reduced latency for critical services, and enhanced resource management across Meta's extensive server farms. The initiative underscores the adaptability of specialized kernel components to broader enterprise applications, potentially impacting how major tech companies manage their computational resources for a wide array of services and highlighting Valve's contribution to broader Linux ecosystem.",
    "keywords": [
      "Linux scheduler",
      "Meta Platforms",
      "Steam Deck",
      "SCX",
      "Server infrastructure",
      "Operating systems",
      "Performance optimization",
      "Data centers"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "Others"
    ],
    "published_time": "2025-12-23 17:08:34",
    "download_time": "2025-12-23 20:02:58",
    "extra_info": "{\"score\": 284, \"by\": \"yellow_lead\", \"descendants\": 135, \"story_id\": 46366998}"
  },
  {
    "id": "hackernews_46363751",
    "source": "Hacker News",
    "url": "https://carnap.io/",
    "title": "Carnap – A formal logic framework for Haskell",
    "summary": "Carnap is presented as a dedicated formal logic framework built for the Haskell programming language, offering a robust environment for developing applications that demand rigorous logical reasoning and formal verification. This framework is designed to empower developers and researchers by integrating advanced logical capabilities directly within Haskell's functional programming paradigm. It leverages the language's strong type system to ensure precision and correctness, making it suitable for tasks such as automated theorem proving, model checking, and the development of declarative knowledge representation systems. Carnap’s utility extends across various domains, including higher education for teaching logic and computer science principles, as well as in professional settings where software correctness is critical, such as in formal methods for critical software systems or the construction of symbolic Artificial Intelligence components. By providing a solid foundation for building intelligent systems with explicit and verifiable logical structures, Carnap significantly contributes to advancements in automated reasoning and the broader field of symbolic AI.",
    "keywords": [
      "Formal Logic",
      "Haskell",
      "Programming Framework",
      "Automated Reasoning",
      "Theorem Proving",
      "Symbolic AI",
      "Software Verification"
    ],
    "area": [
      "Artificial Intelligence",
      "Others",
      "AI Agent"
    ],
    "published_time": "2025-12-23 09:17:42",
    "download_time": "2025-12-23 20:03:15",
    "extra_info": "{\"score\": 94, \"by\": \"ravenical\", \"descendants\": 19, \"story_id\": 46363751}"
  },
  {
    "id": "2512.19682",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.19682",
    "title": "GenEnv: Difficulty-Aligned Co-Evolution Between LLM Agents and Environment Simulators",
    "summary": "Training capable Large Language Model (LLM) agents is critically bottlenecked by the high cost and static nature of real-world interaction data. We address this by introducing GenEnv, a framework that establishes a difficulty-aligned co-evolutionary game between an agent and a scalable, generative environment simulator. Unlike traditional methods that evolve models on static datasets, GenEnv instantiates a data-evolving: the simulator acts as a dynamic curriculum policy, continuously generating tasks specifically tailored to the agent's ``zone of proximal development''. This process is guided by a simple but effective α-Curriculum Reward, which aligns task difficulty with the agent's current capabilities. We evaluate GenEnv on five benchmarks, including API-Bank, ALFWorld, BFCL, Bamboogle, and TravelPlanner. Across these tasks, GenEnv improves agent performance by up to +40.3% over 7B baselines and matches or exceeds the average performance of larger models. Compared to Gemini 2.5 Pro-based offline data augmentation, GenEnv achieves better performance while using 3.3times less data. By shifting from static supervision to adaptive simulation, GenEnv provides a data-efficient pathway for scaling agent capabilities.",
    "keywords": [
      "LLM Agents",
      "Environment Simulators",
      "Co-evolution",
      "Curriculum Learning",
      "Generative AI"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Generative AI"
    ],
    "published_time": "2025-12-22T18:57:13.000Z",
    "download_time": "2025-12-23 12:03:35",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.19682\", \"arxiv_url\": \"https://arxiv.org/abs/2512.19682\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.19682.png\", \"original_title\": \"GenEnv: Difficulty-Aligned Co-Evolution Between LLM Agents and Environment Simulators\"}"
  },
  {
    "id": "2512.19678",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.19678",
    "title": "WorldWarp: Propagating 3D Geometry with Asynchronous Video Diffusion",
    "summary": "Generating long-range, geometrically consistent video presents a fundamental dilemma: while consistency demands strict adherence to 3D geometry in pixel space, state-of-the-art generative models operate most effectively in a camera-conditioned latent space. This disconnect causes current methods to struggle with occluded areas and complex camera trajectories. To bridge this gap, we propose WorldWarp, a framework that couples a 3D structural anchor with a 2D generative refiner. To establish geometric grounding, WorldWarp maintains an online 3D geometric cache built via Gaussian Splatting (3DGS). By explicitly warping historical content into novel views, this cache acts as a structural scaffold, ensuring each new frame respects prior geometry. However, static warping inevitably leaves holes and artifacts due to occlusions. We address this using a Spatio-Temporal Diffusion (ST-Diff) model designed for a \"fill-and-revise\" objective. Our key innovation is a spatio-temporal varying noise schedule: blank regions receive full noise to trigger generation, while warped regions receive partial noise to enable refinement. By dynamically updating the 3D cache at every step, WorldWarp maintains consistency across video chunks. Consequently, it achieves state-of-the-art fidelity by ensuring that 3D logic guides structure while diffusion logic perfects texture. Project page: https://hyokong.github.io/worldwarp-page/{https://hyokong.github.io/worldwarp-page/}.",
    "keywords": [
      "Video Generation",
      "3D Geometry",
      "Diffusion Models",
      "Gaussian Splatting",
      "Geometric Consistency"
    ],
    "area": [
      "Generative AI",
      "Computer Vision",
      "Deep Learning"
    ],
    "published_time": "2025-12-22T18:53:50.000Z",
    "download_time": "2025-12-23 12:03:36",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.19678\", \"arxiv_url\": \"https://arxiv.org/abs/2512.19678\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.19678.png\", \"original_title\": \"WorldWarp: Propagating 3D Geometry with Asynchronous Video Diffusion\"}"
  },
  {
    "id": "2512.19539",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.19539",
    "title": "StoryMem: Multi-shot Long Video Storytelling with Memory",
    "summary": "Visual storytelling requires generating multi-shot videos with cinematic quality and long-range consistency. Inspired by human memory, we propose StoryMem, a paradigm that reformulates long-form video storytelling as iterative shot synthesis conditioned on explicit visual memory, transforming pre-trained single-shot video diffusion models into multi-shot storytellers. This is achieved by a novel Memory-to-Video (M2V) design, which maintains a compact and dynamically updated memory bank of keyframes from historical generated shots. The stored memory is then injected into single-shot video diffusion models via latent concatenation and negative RoPE shifts with only LoRA fine-tuning. A semantic keyframe selection strategy, together with aesthetic preference filtering, further ensures informative and stable memory throughout generation. Moreover, the proposed framework naturally accommodates smooth shot transitions and customized story generation applications. To facilitate evaluation, we introduce ST-Bench, a diverse benchmark for multi-shot video storytelling. Extensive experiments demonstrate that StoryMem achieves superior cross-shot consistency over previous methods while preserving high aesthetic quality and prompt adherence, marking a significant step toward coherent minute-long video storytelling.",
    "keywords": [
      "Visual Storytelling",
      "Multi-shot Video Generation",
      "Memory-to-Video",
      "Video Diffusion Models",
      "Cross-shot Consistency"
    ],
    "area": [
      "Computer Vision",
      "Deep Learning",
      "Generative AI"
    ],
    "published_time": "2025-12-22T16:23:24.000Z",
    "download_time": "2025-12-23 12:03:35",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.19539\", \"arxiv_url\": \"https://arxiv.org/abs/2512.19539\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.19539.png\", \"original_title\": \"StoryMem: Multi-shot Long Video Storytelling with Memory\"}"
  },
  {
    "id": "2512.19432",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.19432",
    "title": "MobileWorld: Benchmarking Autonomous Mobile Agents in Agent-User Interactive, and MCP-Augmented Environments",
    "summary": "Among existing online mobile-use benchmarks, AndroidWorld has emerged as the dominant benchmark due to its reproducible environment and deterministic evaluation; however, recent agents achieving over 90% success rates indicate its saturation and motivate the need for a more challenging benchmark. In addition, its environment lacks key application categories, such as e-commerce and enterprise communication, and does not reflect realistic mobile-use scenarios characterized by vague user instructions and hybrid tool usage. To bridge this gap, we introduce MobileWorld, a substantially more challenging benchmark designed to better reflect real-world mobile usage, comprising 201 tasks across 20 applications, while maintaining the same level of reproducible evaluation as AndroidWorld. The difficulty of MobileWorld is twofold. First, it emphasizes long-horizon tasks with cross-application interactions: MobileWorld requires nearly twice as many task-completion steps on average (27.8 vs. 14.3) and includes far more multi-application tasks (62.2% vs. 9.5%) compared to AndroidWorld. Second, MobileWorld extends beyond standard GUI manipulation by introducing novel task categories, including agent-user interaction and MCP-augmented tasks. To ensure robust evaluation, we provide snapshot-based container environment and precise functional verifications, including backend database inspection and task callback APIs. We further develop a planner-executor agentic framework with extended action spaces to support user interactions and MCP calls. Our results reveal a sharp performance drop compared to AndroidWorld, with the best agentic framework and end-to-end model achieving 51.7% and 20.9% success rates, respectively. Our analysis shows that current models struggle significantly with user interaction and MCP calls, offering a strategic roadmap toward more robust, next-generation mobile intelligence.",
    "keywords": [
      "MobileWorld",
      "Autonomous Mobile Agents",
      "Benchmarking",
      "Agent-User Interaction",
      "Mobile Intelligence"
    ],
    "area": [
      "AI Agent",
      "Artificial Intelligence",
      "Machine Learning"
    ],
    "published_time": "2025-12-22T14:31:28.000Z",
    "download_time": "2025-12-23 12:03:36",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.19432\", \"arxiv_url\": \"https://arxiv.org/abs/2512.19432\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.19432.png\", \"original_title\": \"MobileWorld: Benchmarking Autonomous Mobile Agents in Agent-User Interactive, and MCP-Augmented Environments\"}"
  },
  {
    "id": "2512.19399",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.19399",
    "title": "Brain-Grounded Axes for Reading and Steering LLM States",
    "summary": "Interpretability methods for large language models (LLMs) typically derive directions from textual supervision, which can lack external grounding. We propose using human brain activity not as a training signal but as a coordinate system for reading and steering LLM states. Using the SMN4Lang MEG dataset, we construct a word-level brain atlas of phase-locking value (PLV) patterns and extract latent axes via ICA. We validate axes with independent lexica and NER-based labels (POS/log-frequency used as sanity checks), then train lightweight adapters that map LLM hidden states to these brain axes without fine-tuning the LLM. Steering along the resulting brain-derived directions yields a robust lexical (frequency-linked) axis in a mid TinyLlama layer, surviving perplexity-matched controls, and a brain-vs-text probe comparison shows larger log-frequency shifts (relative to the text probe) with lower perplexity for the brain axis. A function/content axis (axis 13) shows consistent steering in TinyLlama, Qwen2-0.5B, and GPT-2, with PPL-matched text-level corroboration. Layer-4 effects in TinyLlama are large but inconsistent, so we treat them as secondary (Appendix). Axis structure is stable when the atlas is rebuilt without GPT embedding-change features or with word2vec embeddings (|r|=0.64-0.95 across matched axes), reducing circularity concerns. Exploratory fMRI anchoring suggests potential alignment for embedding change and log frequency, but effects are sensitive to hemodynamic modeling assumptions and are treated as population-level evidence only. These results support a new interface: neurophysiology-grounded axes provide interpretable and controllable handles for LLM behavior.",
    "keywords": [
      "Large Language Models",
      "Neurophysiology",
      "Interpretability",
      "Model Steering",
      "Brain-Grounded Axes"
    ],
    "area": [
      "Large Language Model",
      "Natural Language Processing",
      "Deep Learning"
    ],
    "published_time": "2025-12-22T13:51:03.000Z",
    "download_time": "2025-12-23 12:03:36",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.19399\", \"arxiv_url\": \"https://arxiv.org/abs/2512.19399\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.19399.png\", \"original_title\": \"Brain-Grounded Axes for Reading and Steering LLM States\"}"
  },
  {
    "id": "2512.19134",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2512.19134",
    "title": "QuCo-RAG: Quantifying Uncertainty from the Pre-training Corpus for Dynamic Retrieval-Augmented Generation",
    "summary": "Dynamic Retrieval-Augmented Generation adaptively determines when to retrieve during generation to mitigate hallucinations in large language models (LLMs). However, existing methods rely on model-internal signals (e.g., logits, entropy), which are fundamentally unreliable because LLMs are typically ill-calibrated and often exhibit high confidence in erroneous outputs. We propose QuCo-RAG, which shifts from subjective confidence to objective statistics computed from pre-training data. Our method quantifies uncertainty through two stages: (1) before generation, we identify low-frequency entities indicating long-tail knowledge gaps; (2) during generation, we verify entity co-occurrence in the pre-training corpus, where zero co-occurrence often signals hallucination risk. Both stages leverage Infini-gram for millisecond-latency queries over 4 trillion tokens, triggering retrieval when uncertainty is high. Experiments on multi-hop QA benchmarks show QuCo-RAG achieves EM gains of 5--12 points over state-of-the-art baselines with OLMo-2 models, and transfers effectively to models with undisclosed pre-training data (Llama, Qwen, GPT), improving EM by up to 14 points. Domain generalization on biomedical QA further validates the robustness of our paradigm. These results establish corpus-grounded verification as a principled, practically model-agnostic paradigm for dynamic RAG. Our code is publicly available at https://github.com/ZhishanQ/QuCo-RAG.",
    "keywords": [
      "Retrieval-Augmented Generation",
      "Large Language Models",
      "Uncertainty Quantification",
      "Hallucination Mitigation",
      "Pre-training Corpus"
    ],
    "area": [
      "Natural Language Processing",
      "Large Language Model",
      "Generative AI"
    ],
    "published_time": "2025-12-22T08:28:05.000Z",
    "download_time": "2025-12-23 12:03:35",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2512.19134\", \"arxiv_url\": \"https://arxiv.org/abs/2512.19134\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2512.19134.png\", \"original_title\": \"QuCo-RAG: Quantifying Uncertainty from the Pre-training Corpus for Dynamic Retrieval-Augmented Generation\"}"
  }
]