[
  {
    "id": "hackernews_46766741",
    "source": "Hacker News",
    "url": "https://qwen.ai/blog?id=qwen3-max-thinking",
    "title": "Qwen3-Max-Thinking",
    "summary": "The announcement titled \"Qwen3-Max-Thinking\" from Qwen.ai likely indicates a significant upgrade or a new feature introduction for the Qwen3-Max large language model. While specific technical details are not immediately available from the provided content, the term \"Thinking\" strongly implies advancements in the model's cognitive capabilities, particularly in areas like logical reasoning, complex problem-solving, and sophisticated decision-making. This enhancement suggests Qwen3-Max is being equipped with more advanced internal mechanisms to process information, infer meaning, and generate more coherent and contextually relevant responses, moving beyond mere pattern recognition. Such a development would be pivotal for applications requiring deeper analytical prowess and strategic planning, potentially impacting fields from scientific research to enterprise automation. This release reinforces the competitive landscape of large language models, emphasizing the continuous drive towards more intelligent and autonomous AI systems.",
    "keywords": [
      "Qwen3-Max",
      "Large Language Model",
      "AI",
      "Reasoning",
      "Cognitive AI",
      "Neural Networks"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2026-01-26 15:23:00",
    "download_time": "2026-01-26 20:00:33",
    "extra_info": "{\"score\": 328, \"by\": \"vinhnx\", \"descendants\": 281, \"story_id\": 46766741}"
  },
  {
    "id": "hackernews_46766432",
    "source": "Hacker News",
    "url": "https://llmspy.org/docs/v3",
    "title": "OSS ChatGPT WebUI – 530 Models, MCP, Tools, Gemini RAG, Image/Audio Gen",
    "summary": "The OSS ChatGPT WebUI project, detailed at llmspy.org/docs/v3, introduces an advanced open-source web interface engineered for comprehensive interaction with a multitude of artificial intelligence models. This robust platform is designed to support an impressive range of over 530 distinct models, offering unparalleled flexibility and choice for both developers and end-users. Central to its feature set are capabilities such as Multi-Agent Conversation Protocol (MCP) integration, a diverse suite of AI tools, and sophisticated Gemini Retrieval Augmented Generation (RAG) functionality, which significantly enhances the accuracy and relevance of AI responses. Moreover, the WebUI extends its utility into multimodal content creation, incorporating powerful image and audio generation features. This initiative aims to provide a versatile and powerful ecosystem for exploring, experimenting with, and deploying various large language models, thereby advancing conversational AI applications and streamlining generative media workflows within an open and collaborative framework. Its commitment to open-source principles encourages community engagement and democratizes access to state-of-the-art AI technologies.",
    "keywords": [
      "Open-source",
      "Large Language Models",
      "ChatGPT WebUI",
      "Retrieval Augmented Generation",
      "Multimodal AI",
      "Image Generation",
      "Audio Generation",
      "AI Tools"
    ],
    "area": [
      "Large Language Model",
      "Multimodal",
      "Generative AI"
    ],
    "published_time": "2026-01-26 15:01:03",
    "download_time": "2026-01-26 20:00:46",
    "extra_info": "{\"score\": 81, \"by\": \"mythz\", \"descendants\": 21, \"story_id\": 46766432}"
  },
  {
    "id": "hackernews_46764170",
    "source": "Hacker News",
    "url": "https://github.com/kxzk/snapbench",
    "title": "Show HN: Only 1 LLM can fly a drone",
    "summary": "A new project, \"snapbench,\" has been unveiled, proposing a novel benchmark designed to rigorously assess the capacity of Large Language Models (LLMs) to perform real-world control tasks, specifically focusing on the complex domain of drone flight. The accompanying title, \"Only 1 LLM can fly a drone,\" starkly illustrates the current limitations and significant challenges faced by contemporary LLMs in translating abstract understanding into concrete physical actions. This initiative underscores the critical gap between advanced language processing capabilities and the precise, real-time control required for autonomous robotic systems. The snapbench platform aims to standardize the evaluation of LLMs in areas such as environmental perception, strategic mission planning, and accurate execution of commands within a dynamic, physical environment. By establishing clear metrics for success in drone operation, this benchmark is expected to catalyze further research and development towards creating more robust and physically capable AI agents, thereby accelerating the integration of LLMs into advanced robotics and automation scenarios.",
    "keywords": [
      "Large Language Model",
      "Robotics",
      "Drone Control",
      "AI Agent",
      "Benchmarking",
      "Autonomous Systems"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Robotics"
    ],
    "published_time": "2026-01-26 11:00:44",
    "download_time": "2026-01-26 20:00:48",
    "extra_info": "{\"score\": 107, \"by\": \"beigebrucewayne\", \"descendants\": 62, \"story_id\": 46764170}"
  },
  {
    "id": "hackernews_46765694",
    "source": "Hacker News",
    "url": "https://blog.vjeux.com/2026/analysis/porting-100k-lines-from-typescript-to-rust-using-claude-code-in-a-month.html",
    "title": "Porting 100k lines from TypeScript to Rust using Claude Code in a month",
    "summary": "A significant project successfully migrated a 100,000-line codebase from TypeScript to Rust within a single month, an accomplishment largely facilitated by the use of Claude Code, an advanced AI code assistant. This initiative highlights the burgeoning capabilities of large language models in streamlining complex software engineering challenges, particularly in the domain of language porting and large-scale code refactoring. The rapid turnaround for such an extensive code transformation demonstrates the transformative potential of AI-driven development to drastically shorten traditional development cycles and overcome the manual overhead typically associated with large-scale code migrations. This case study signals a new era for developer productivity, showcasing how sophisticated AI tools can enable efficient and swift modernization of software systems by automating substantial portions of the code translation process. The success of this project suggests that AI assistants are poised to play a pivotal role in accelerating cross-language development and maintenance efforts, offering considerable implications for enterprise-level software upgrades and platform transitions.",
    "keywords": [
      "TypeScript",
      "Rust",
      "Code Porting",
      "AI Code Assistant",
      "Large Language Model",
      "Software Migration"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Generative AI"
    ],
    "published_time": "2026-01-26 13:58:27",
    "download_time": "2026-01-26 20:01:03",
    "extra_info": "{\"score\": 117, \"by\": \"ibobev\", \"descendants\": 82, \"story_id\": 46765694}"
  },
  {
    "id": "hackernews_46769752",
    "source": "Hacker News",
    "url": "https://tetrisbench.com/tetrisbench/",
    "title": "Show HN: TetrisBench – Gemini Flash reaches 66% win rate on Tetris against Opus",
    "summary": "TetrisBench, a new platform showcased on Hacker News, provides a dedicated environment for benchmarking the performance of artificial intelligence models in the classic game of Tetris. Recent findings from TetrisBench reveal a significant achievement by Google's Gemini Flash model, demonstrating a 66% win rate when pitted against the more powerful Gemini Opus model. This outcome is particularly compelling as it suggests that a more compact and potentially faster iteration, such as Gemini Flash, can achieve superior or highly competitive performance in a specific, rule-bound task like Tetris, even when compared to its larger counterpart. This benchmark highlights the growing efficacy of specialized AI models and optimizations that allow for efficient resource utilization without compromising performance in targeted domains. This development has important implications for the design and deployment of AI agents, emphasizing that model size does not always directly correlate with optimal performance across all applications. TetrisBench could serve as a valuable tool for future research into AI game playing, model efficiency, and comparative analysis of different AI architectures.",
    "keywords": [
      "AI Gaming",
      "Gemini AI",
      "AI Benchmark",
      "Model Performance",
      "Machine Learning",
      "Game AI",
      "AI Efficiency",
      "Tetris"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2026-01-26 18:42:40",
    "download_time": "2026-01-26 20:00:37",
    "extra_info": "{\"score\": 15, \"by\": \"ykhli\", \"descendants\": 5, \"story_id\": 46769752}"
  },
  {
    "id": "hackernews_46766031",
    "source": "Hacker News",
    "url": "https://www.theguardian.com/technology/2026/jan/24/google-ai-overviews-youtube-medical-citations-study",
    "title": "Google AI Overviews cite YouTube more than any medical site for health queries",
    "summary": "A recent study indicates that Google's AI Overviews, a feature designed to provide synthesized answers directly within search results, disproportionately cites YouTube content over established medical websites when responding to health-related queries. This finding raises significant concerns regarding the accuracy, reliability, and potential for misinformation within AI-generated health information. The analysis suggests that the underlying AI models may prioritize readily available or highly trafficked content, even if it lacks the authoritative medical vetting of dedicated health platforms. Experts are highlighting the critical implications for public health, emphasizing the necessity for robust content provenance and stringent fact-checking mechanisms within AI systems, particularly when dealing with sensitive domains such as health. The study underscores a pivotal challenge in the responsible deployment of AI in information retrieval, stressing the need for search providers to refine their AI algorithms to ensure that the information presented is consistently sourced from credible and expert-reviewed entities, thereby safeguarding user trust and public well-being.",
    "keywords": [
      "Google AI Overviews",
      "AI in healthcare",
      "information retrieval",
      "source reliability",
      "health queries",
      "AI ethics",
      "search engines",
      "large language models"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2026-01-26 14:27:00",
    "download_time": "2026-01-26 20:00:36",
    "extra_info": "{\"score\": 268, \"by\": \"bookofjoe\", \"descendants\": 140, \"story_id\": 46766031}"
  },
  {
    "id": "2601.16725",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.16725",
    "title": "LongCat-Flash-Thinking-2601 Technical Report",
    "summary": "We introduce LongCat-Flash-Thinking-2601, a 560-billion-parameter open-source Mixture-of-Experts (MoE) reasoning model with superior agentic reasoning capability. LongCat-Flash-Thinking-2601 achieves state-of-the-art performance among open-source models on a wide range of agentic benchmarks, including agentic search, agentic tool use, and tool-integrated reasoning. Beyond benchmark performance, the model demonstrates strong generalization to complex tool interactions and robust behavior under noisy real-world environments. Its advanced capability stems from a unified training framework that combines domain-parallel expert training with subsequent fusion, together with an end-to-end co-design of data construction, environments, algorithms, and infrastructure spanning from pre-training to post-training. In particular, the model's strong generalization capability in complex tool-use are driven by our in-depth exploration of environment scaling and principled task construction. To optimize long-tailed, skewed generation and multi-turn agentic interactions, and to enable stable training across over 10,000 environments spanning more than 20 domains, we systematically extend our asynchronous reinforcement learning framework, DORA, for stable and efficient large-scale multi-environment training. Furthermore, recognizing that real-world tasks are inherently noisy, we conduct a systematic analysis and decomposition of real-world noise patterns, and design targeted training procedures to explicitly incorporate such imperfections into the training process, resulting in improved robustness for real-world applications. To further enhance performance on complex reasoning tasks, we introduce a Heavy Thinking mode that enables effective test-time scaling by jointly expanding reasoning depth and width through intensive parallel thinking.",
    "keywords": [
      "Mixture-of-Experts",
      "Agentic Reasoning",
      "Reinforcement Learning",
      "Large Language Model",
      "Tool Use"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Deep Learning"
    ],
    "published_time": "2026-01-23T13:20:09.000Z",
    "download_time": "2026-01-26 12:01:34",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.16725\", \"arxiv_url\": \"https://arxiv.org/abs/2601.16725\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.16725.png\", \"original_title\": \"LongCat-Flash-Thinking-2601 Technical Report\"}"
  },
  {
    "id": "2601.16296",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.16296",
    "title": "Memory-V2V: Augmenting Video-to-Video Diffusion Models with Memory",
    "summary": "Recent foundational video-to-video diffusion models have achieved impressive results in editing user provided videos by modifying appearance, motion, or camera movement. However, real-world video editing is often an iterative process, where users refine results across multiple rounds of interaction. In this multi-turn setting, current video editors struggle to maintain cross-consistency across sequential edits. In this work, we tackle, for the first time, the problem of cross-consistency in multi-turn video editing and introduce Memory-V2V, a simple, yet effective framework that augments existing video-to-video models with explicit memory. Given an external cache of previously edited videos, Memory-V2V employs accurate retrieval and dynamic tokenization strategies to condition the current editing step on prior results. To further mitigate redundancy and computational overhead, we propose a learnable token compressor within the DiT backbone that compresses redundant conditioning tokens while preserving essential visual cues, achieving an overall speedup of 30%. We validate Memory-V2V on challenging tasks including video novel view synthesis and text-conditioned long video editing. Extensive experiments show that Memory-V2V produces videos that are significantly more cross-consistent with minimal computational overhead, while maintaining or even improving task-specific performance over state-of-the-art baselines. Project page: https://dohunlee1.github.io/MemoryV2V",
    "keywords": [
      "Video-to-Video Diffusion Models",
      "Multi-turn Video Editing",
      "Cross-consistency",
      "Memory-V2V",
      "Token Compressor"
    ],
    "area": [
      "Generative AI",
      "Deep Learning",
      "Computer Vision"
    ],
    "published_time": "2026-01-22T19:59:17.000Z",
    "download_time": "2026-01-26 12:01:32",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.16296\", \"arxiv_url\": \"https://arxiv.org/abs/2601.16296\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.16296.png\", \"original_title\": \"Memory-V2V: Augmenting Video-to-Video Diffusion Models with Memory\"}"
  },
  {
    "id": "2601.16746",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.16746",
    "title": "SWE-Pruner: Self-Adaptive Context Pruning for Coding Agents",
    "summary": "LLM agents have demonstrated remarkable capabilities in software development, but their performance is hampered by long interaction contexts, which incur high API costs and latency. While various context compression approaches such as LongLLMLingua has emerged to tackle this challenge, they typically rely on fixed metrics such as PPL, ignoring the task-specific nature of code understanding. As a result, they frequently disrupt syntactic and logical structure and fail to retain critical implementation details. In this paper, we propose SWE-Pruner, a self-adaptive context pruning framework tailored for coding agents. Drawing inspiration from how human programmers \"selectively skim\" source code during development and debugging, SWE-Pruner performs task-aware adaptive pruning for long contexts. Given the current task, the agent formulates an explicit goal (e.g., \"focus on error handling\") as a hint to guide the pruning targets. A lightweight neural skimmer (0.6B parameters) is trained to dynamically select relevant lines from the surrounding context given the goal. Evaluations across four benchmarks and multiple models validate SWE-Pruner's effectiveness in various scenarios, achieving 23-54% token reduction on agent tasks like SWE-Bench Verified and up to 14.84x compression on single-turn tasks like LongCodeQA with minimal performance impact.",
    "keywords": [
      "LLM agents",
      "context pruning",
      "coding agents",
      "self-adaptive",
      "software development"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Deep Learning"
    ],
    "published_time": "2026-01-23T13:51:59.000Z",
    "download_time": "2026-01-26 12:01:32",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.16746\", \"arxiv_url\": \"https://arxiv.org/abs/2601.16746\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.16746.png\", \"original_title\": \"SWE-Pruner: Self-Adaptive Context Pruning for Coding Agents\"}"
  },
  {
    "id": "2601.14243",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.14243",
    "title": "Jet-RL: Enabling On-Policy FP8 Reinforcement Learning with Unified Training and Rollout Precision Flow",
    "summary": "Reinforcement learning (RL) is essential for enhancing the complex reasoning capabilities of large language models (LLMs). However, existing RL training pipelines are computationally inefficient and resource-intensive, with the rollout phase accounting for over 70% of total training time. Quantized RL training, particularly using FP8 precision, offers a promising approach to mitigating this bottleneck. A commonly adopted strategy applies FP8 precision during rollout while retaining BF16 precision for training. In this work, we present the first comprehensive study of FP8 RL training and demonstrate that the widely used BF16-training + FP8-rollout strategy suffers from severe training instability and catastrophic accuracy collapse under long-horizon rollouts and challenging tasks. Our analysis shows that these failures stem from the off-policy nature of the approach, which introduces substantial numerical mismatch between training and inference. Motivated by these observations, we propose Jet-RL, an FP8 RL training framework that enables robust and stable RL optimization. The key idea is to adopt a unified FP8 precision flow for both training and rollout, thereby minimizing numerical discrepancies and eliminating the need for inefficient inter-step calibration. Extensive experiments validate the effectiveness of Jet-RL: our method achieves up to 33% speedup in the rollout phase, up to 41% speedup in the training phase, and a 16% end-to-end speedup over BF16 training, while maintaining stable convergence across all settings and incurring negligible accuracy degradation.",
    "keywords": [
      "Reinforcement Learning",
      "FP8 Quantization",
      "Large Language Models",
      "Training Stability",
      "Computational Efficiency"
    ],
    "area": [
      "Machine Learning",
      "Deep Learning",
      "Large Language Model"
    ],
    "published_time": "2026-01-20T18:54:31.000Z",
    "download_time": "2026-01-26 12:01:35",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.14243\", \"arxiv_url\": \"https://arxiv.org/abs/2601.14243\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.14243.png\", \"original_title\": \"Jet-RL: Enabling On-Policy FP8 Reinforcement Learning with Unified Training and Rollout Precision Flow\"}"
  },
  {
    "id": "2601.15808",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.15808",
    "title": "Inference-Time Scaling of Verification: Self-Evolving Deep Research Agents via Test-Time Rubric-Guided Verification",
    "summary": "Recent advances in Deep Research Agents (DRAs) are transforming automated knowledge discovery and problem-solving. While the majority of existing efforts focus on enhancing policy capabilities via post-training, we propose an alternative paradigm: self-evolving the agent's ability by iteratively verifying the policy model's outputs, guided by meticulously crafted rubrics. This approach gives rise to the inference-time scaling of verification, wherein an agent self-improves by evaluating its generated answers to produce iterative feedback and refinements. We derive the rubrics based on an automatically constructed DRA Failure Taxonomy, which systematically classifies agent failures into five major categories and thirteen sub-categories. We present DeepVerifier, a rubrics-based outcome reward verifier that leverages the asymmetry of verification and outperforms vanilla agent-as-judge and LLM judge baselines by 12%-48% in meta-evaluation F1 score. To enable practical self-evolution, DeepVerifier integrates as a plug-and-play module during test-time inference. The verifier produces detailed rubric-based feedback, which is fed back to the agent for iterative bootstrapping, refining responses without additional training. This test-time scaling delivers 8%-11% accuracy gains on challenging subsets of GAIA and XBench-DeepResearch when powered by capable closed-source LLMs. Finally, to support open-source advancement, we release DeepVerifier-4K, a curated supervised fine-tuning dataset of 4,646 high-quality agent steps focused on DRA verification. These examples emphasize reflection and self-critique, enabling open models to develop robust verification capabilities.",
    "keywords": [
      "Deep Research Agents",
      "Inference-Time Verification",
      "Self-Evolving Agents",
      "Rubric-Guided Feedback",
      "DeepVerifier"
    ],
    "area": [
      "AI Agent",
      "Large Language Model",
      "Artificial Intelligence"
    ],
    "published_time": "2026-01-22T09:47:31.000Z",
    "download_time": "2026-01-26 12:01:32",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.15808\", \"arxiv_url\": \"https://arxiv.org/abs/2601.15808\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.15808.png\", \"original_title\": \"Inference-Time Scaling of Verification: Self-Evolving Deep Research Agents via Test-Time Rubric-Guided Verification\"}"
  },
  {
    "id": "2601.16973",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.16973",
    "title": "VisGym: Diverse, Customizable, Scalable Environments for Multimodal Agents",
    "summary": "Modern Vision-Language Models (VLMs) remain poorly characterized in multi-step visual interactions, particularly in how they integrate perception, memory, and action over long horizons. We introduce VisGym, a gymnasium of 17 environments for evaluating and training VLMs. The suite spans symbolic puzzles, real-image understanding, navigation, and manipulation, and provides flexible controls over difficulty, input representation, planning horizon, and feedback. We also provide multi-step solvers that generate structured demonstrations, enabling supervised finetuning. Our evaluations show that all frontier models struggle in interactive settings, achieving low success rates in both the easy (46.6%) and hard (26.0%) configurations. Our experiments reveal notable limitations: models struggle to effectively leverage long context, performing worse with an unbounded history than with truncated windows. Furthermore, we find that several text-based symbolic tasks become substantially harder once rendered visually. However, explicit goal observations, textual feedback, and exploratory demonstrations in partially observable or unknown-dynamics settings for supervised finetuning yield consistent gains, highlighting concrete failure modes and pathways for improving multi-step visual decision-making. Code, data, and models can be found at: https://visgym.github.io/.",
    "keywords": [
      "Vision-Language Models",
      "Multimodal Agents",
      "Interactive Environments",
      "Visual Decision-Making",
      "Supervised Finetuning"
    ],
    "area": [
      "Multimodal",
      "AI Agent",
      "Computer Vision"
    ],
    "published_time": "2026-01-23T18:43:34.000Z",
    "download_time": "2026-01-26 12:01:34",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.16973\", \"arxiv_url\": \"https://arxiv.org/abs/2601.16973\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.16973.png\", \"original_title\": \"VisGym: Diverse, Customizable, Scalable Environments for Multimodal Agents\"}"
  }
]