[
  {
    "id": "hackernews_46854999",
    "source": "Hacker News",
    "url": "https://www.theverge.com/tech/865689/microsoft-claude-code-anthropic-partnership-notepad",
    "title": "Claude Code is suddenly everywhere inside Microsoft",
    "summary": "Microsoft is reportedly experiencing a rapid and extensive integration of \"Claude Code\" across its internal systems and potentially customer-facing products, signaling a significant expansion of its partnership with Anthropic, the developer of the Claude large language model. This widespread adoption suggests Microsoft's strategic move to embed Anthropic's advanced AI capabilities into various facets of its software ecosystem, potentially complementing its existing AI collaborations. The integration of Claude's technology, known for its strong performance in natural language processing and sophisticated reasoning, is expected to enhance functionalities such as code generation, content creation, and intelligent assistance within Microsoft applications, as hinted by the URL mentioning Notepad. This development underscores Microsoft's commitment to accelerating the deployment of generative AI, offering its developers and users access to diverse, state-of-the-art AI models. The initiative aims to boost productivity, foster innovation, and enrich user experiences by bringing advanced conversational and analytical AI directly into daily workflows, marking a pivotal moment in the competitive landscape of AI adoption among tech giants.",
    "keywords": [
      "Claude AI",
      "Anthropic",
      "Microsoft",
      "Large Language Model",
      "AI Integration",
      "Generative AI",
      "Code Generation"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Generative AI"
    ],
    "published_time": "2026-02-02 11:58:58",
    "download_time": "2026-02-02 20:00:50",
    "extra_info": "{\"score\": 267, \"by\": \"Anon84\", \"descendants\": 388, \"story_id\": 46854999}"
  },
  {
    "id": "hackernews_46859054",
    "source": "Hacker News",
    "url": "https://openai.com/index/introducing-the-codex-app/",
    "title": "The Codex App",
    "summary": "OpenAI introduced the Codex App, a sophisticated artificial intelligence model designed to translate natural language into code. This innovative application represents a significant advancement in AI's ability to understand and generate programming instructions, enabling users to describe desired software functionalities in plain English and have the system generate the corresponding code. Based on OpenAI's advanced language models, Codex aims to democratize programming by making it more accessible to a wider audience, including non-developers, while also boosting the productivity of experienced programmers. The technology has notable implications for various development workflows, from rapid prototyping to debugging and script generation, solidifying its position as a transformative tool in the realm of AI-assisted software engineering.",
    "keywords": [
      "OpenAI Codex",
      "Code Generation",
      "Natural Language Processing",
      "AI Programming",
      "Developer Tools",
      "Large Language Model",
      "Software Development"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "Natural Language Processing"
    ],
    "published_time": "2026-02-02 18:02:48",
    "download_time": "2026-02-02 20:00:29",
    "extra_info": "{\"score\": 211, \"by\": \"meetpateltech\", \"descendants\": 120, \"story_id\": 46859054}"
  },
  {
    "id": "hackernews_46855447",
    "source": "Hacker News",
    "url": "https://neutree.ai/blog/nano-vllm-part-1",
    "title": "Nano-vLLM: How a vLLM-style inference engine works",
    "summary": "The article \"Nano-vLLM: How a vLLM-style inference engine works\" dissects the foundational architectural and operational principles of efficient Large Language Model (LLM) inference engines, particularly those adopting the vLLM paradigm. It elucidates key mechanisms designed to achieve superior throughput and reduced latency in LLM serving. Core concepts elaborated include continuous batching, which maximizes GPU utilization by concurrently processing multiple requests without idle periods, and PagedAttention. PagedAttention is critical for managing the KV cache by treating it as a paged memory system, akin to operating system memory management. This innovative approach effectively mitigates memory fragmentation and varying KV cache lengths across diverse requests, substantially decreasing memory wastage and optimizing memory access patterns. Grasping these components is crucial for developers and engineers aiming to optimize LLM serving infrastructure for production environments, emphasizing the importance of efficient resource allocation and scheduling in modern AI systems.",
    "keywords": [
      "vLLM",
      "Large Language Models",
      "Inference Engine",
      "PagedAttention",
      "KV Cache",
      "Continuous Batching",
      "GPU Optimization",
      "Deep Learning"
    ],
    "area": [
      "Large Language Model",
      "Deep Learning",
      "Artificial Intelligence"
    ],
    "published_time": "2026-02-02 12:52:35",
    "download_time": "2026-02-02 20:00:30",
    "extra_info": "{\"score\": 179, \"by\": \"yz-yu\", \"descendants\": 23, \"story_id\": 46855447}"
  },
  {
    "id": "hackernews_46856854",
    "source": "Hacker News",
    "url": "https://www.bloomberg.com/news/articles/2026-01-31/waymo-seeking-about-16-billion-near-110-billion-valuation",
    "title": "Waymo seeking about $16B near $110B valuation",
    "summary": "Waymo, a pioneering company in autonomous driving technology, is reportedly engaged in discussions to raise approximately $16 billion in new funding. This significant capital injection would position the company's valuation near $110 billion, signaling robust investor confidence in the long-term potential and market leadership of self-driving solutions. The substantial valuation reflects Waymo's extensive operational experience, continuous advancements in artificial intelligence and machine learning for perception and decision-making, and its strategic plans for commercial scaling across various sectors such as ride-hailing, trucking, and logistics. This fundraising initiative highlights the immense financial requirements associated with the sophisticated research, development, and deployment of fully autonomous vehicle systems. A successful funding round would further empower Waymo to accelerate its technological development, expand its service areas, and strengthen its competitive edge in the rapidly evolving global autonomous vehicle market, solidifying its role at the forefront of AI-driven mobility innovation.",
    "keywords": [
      "Autonomous Vehicles",
      "Self-Driving Technology",
      "AI Robotics",
      "Venture Capital",
      "Market Valuation",
      "Machine Learning",
      "Transportation Tech"
    ],
    "area": [
      "Artificial Intelligence",
      "Robotics",
      "Computer Vision"
    ],
    "published_time": "2026-02-02 15:08:52",
    "download_time": "2026-02-02 20:00:47",
    "extra_info": "{\"score\": 124, \"by\": \"JumpCrisscross\", \"descendants\": 161, \"story_id\": 46856854}"
  },
  {
    "id": "hackernews_46857615",
    "source": "Hacker News",
    "url": "https://www.wiz.io/blog/exposed-moltbook-database-reveals-millions-of-api-keys",
    "title": "Hacking Moltbook",
    "summary": "Cybersecurity firm Wiz has unveiled a critical security vulnerability affecting Moltbook, an innovative social media platform recognized for its integration of AI agents. This severe flaw resulted in the exposure of a database holding millions of API keys, presenting a significant and immediate risk for widespread data breaches and unauthorized system access. The implications extend to user privacy, platform integrity, and potential misuse of exposed credentials. This discovery underscores the escalating security challenges inherent in developing and operating sophisticated platforms that not only utilize artificial intelligence but also handle extensive volumes of sensitive user and operational data. Industry experts are stressing the urgent need for comprehensive security audits, continuous threat monitoring, and advanced vulnerability management strategies to fortify such AI-driven technological infrastructures against potential exploitation. The Moltbook incident serves as a crucial case study, highlighting the paramount importance of robust cybersecurity defenses in the rapidly evolving landscape of AI-powered applications to prevent similar future occurrences and protect digital assets.",
    "keywords": [
      "Moltbook",
      "API keys",
      "Database exposure",
      "Security vulnerability",
      "AI agents",
      "Cybersecurity",
      "Data breach",
      "Wiz"
    ],
    "area": [
      "AI Agent",
      "Artificial Intelligence",
      "Others"
    ],
    "published_time": "2026-02-02 16:08:36",
    "download_time": "2026-02-02 20:00:38",
    "extra_info": "{\"score\": 84, \"by\": \"galnagli\", \"descendants\": 58, \"story_id\": 46857615}"
  },
  {
    "id": "hackernews_46858873",
    "source": "Hacker News",
    "url": "https://blog.google/innovation-and-ai/models-and-research/google-deepmind/kaggle-game-arena-updates/",
    "title": "Advancing AI Benchmarking with Game Arena",
    "summary": "Google DeepMind, in collaboration with Kaggle, is making significant strides in advancing AI benchmarking through recent updates to its Game Arena platform. This initiative is designed to create a more robust and dynamic environment for rigorously evaluating the capabilities of artificial intelligence models and agents. By leveraging complex game-based scenarios, the platform offers a standardized yet diverse set of problems, allowing researchers and developers to rigorously test AI algorithms against a wide range of strategic and tactical challenges. These gaming environments are particularly effective as they can mirror real-world complexities and dynamic decision-making processes, providing deeper insights into AI performance beyond traditional datasets. The ongoing updates likely aim to enhance the accessibility, fairness, and scalability of these benchmarks, fostering innovation and accelerating progress in AI research. This approach is crucial for identifying breakthroughs and areas for improvement in AI agent development, ultimately pushing the boundaries of what AI can achieve in complex, interactive environments and facilitating a more standardized comparison of different AI approaches across the global research community.",
    "keywords": [
      "AI Benchmarking",
      "Game Arena",
      "Google DeepMind",
      "Kaggle",
      "Artificial Intelligence",
      "AI Agent",
      "Evaluation Metrics",
      "Competitive AI"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "AI Agent"
    ],
    "published_time": "2026-02-02 17:49:07",
    "download_time": "2026-02-02 20:00:32",
    "extra_info": "{\"score\": 39, \"by\": \"salkahfi\", \"descendants\": 25, \"story_id\": 46858873}"
  },
  {
    "id": "2601.21558",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.21558",
    "title": "ASTRA: Automated Synthesis of agentic Trajectories and Reinforcement Arenas",
    "summary": "Large language models (LLMs) are increasingly used as tool-augmented agents for multi-step decision making, yet training robust tool-using agents remains challenging. Existing methods still require manual intervention, depend on non-verifiable simulated environments, rely exclusively on either supervised fine-tuning (SFT) or reinforcement learning (RL), and struggle with stable long-horizon, multi-turn learning. To address these challenges, we introduce ASTRA, a fully automated end-to-end framework for training tool-augmented language model agents via scalable data synthesis and verifiable reinforcement learning. ASTRA integrates two complementary components. First, a pipeline that leverages the static topology of tool-call graphs synthesizes diverse, structurally grounded trajectories, instilling broad and transferable tool-use competence. Second, an environment synthesis framework that captures the rich, compositional topology of human semantic reasoning converts decomposed question-answer traces into independent, code-executable, and rule-verifiable environments, enabling deterministic multi-turn RL. Based on this method, we develop a unified training methodology that integrates SFT with online RL using trajectory-level rewards to balance task completion and interaction efficiency. Experiments on multiple agentic tool-use benchmarks demonstrate that ASTRA-trained models achieve state-of-the-art performance at comparable scales, approaching closed-source systems while preserving core reasoning ability. We release the full pipelines, environments, and trained models at https://github.com/LianjiaTech/astra.",
    "keywords": [
      "Large Language Models",
      "AI Agent",
      "Reinforcement Learning",
      "Data Synthesis",
      "Automated Synthesis"
    ],
    "area": [
      "Large Language Model",
      "AI Agent",
      "Machine Learning"
    ],
    "published_time": "2026-01-29T11:22:23.000Z",
    "download_time": "2026-02-02 12:01:21",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.21558\", \"arxiv_url\": \"https://arxiv.org/abs/2601.21558\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.21558.png\", \"original_title\": \"ASTRA: Automated Synthesis of agentic Trajectories and Reinforcement Arenas\"}"
  },
  {
    "id": "2601.22813",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.22813",
    "title": "Quartet II: Accurate LLM Pre-Training in NVFP4 by Improved Unbiased Gradient Estimation",
    "summary": "The NVFP4 lower-precision format, supported in hardware by NVIDIA Blackwell GPUs, promises to allow, for the first time, end-to-end fully-quantized pre-training of massive models such as LLMs. Yet, existing quantized training methods still sacrifice some of the representation capacity of this format in favor of more accurate unbiased quantized gradient estimation by stochastic rounding (SR), losing noticeable accuracy relative to standard FP16 and FP8 training. In this paper, improve the state of the art for quantized training in NVFP4 via a novel unbiased quantization routine for micro-scaled formats, called MS-EDEN, that has more than 2x lower quantization error than SR. We integrate it into a novel fully-NVFP4 quantization scheme for linear layers, called Quartet II. We show analytically that Quartet II achieves consistently better gradient estimation across all major matrix multiplications, both on the forward and on the backward passes. In addition, our proposal synergizes well with recent training improvements aimed specifically at NVFP4. We further validate Quartet II on end-to-end LLM training with up to 1.9B parameters on 38B tokens. We provide kernels for execution on NVIDIA Blackwell GPUs with up to 4.2x speedup over BF16. Our code is available at https://github.com/IST-DASLab/Quartet-II .",
    "keywords": [
      "NVFP4",
      "LLM Pre-Training",
      "Quantized Training",
      "Gradient Estimation",
      "NVIDIA Blackwell GPUs"
    ],
    "area": [
      "Large Language Model",
      "Deep Learning",
      "Artificial Intelligence"
    ],
    "published_time": "2026-01-30T10:39:11.000Z",
    "download_time": "2026-02-02 12:01:19",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.22813\", \"arxiv_url\": \"https://arxiv.org/abs/2601.22813\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.22813.png\", \"original_title\": \"Quartet II: Accurate LLM Pre-Training in NVFP4 by Improved Unbiased Gradient Estimation\"}"
  },
  {
    "id": "2601.23143",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.23143",
    "title": "THINKSAFE: Self-Generated Safety Alignment for Reasoning Models",
    "summary": "Large reasoning models (LRMs) achieve remarkable performance by leveraging reinforcement learning (RL) on reasoning tasks to generate long chain-of-thought (CoT) reasoning. However, this over-optimization often prioritizes compliance, making models vulnerable to harmful prompts. To mitigate this safety degradation, recent approaches rely on external teacher distillation, yet this introduces a distributional discrepancy that degrades native reasoning. We propose ThinkSafe, a self-generated alignment framework that restores safety alignment without external teachers. Our key insight is that while compliance suppresses safety mechanisms, models often retain latent knowledge to identify harm. ThinkSafe unlocks this via lightweight refusal steering, guiding the model to generate in-distribution safety reasoning traces. Fine-tuning on these self-generated responses effectively realigns the model while minimizing distribution shift. Experiments on DeepSeek-R1-Distill and Qwen3 show ThinkSafe significantly improves safety while preserving reasoning proficiency. Notably, it achieves superior safety and comparable reasoning to GRPO, with significantly reduced computational cost. Code, models, and datasets are available at https://github.com/seanie12/ThinkSafe.git.",
    "keywords": [
      "Self-Generated Safety Alignment",
      "Reasoning Models",
      "Large Language Models",
      "Reinforcement Learning",
      "Chain-of-Thought"
    ],
    "area": [
      "Large Language Model",
      "Natural Language Processing",
      "Machine Learning"
    ],
    "published_time": "2026-01-30T16:31:02.000Z",
    "download_time": "2026-02-02 12:01:24",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.23143\", \"arxiv_url\": \"https://arxiv.org/abs/2601.23143\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.23143.png\", \"original_title\": \"THINKSAFE: Self-Generated Safety Alignment for Reasoning Models\"}"
  },
  {
    "id": "2601.21716",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.21716",
    "title": "DreamActor-M2: Universal Character Image Animation via Spatiotemporal In-Context Learning",
    "summary": "Character image animation aims to synthesize high-fidelity videos by transferring motion from a driving sequence to a static reference image. Despite recent advancements, existing methods suffer from two fundamental challenges: (1) suboptimal motion injection strategies that lead to a trade-off between identity preservation and motion consistency, manifesting as a \"see-saw\", and (2) an over-reliance on explicit pose priors (e.g., skeletons), which inadequately capture intricate dynamics and hinder generalization to arbitrary, non-humanoid characters. To address these challenges, we present DreamActor-M2, a universal animation framework that reimagines motion conditioning as an in-context learning problem. Our approach follows a two-stage paradigm. First, we bridge the input modality gap by fusing reference appearance and motion cues into a unified latent space, enabling the model to jointly reason about spatial identity and temporal dynamics by leveraging the generative prior of foundational models. Second, we introduce a self-bootstrapped data synthesis pipeline that curates pseudo cross-identity training pairs, facilitating a seamless transition from pose-dependent control to direct, end-to-end RGB-driven animation. This strategy significantly enhances generalization across diverse characters and motion scenarios. To facilitate comprehensive evaluation, we further introduce AW Bench, a versatile benchmark encompassing a wide spectrum of characters types and motion scenarios. Extensive experiments demonstrate that DreamActor-M2 achieves state-of-the-art performance, delivering superior visual fidelity and robust cross-domain generalization. Project Page: https://grisoon.github.io/DreamActor-M2/",
    "keywords": [
      "Character Image Animation",
      "Spatiotemporal In-Context Learning",
      "Generative AI",
      "Motion Conditioning",
      "Data Synthesis"
    ],
    "area": [
      "Computer Vision",
      "Generative AI",
      "Deep Learning"
    ],
    "published_time": "2026-01-29T13:43:17.000Z",
    "download_time": "2026-02-02 12:01:20",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.21716\", \"arxiv_url\": \"https://arxiv.org/abs/2601.21716\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.21716.png\", \"original_title\": \"DreamActor-M2: Universal Character Image Animation via Spatiotemporal In-Context Learning\"}"
  },
  {
    "id": "2601.23228",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.23228",
    "title": "Scaling Multiagent Systems with Process Rewards",
    "summary": "While multiagent systems have shown promise for tackling complex tasks via specialization, finetuning multiple agents simultaneously faces two key challenges: (1) credit assignment across agents, and (2) sample efficiency of expensive multiagent rollouts. In this work, we propose finetuning multiagent systems with per-action process rewards from AI feedback (MAPPA) to address both. Through assigning credit to individual agent actions rather than only at task completion, MAPPA enables fine-grained supervision without ground truth labels while extracting maximal training signal from each rollout. We demonstrate our approach on competition math problems and tool-augmented data analysis tasks. On unseen math problems, MAPPA achieves +5.0--17.5pp on AIME and +7.8--17.2pp on AMC. For data analysis tasks, our method improves success rate by +12.5pp while quality metrics improve by up to 30%, validating that per-action supervision can lead to improvements across different multiagent system on various domains. By addressing these challenges, our work takes a first step toward scaling multiagent systems for complex, long-horizon tasks with minimal human supervision.",
    "keywords": [
      "multiagent systems",
      "process rewards",
      "AI feedback",
      "credit assignment",
      "sample efficiency"
    ],
    "area": [
      "AI Agent",
      "Artificial Intelligence",
      "Machine Learning"
    ],
    "published_time": "2026-01-30T17:55:27.000Z",
    "download_time": "2026-02-02 12:01:20",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.23228\", \"arxiv_url\": \"https://arxiv.org/abs/2601.23228\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.23228.png\", \"original_title\": \"Scaling Multiagent Systems with Process Rewards\"}"
  },
  {
    "id": "2601.22108",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.22108",
    "title": "Value-Based Pre-Training with Downstream Feedback",
    "summary": "Can a small amount of verified goal information steer the expensive self-supervised pretraining of foundation models? Standard pretraining optimizes a fixed proxy objective (e.g., next-token prediction), which can misallocate compute away from downstream capabilities of interest. We introduce V-Pretraining: a value-based, modality-agnostic method for controlled continued pretraining in which a lightweight task designer reshapes the pretraining task to maximize the value of each gradient step. For example, consider self-supervised learning (SSL) with sample augmentation. The V-Pretraining task designer selects pretraining tasks (e.g., augmentations) for which the pretraining loss gradient is aligned with a gradient computed over a downstream task (e.g., image segmentation). This helps steer pretraining towards relevant downstream capabilities. Notably, the pretrained model is never updated on downstream task labels; they are used only to shape the pretraining task. Under matched learner update budgets, V-Pretraining of 0.5B--7B language models improves reasoning (GSM8K test Pass@1) by up to 18% relative over standard next-token prediction using only 12% of GSM8K training examples as feedback. In vision SSL, we improve the state-of-the-art results on ADE20K by up to 1.07 mIoU and reduce NYUv2 RMSE while improving ImageNet linear accuracy, and we provide pilot evidence of improved token efficiency in continued pretraining.",
    "keywords": [
      "Value-Based Pre-Training",
      "Downstream Feedback",
      "Self-supervised learning",
      "Foundation Models",
      "Large Language Model"
    ],
    "area": [
      "Deep Learning",
      "Natural Language Processing",
      "Computer Vision"
    ],
    "published_time": "2026-01-29T18:38:09.000Z",
    "download_time": "2026-02-02 12:01:24",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.22108\", \"arxiv_url\": \"https://arxiv.org/abs/2601.22108\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.22108.png\", \"original_title\": \"Value-Based Pre-Training with Downstream Feedback\"}"
  }
]