[
  {
    "id": "hackernews_46618435",
    "source": "Hacker News",
    "url": "https://www.cnbc.com/2026/01/14/musk-tesla-full-self-driving-subscription-fsd.html",
    "title": "Tesla moving Full Self-Driving to a monthly subscription",
    "summary": "Tesla has announced a strategic shift for its Full Self-Driving (FSD) software, transitioning from an upfront purchase model to a monthly subscription service. This move, reported to commence on January 14, 2026, aims to make the advanced driver-assistance system more accessible to a broader customer base by reducing the initial financial barrier. The FSD system, which leverages sophisticated artificial intelligence, computer vision, and machine learning algorithms to enable autonomous driving functionalities, has historically been offered as a high-cost one-time purchase. The introduction of a subscription model is expected to provide Tesla with a more consistent and recurring revenue stream, supporting ongoing research and development in autonomous technology. Furthermore, it allows for greater flexibility for users who may not wish to commit to the substantial upfront cost, or who prefer to experience the evolving features of FSD on a more flexible basis. This business model adjustment reflects a growing trend in the automotive software sector, moving towards software-as-a-service (SaaS) offerings to monetize continuously updated and improving technological capabilities.",
    "keywords": [
      "Full Self-Driving",
      "Autonomous Vehicles",
      "Software Subscription",
      "Tesla FSD",
      "Advanced Driver-Assistance Systems",
      "Automotive AI",
      "Over-the-Air Updates"
    ],
    "area": [
      "Artificial Intelligence",
      "Robotics",
      "Computer Vision"
    ],
    "published_time": "2026-01-14 16:50:12",
    "download_time": "2026-01-14 20:01:08",
    "extra_info": "{\"score\": 35, \"by\": \"leopoldj\", \"descendants\": 17, \"story_id\": 46618435}"
  },
  {
    "id": "hackernews_46611823",
    "source": "Hacker News",
    "url": "https://en.wikipedia.org/wiki/1000_Blank_White_Cards",
    "title": "1000 Blank White Cards",
    "summary": "1000 Blank White Cards (1000BWCs) is an unconventional and highly adaptable card game characterized by its emphasis on player-driven creativity and emergent gameplay. Unlike traditional card games with fixed rules, 1000BWCs begins with a deck of entirely blank cards. Players are tasked with drawing and writing on these cards, thereby creating new rules, modifying existing ones, or introducing narrative elements and imagery into the game. This dynamic rule-making process means that the game evolves continuously with each session and player interaction, leading to unique and often humorous outcomes. The core mechanics revolve around collaborative storytelling and improvisation, where the game's structure and objectives are co-created by the participants. From a computational perspective, 1000BWCs presents an intriguing case study for research into dynamic system design, user-generated content generation, and adaptive rule-sets. The game's principles could inform the development of AI agents capable of understanding, interpreting, and even generating novel game rules or interactive experiences. Furthermore, the collaborative content creation aspect aligns with advancements in generative AI, which could be employed to create diverse card content or to simulate player interactions within such an open-ended framework. This unique approach to gameplay underscores the potential for systems where creativity and rule evolution are central, offering insights into human-computer interaction and adaptive intelligence.",
    "keywords": [
      "Generative AI",
      "AI Agent",
      "Emergent Gameplay",
      "Dynamic Rule Systems",
      "Computational Creativity",
      "User-Generated Content"
    ],
    "area": [
      "Generative AI",
      "AI Agent",
      "Natural Language Processing"
    ],
    "published_time": "2026-01-14 03:08:37",
    "download_time": "2026-01-14 20:01:26",
    "extra_info": "{\"score\": 337, \"by\": \"eieio\", \"descendants\": 59, \"story_id\": 46611823}"
  },
  {
    "id": "hackernews_46618407",
    "source": "Hacker News",
    "url": "https://www.msn.com/en-in/entertainment/celebrities/matthew-mcconaughey-trademarks-himself-to-fight-ai-misuse/ar-AA1UaVvt",
    "title": "Matthew McConaughey trademarks himself to fight AI misuse",
    "summary": "Matthew McConaughey has taken a proactive stance against the unauthorized use of his likeness and voice by artificial intelligence technologies by trademarking himself. This move highlights a growing concern among celebrities and public figures regarding the potential for AI misuse, including the creation of deepfakes, voice clones, and other forms of synthetic media that could misrepresent or exploit their digital identity without consent. By establishing legal trademarks, McConaughey aims to protect his intellectual property and control the commercial utilization of his persona in an era increasingly influenced by advanced generative AI. This action underscores the urgent need for clearer legal frameworks and ethical guidelines to govern AI development and deployment, particularly in safeguarding individual rights and combating identity theft in the digital realm. It could also set a precedent for how public figures and content creators navigate the evolving challenges presented by AI-driven content generation.",
    "keywords": [
      "AI Misuse",
      "Intellectual Property",
      "Generative AI",
      "Deepfakes",
      "Voice Cloning",
      "Digital Rights",
      "Celebrity Rights",
      "Legal Frameworks"
    ],
    "area": [
      "Artificial Intelligence",
      "Generative AI",
      "Computer Vision"
    ],
    "published_time": "2026-01-14 16:48:23",
    "download_time": "2026-01-14 20:01:22",
    "extra_info": "{\"score\": 17, \"by\": \"busymom0\", \"descendants\": 2, \"story_id\": 46618407}"
  },
  {
    "id": "hackernews_46620481",
    "source": "Hacker News",
    "url": "https://www.windowscentral.com/artificial-intelligence/jeff-bezos-says-the-quiet-part-out-loud-bezos-envisions-that-youll-give-up-your-pc-for-an-ai-cloud-version",
    "title": "Jeff Bezos hopes that you'll give up your PC to rent one from the cloud",
    "summary": "Jeff Bezos, founder of Amazon, has articulated a vision for the future of personal computing, suggesting a paradigm shift where users transition from owning traditional PCs to renting AI-powered virtual machines from the cloud. This concept implies a fundamental change in how individuals access and utilize computational resources, moving away from local hardware dependencies towards a fully cloud-centric model. Such a transition would leverage artificial intelligence to optimize performance, manage resources, and potentially offer a more seamless and personalized user experience. The implications include reduced upfront hardware costs for consumers, enhanced security through centralized management, and greater flexibility to access powerful computing environments from any device with an internet connection. This strategic outlook aligns with the ongoing expansion of cloud computing services and the pervasive integration of AI across various technological domains, highlighting a potential future where the physical desktop computer could become obsolete, replaced by an on-demand, AI-driven digital workspace provided by cloud infrastructure.",
    "keywords": [
      "Cloud Computing",
      "Artificial Intelligence",
      "Virtual Desktops",
      "Future of Computing",
      "Cloud Services"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2026-01-14 18:39:39",
    "download_time": "2026-01-14 20:01:13",
    "extra_info": "{\"score\": 14, \"by\": \"_____k\", \"descendants\": 9, \"story_id\": 46620481}"
  },
  {
    "id": "hackernews_46616562",
    "source": "Hacker News",
    "url": "https://github.com/tilework-tech/nori-cli",
    "title": "Show HN: Nori CLI, a better interface for Claude Code (no flicker)",
    "summary": "Clifford, a co-creator of Nori CLI, has unveiled a new command-line interface developed to resolve significant performance issues plaguing Claude Code's existing Terminal User Interface (TUI). Experiencing persistent flicker and strobing since last summer, Clifford noted these visual artifacts across various terminal setups, including restricted terminal splits, less optimized emulators, and even in fundamental virtual TTY environments, despite Anthropics' previous attempts to improve the TUI. The core contention is that rendering performant monospace text output should not be a complex challenge, indicating a potential architectural limitation in Claude Code's current interface. Nori CLI positions itself as a robust alternative, engineered to provide a smoother, more reliable interaction for developers who frequently use Claude Code. This community-driven solution emphasizes enhancing the daily productivity and user experience by eliminating distracting interface inconsistencies, underscoring the importance of efficient and stable developer tooling in modern software development workflows.",
    "keywords": [
      "Nori CLI",
      "Claude Code",
      "Terminal User Interface",
      "Command Line Interface",
      "Performance Optimization",
      "Developer Tools",
      "Text Rendering",
      "Flicker Mitigation"
    ],
    "area": [
      "Artificial Intelligence",
      "AI Agent",
      "Others"
    ],
    "published_time": "2026-01-14 14:40:51",
    "download_time": "2026-01-14 20:01:13",
    "extra_info": "{\"score\": 17, \"by\": \"csressel\", \"descendants\": 1, \"story_id\": 46616562}"
  },
  {
    "id": "hackernews_46616818",
    "source": "Hacker News",
    "url": "https://github.com/runkids/skillshare",
    "title": "Show HN: Skillshare \n– Sync skills across AI CLI tools",
    "summary": "Skillshare, a project recently showcased on Hacker News, introduces a novel approach to managing and synchronizing 'skills' across disparate AI Command Line Interface (CLI) tools. The core concept behind Skillshare is to enable developers and AI practitioners to effortlessly share, update, and maintain consistent AI functionalities – which could include specific models, custom configurations, data processing scripts, or inference pipelines – across their entire suite of CLI-based AI applications. This centralized synchronization mechanism aims to significantly enhance development workflow efficiency by eliminating the redundant task of configuring each AI tool individually. By fostering greater reusability and consistency, Skillshare intends to streamline the integration of various AI capabilities within a unified operational framework, ultimately reducing development friction and accelerating the deployment of AI-powered solutions. This initiative could prove invaluable for teams looking to standardize their AI toolchains and promote collaborative skill development.",
    "keywords": [
      "AI Tools",
      "CLI",
      "Skill Management",
      "AI Development",
      "Workflow Automation"
    ],
    "area": [
      "Artificial Intelligence",
      "Machine Learning",
      "AI Agent"
    ],
    "published_time": "2026-01-14 15:03:37",
    "download_time": "2026-01-14 20:01:33",
    "extra_info": "{\"score\": 7, \"by\": \"runkids\", \"descendants\": 0, \"story_id\": 46616818}"
  },
  {
    "id": "2601.08828",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.08828",
    "title": "Motion Attribution for Video Generation",
    "summary": "Despite the rapid progress of video generation models, the role of data in influencing motion is poorly understood. We present Motive (MOTIon attribution for Video gEneration), a motion-centric, gradient-based data attribution framework that scales to modern, large, high-quality video datasets and models. We use this to study which fine-tuning clips improve or degrade temporal dynamics. Motive isolates temporal dynamics from static appearance via motion-weighted loss masks, yielding efficient and scalable motion-specific influence computation. On text-to-video models, Motive identifies clips that strongly affect motion and guides data curation that improves temporal consistency and physical plausibility. With Motive-selected high-influence data, our method improves both motion smoothness and dynamic degree on VBench, achieving a 74.1% human preference win rate compared with the pretrained base model. To our knowledge, this is the first framework to attribute motion rather than visual appearance in video generative models and to use it to curate fine-tuning data.",
    "keywords": [
      "Motion Attribution",
      "Video Generation",
      "Data Attribution",
      "Generative Models",
      "Temporal Dynamics"
    ],
    "area": [
      "Generative AI",
      "Deep Learning",
      "Computer Vision"
    ],
    "published_time": "2026-01-13T18:59:09.000Z",
    "download_time": "2026-01-14 12:01:46",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.08828\", \"arxiv_url\": \"https://arxiv.org/abs/2601.08828\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.08828.png\", \"original_title\": \"Motion Attribution for Video Generation\"}"
  },
  {
    "id": "2601.08303",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.08303",
    "title": "SnapGen++: Unleashing Diffusion Transformers for Efficient High-Fidelity Image Generation on Edge Devices",
    "summary": "Recent advances in diffusion transformers (DiTs) have set new standards in image generation, yet remain impractical for on-device deployment due to their high computational and memory costs. In this work, we present an efficient DiT framework tailored for mobile and edge devices that achieves transformer-level generation quality under strict resource constraints. Our design combines three key components. First, we propose a compact DiT architecture with an adaptive global-local sparse attention mechanism that balances global context modeling and local detail preservation. Second, we propose an elastic training framework that jointly optimizes sub-DiTs of varying capacities within a unified supernetwork, allowing a single model to dynamically adjust for efficient inference across different hardware. Finally, we develop Knowledge-Guided Distribution Matching Distillation, a step-distillation pipeline that integrates the DMD objective with knowledge transfer from few-step teacher models, producing high-fidelity and low-latency generation (e.g., 4-step) suitable for real-time on-device use. Together, these contributions enable scalable, efficient, and high-quality diffusion models for deployment on diverse hardware.",
    "keywords": [
      "Diffusion Transformers",
      "Image Generation",
      "Edge Devices",
      "Efficient Inference",
      "Knowledge Distillation"
    ],
    "area": [
      "Generative AI",
      "Deep Learning",
      "Computer Vision"
    ],
    "published_time": "2026-01-13T07:46:46.000Z",
    "download_time": "2026-01-14 12:01:46",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.08303\", \"arxiv_url\": \"https://arxiv.org/abs/2601.08303\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.08303.png\", \"original_title\": \"SnapGen++: Unleashing Diffusion Transformers for Efficient High-Fidelity Image Generation on Edge Devices\"}"
  },
  {
    "id": "2601.08079",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.08079",
    "title": "MemoBrain: Executive Memory as an Agentic Brain for Reasoning",
    "summary": "Complex reasoning in tool-augmented agent frameworks is inherently long-horizon, causing reasoning traces and transient tool artifacts to accumulate and strain the bounded working context of large language models. Without explicit memory mechanisms, such accumulation disrupts logical continuity and undermines task alignment. This positions memory not as an auxiliary efficiency concern, but as a core component for sustaining coherent, goal-directed reasoning over long horizons. We propose MemoBrain, an executive memory model for tool-augmented agents that constructs a dependency-aware memory over reasoning steps, capturing salient intermediate states and their logical relations. Operating as a co-pilot alongside the reasoning agent, MemoBrain organizes reasoning progress without blocking execution and actively manages the working context. Specifically, it prunes invalid steps, folds completed sub-trajectories, and preserves a compact, high-salience reasoning backbone under a fixed context budget. Together, these mechanisms enable explicit cognitive control over reasoning trajectories rather than passive context accumulation. We evaluate MemoBrain on challenging long-horizon benchmarks, including GAIA, WebWalker, and BrowseComp-Plus, demonstrating consistent improvements over strong baselines.",
    "keywords": [
      "AI Agent",
      "Executive Memory",
      "Reasoning",
      "Large Language Models",
      "Context Management"
    ],
    "area": [
      "AI Agent",
      "Large Language Model",
      "Artificial Intelligence"
    ],
    "published_time": "2026-01-12T23:44:59.000Z",
    "download_time": "2026-01-14 12:01:44",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.08079\", \"arxiv_url\": \"https://arxiv.org/abs/2601.08079\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.08079.png\", \"original_title\": \"MemoBrain: Executive Memory as an Agentic Brain for Reasoning\"}"
  },
  {
    "id": "2601.07264",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.07264",
    "title": "The Confidence Dichotomy: Analyzing and Mitigating Miscalibration in Tool-Use Agents",
    "summary": "Autonomous agents based on large language models (LLMs) are rapidly evolving to handle multi-turn tasks, but ensuring their trustworthiness remains a critical challenge. A fundamental pillar of this trustworthiness is calibration, which refers to an agent's ability to express confidence that reliably reflects its actual performance. While calibration is well-established for static models, its dynamics in tool-integrated agentic workflows remain underexplored. In this work, we systematically investigate verbalized calibration in tool-use agents, revealing a fundamental confidence dichotomy driven by tool type. Specifically, our pilot study identifies that evidence tools (e.g., web search) systematically induce severe overconfidence due to inherent noise in retrieved information, while verification tools (e.g., code interpreters) can ground reasoning through deterministic feedback and mitigate miscalibration. To robustly improve calibration across tool types, we propose a reinforcement learning (RL) fine-tuning framework that jointly optimizes task accuracy and calibration, supported by a holistic benchmark of reward designs. We demonstrate that our trained agents not only achieve superior calibration but also exhibit robust generalization from local training environments to noisy web settings and to distinct domains such as mathematical reasoning. Our results highlight the necessity of domain-specific calibration strategies for tool-use agents. More broadly, this work establishes a foundation for building self-aware agents that can reliably communicate uncertainty in high-stakes, real-world deployments.",
    "keywords": [
      "tool-use agents",
      "calibration",
      "large language models",
      "reinforcement learning",
      "miscalibration"
    ],
    "area": [
      "Artificial Intelligence",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2026-01-12T07:10:35.000Z",
    "download_time": "2026-01-14 12:01:44",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.07264\", \"arxiv_url\": \"https://arxiv.org/abs/2601.07264\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.07264.png\", \"original_title\": \"The Confidence Dichotomy: Analyzing and Mitigating Miscalibration in Tool-Use Agents\"}"
  },
  {
    "id": "2601.07022",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.07022",
    "title": "Solar Open Technical Report",
    "summary": "We introduce Solar Open, a 102B-parameter bilingual Mixture-of-Experts language model for underserved languages. Solar Open demonstrates a systematic methodology for building competitive LLMs by addressing three interconnected challenges. First, to train effectively despite data scarcity for underserved languages, we synthesize 4.5T tokens of high-quality, domain-specific, and RL-oriented data. Second, we coordinate this data through a progressive curriculum jointly optimizing composition, quality thresholds, and domain coverage across 20 trillion tokens. Third, to enable reasoning capabilities through scalable RL, we apply our proposed framework SnapPO for efficient optimization. Across benchmarks in English and Korean, Solar Open achieves competitive performance, demonstrating the effectiveness of this methodology for underserved language AI development.",
    "keywords": [
      "Solar Open",
      "Mixture-of-Experts",
      "LLMs",
      "underserved languages",
      "Reinforcement Learning"
    ],
    "area": [
      "Large Language Model",
      "Natural Language Processing",
      "Artificial Intelligence"
    ],
    "published_time": "2026-01-11T18:33:09.000Z",
    "download_time": "2026-01-14 12:01:45",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.07022\", \"arxiv_url\": \"https://arxiv.org/abs/2601.07022\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.07022.png\", \"original_title\": \"Solar Open Technical Report\"}"
  },
  {
    "id": "2601.06487",
    "source": "huggingface",
    "url": "https://huggingface.co/papers/2601.06487",
    "title": "ArenaRL: Scaling RL for Open-Ended Agents via Tournament-based Relative Ranking",
    "summary": "Reinforcement learning has substantially improved the performance of LLM agents on tasks with verifiable outcomes, but it still struggles on open-ended agent tasks with vast solution spaces (e.g., complex travel planning). Due to the absence of objective ground-truth for these tasks, current RL algorithms largely rely on reward models that assign scalar scores to individual responses. We contend that such pointwise scoring suffers from an inherent discrimination collapse: the reward model struggles to distinguish subtle advantages among different trajectories, resulting in scores within a group being compressed into a narrow range. Consequently, the effective reward signal becomes dominated by noise from the reward model, leading to optimization stagnation. To address this, we propose ArenaRL, a reinforcement learning paradigm that shifts from pointwise scalar scoring to intra-group relative ranking. ArenaRL introduces a process-aware pairwise evaluation mechanism, employing multi-level rubrics to assign fine-grained relative scores to trajectories. Additionally, we construct an intra-group adversarial arena and devise a tournament-based ranking scheme to obtain stable advantage signals. Empirical results confirm that the built seeded single-elimination scheme achieves nearly equivalent advantage estimation accuracy to full pairwise comparisons with O(N^2) complexity, while operating with only O(N) complexity, striking an optimal balance between efficiency and precision. Furthermore, to address the lack of full-cycle benchmarks for open-ended agents, we build Open-Travel and Open-DeepResearch, two high-quality benchmarks featuring a comprehensive pipeline covering SFT, RL training, and multi-dimensional evaluation. Extensive experiments show that ArenaRL substantially outperforms standard RL baselines, enabling LLM agents to generate more robust solutions for complex real-world tasks.",
    "keywords": [
      "Reinforcement Learning",
      "LLM Agents",
      "Open-ended Agents",
      "Relative Ranking",
      "Tournament-based Ranking"
    ],
    "area": [
      "Machine Learning",
      "Large Language Model",
      "AI Agent"
    ],
    "published_time": "2026-01-10T08:43:07.000Z",
    "download_time": "2026-01-14 12:01:46",
    "extra_info": "{\"url\": \"https://huggingface.co/papers/2601.06487\", \"arxiv_url\": \"https://arxiv.org/abs/2601.06487\", \"thumbnail\": \"https://cdn-thumbnails.huggingface.co/social-thumbnails/papers/2601.06487.png\", \"original_title\": \"ArenaRL: Scaling RL for Open-Ended Agents via Tournament-based Relative Ranking\"}"
  }
]